{
    "city": "Kharagpur, India",
    "position": "Associate Professor of Finance at Indian Institute of Technology Kharagpur",
    "experience": [
        {
            "title": "IIT Kharagpur - Vinod Gupta School of Management",
            "location": "Kharagpur, West Bengal, India",
            "description_html": null,
            "duration": "10 years 2 months",
            "positions": [
                {
                    "subtitle": "IIT Kharagpur - Vinod Gupta School of Management",
                    "meta": "May 2024 - Present 8 months",
                    "duration": "May 2024 - Present 8 months",
                    "start_date": "May 2024",
                    "end_date": "Present",
                    "duration_short": "8 months",
                    "title": "Associate Professor - Finance & Accounting",
                    "description_html": null
                },
                {
                    "subtitle": "IIT Kharagpur - Vinod Gupta School of Management",
                    "meta": "Aug 2024 - Present 5 months",
                    "duration": "Aug 2024 - Present 5 months",
                    "start_date": "Aug 2024",
                    "end_date": "Present",
                    "duration_short": "5 months",
                    "title": "Coordinator - Admissions (MBA Program)",
                    "description_html": null
                },
                {
                    "subtitle": "IIT Kharagpur - Vinod Gupta School of Management",
                    "meta": "Jan 2022 - Present 3 years",
                    "duration": "Jan 2022 - Present 3 years",
                    "start_date": "Jan 2022",
                    "end_date": "Present",
                    "duration_short": "3 years",
                    "title": "Coordinator - Executive MBA Program",
                    "description_html": null
                },
                {
                    "subtitle": "IIT Kharagpur - Vinod Gupta School of Management",
                    "meta": "Nov 2014 - May 2024 9 years 7 months",
                    "duration": "Nov 2014 May 2024 9 years 7 months",
                    "start_date": "Nov 2014",
                    "end_date": "May 2024",
                    "duration_short": "9 years 7 months",
                    "title": "Assistant Professor - Finance & Accounting",
                    "description_html": null
                }
            ],
            "company": "IIT Kharagpur - Vinod Gupta School of Management",
            "url": "",
            "company_logo_url": null
        },
        {
            "title": "Asia-Pacific Risk and Insurance Association (APRIA)",
            "location": "Singapore",
            "description_html": null,
            "duration": "3 years 5 months",
            "positions": [
                {
                    "subtitle": "Asia-Pacific Risk and Insurance Association (APRIA)",
                    "meta": "Aug 2024 - Present 5 months",
                    "duration": "Aug 2024 - Present 5 months",
                    "start_date": "Aug 2024",
                    "end_date": "Present",
                    "duration_short": "5 months",
                    "title": "Secretary",
                    "description_html": null
                },
                {
                    "subtitle": "Asia-Pacific Risk and Insurance Association (APRIA)",
                    "meta": "Aug 2021 - Jul 2024 3 years",
                    "duration": "Aug 2021 Jul 2024 3 years",
                    "start_date": "Aug 2021",
                    "end_date": "Jul 2024",
                    "duration_short": "3 years",
                    "title": "Member - Board of Governors",
                    "description_html": null
                }
            ],
            "company": "Asia-Pacific Risk and Insurance Association (APRIA)",
            "company_logo_url": null
        },
        {
            "title": "Institute Post-doctoral Fellow - Finance",
            "location": "Chennai, Tamil Nadu, India",
            "description_html": null,
            "duration": "Jul 2012 Oct 2014 2 years 4 months",
            "start_date": "Jul 2012",
            "end_date": "Oct 2014",
            "duration_short": "2 years 4 months",
            "company": "Indian Institute of Technology, Madras",
            "url": "",
            "company_logo_url": ""
        },
        {
            "title": "AIP - Finance & Control Area",
            "location": "Bengaluru, Karnataka, India",
            "description_html": null,
            "duration": "Jul 2010 Jun 2012 2 years",
            "start_date": "Jul 2010",
            "end_date": "Jun 2012",
            "duration_short": "2 years",
            "company": "Indian Institute of Management, Bangalore",
            "url": "",
            "company_logo_url": ""
        },
        {
            "title": "PhD Candidate - Finance",
            "location": "New Delhi, Delhi, India",
            "description_html": null,
            "duration": "Jan 2008 Nov 2011 3 years 11 months",
            "start_date": "Jan 2008",
            "end_date": "Nov 2011",
            "duration_short": "3 years 11 months",
            "company": "Jamia Millia Islamia (Central University), New Delhi",
            "url": "",
            "company_logo_url": ""
        }
    ],
    "education": [
        {
            "title": "Jamia Millia Islamia",
            "degree": "Ph. D.",
            "url": "",
            "start_year": "2007",
            "end_year": "2011",
            "description": null,
            "description_html": null,
            "institute_logo_url": ""
        },
        {
            "title": "Jamia Millia Islamia",
            "degree": "M. Com. (Spl.: Business Management)",
            "url": "",
            "start_year": "2005",
            "end_year": "2007",
            "description": null,
            "description_html": null,
            "institute_logo_url": ""
        },
        {
            "title": "Lalit Narayan Mithila University, Darbhanga",
            "degree": "B.Com. (Hons)",
            "url": "",
            "start_year": "2000",
            "end_year": "2003",
            "description": null,
            "description_html": null,
            "institute_logo_url": ""
        },
        {
            "title": "S. Sinha College, Aurangabad",
            "degree": "Senior Secondary",
            "start_year": "1998",
            "end_year": "2000",
            "description": null,
            "description_html": null,
            "institute_logo_url": ""
        }
    ],
    "courses": "[{\"subtitle\":\"NPTEL\",\"title\":\"Behavioral and Personal Finance (MOOC)\"},{\"subtitle\":\"NPTEL\",\"title\":\"Corporate Finance (MOOC)\"}]",
    "certifications": [
        {
            "meta": "Issued May 2024Credential ID 105004162See credential",
            "subtitle": "CFA Institute",
            "title": "Research Challenge"
        },
        {
            "meta": "Issued Mar 2020See credential",
            "subtitle": "Indian Institute of Corporate Affairs ",
            "title": "Online Proficiency Self Assessment Test for Independent Director's Databank"
        },
        {
            "meta": "Issued Jul 2023Expires Aug 2025Credential ID 78195111See credential",
            "subtitle": "American Accounting Association",
            "title": "AAA Member"
        }
    ],
    "current_company_name": "IIT Kharagpur - Vinod Gupta School of Management",
    "publications": "[{\"title\":\"Herd Behavior and Asset Pricing in the Indian Stock Market\",\"subtitle\":\"IIMB Management Review\",\"date\":\"June 13, 2020\",\"description\":\"Literature on financial economics suggests that market participants tend to suppress their own information and try to imitate others in the market, thereby herding against their private information. This tendency is attributed to risk aversion characteristic of economic agents that rely more on short cuts and heuristics in order to avoid risk of losing time required to incorporate private information. Such a tendency also results in the asymmetric expected returns on assets. We attempt to find empirical evidence of herding in two different cross-sections of financial markets using cross-sectional deviations of stock returns to measure the dispersion of individual stock returns from average market return. Using a unique dataset of daily stock returns from January 2011 to December 2015, we examine the small and large-cap stocks for the effect of herding. We study the existence of herding in two cross-sections of stocks in the Indian stock market and show that stocks with robust fundamentals observe little or negligible evidence of herding while vulnerable stocks are evidently found to be affected by herding. While examining herding, we show whether the cross-sectional dispersion of stock returns in large-cap stocks are lower compared to that in small-cap stocks, implying stocks with higher market capitalization and trading volume are less prone to herding.\"},{\"title\":\"Impact of ownership structure and dividend on firm performance and firm risk\",\"subtitle\":\"Managerial Finance\",\"date\":\"August 12, 2019\",\"description\":\"The study employs signaling and bankruptcy theories to evaluate the influence of ownership structure and dividend payout over a firm’s corporate performance. The authors use a panel regression approach to measure the performance of family owned firms against that of widely held firms.\"},{\"title\":\"Application of VIX and entropy indicators for portfolio rotation strategies\",\"subtitle\":\"Research in International Business and Finance\",\"date\":\"Jul 2017\",\"description\":\"In our study, we use sample entropy and approximate entropy indicators − derived from the India Volatility Index (India VIX) − to explore the feasibility of style, size and time horizon-based portfolio rotation strategies. We show that these two entropy-based indicators are significantly and strongly related to portfolio rotation strategy based on style and size than the trading strategies based on signals derived from percentage change in India VIX. Finally, the comparative portfolio performances show that the trading strategies based on sample entropy outperform those based on VIX change. These results provide evidence of the prospect for new investment and diversification strategies in the otherwise less-studied emerging markets.\"},{\"title\":\"Does individual heterogeneity shape retail investor behaviour?\",\"subtitle\":\"International Journal of Social Economics\",\"date\":\"May 2017\",\"description\":\"The purpose of this paper is to survey retail investors to study the determinants of their investment behaviour and show that individual heterogeneity and financial factors such as gender, age, educational status, income, and investment levels determine their trading behaviour across three domains; however, features such as marital status and occupation do not play any significant role in shaping their trading behaviour.\"},{\"title\":\"Behavioural Asset Pricing: Review and Synthesis\",\"subtitle\":\"Journal of Interdisciplinary Economics\",\"date\":\"January 15, 2017\",\"description\":\"This article presents an overview of literature on behavioural and experimental asset pricing theory. We systematically review the evolution and current development of behavioural asset pricing models as an alternate approach to asset pricing in financial economics literature. A review and synthesis of research carried out in behavioural finance spreading across theoretical, empirical and experimental approaches are presented to understand the behavioural dimension of pricing of financial assets. From theoretical perspective, behavioural asset pricing models try to adopt additional behavioural variables into asset pricing process. In terms of empirical investigation perspective, it is documented that econometric and computational advancement takes its biggest place ever in financial literature when compared with the other field. Our review underlines the fact that the direction of advancing a methodology is changing from financial literature to economics due to the fact that there is huge account of raw data available to analyze. Future research direction should be judging the empirical power of the asset pricing models and their role in practice for incorporating a new dimension to the model. The distinctiveness of the study is that this is the first attempt to review literature written on behavioural asset pricing models in the form of structural empirical review. In doing so, the historical perspective of the concept and the place it will take in future are clarified and the way further researches will be conducted are explored.\"},{\"title\":\"On Asymmetric Relationship of India Volatility Index (India VIX) with Stock Market Returns and Risk Management\",\"subtitle\":\"DECISION (Springer India)\",\"date\":\"January 3, 2015\",\"description\":\"This study examines the asymmetric relationship between India volatility index (India VIX) and stock market returns, and demonstrates that Nifty returns are negatively related to the changes in India VIX levels, but in case of high upward movements in the market, the returns on the two indices tend to move independently. When the market takes sharp downward turn, the relationship is not as significant for higher quantiles. This property of India VIX makes it a strong candidate for risk management tool whereby derivative products based on the volatility index can be used as a tool for portfolio insurance against worst declines. We also find that India VIX captures stock market volatility better than traditional measures of volatility including ARCH/GARCH class of models. Finally, we test whether changes in India VIX can be used as a signal for switching portfolios. Our analysis of timing strategy based on change in India VIX exhibits that switching to large-cap (mid-cap) portfolio when India VIX increases (decreases) by a certain percentage point can be useful for maintaining positive returns on a portfolio.\"},{\"title\":\"India Volatility Index (India VIX) and Risk Management in the Indian Stock Market\",\"subtitle\":\"NSE Working Papers Series (NSE WP/9/2013)\",\"date\":\"August 2, 2013\",\"description\":\"Risk management has always been one of the primary concerns for investors, traders, and other stock market participants. A major portion of risk originates from the uncertainty in returns i.e.volatility. National Stock Exchange of India Ltd. introduces India Volatility Index (also known as India VIX)which captures expected volatility over next 30 days. Volatility index measures the market’s expectation of near-term volatility which is significantly related with returns that investors experience in the stock market. We completed a research study commissioned by the NSE, that focuses on various aspects of the India VIX. In this study, we examine asymmetric relationship between India volatility index (India VIX) and stock market returns, and demonstrates that the returns on the Nifty index are negatively related to the changes in the India VIX levels, but in case of high upward movements in the market, the returns on the two indices tend to move independently. Our empirical findings also reveal that when the market takes sharp southward turns, the relationship is not as significant for higher quantiles. This property of the India VIX enables the investors to use it as a potential tool for risk management whereby derivative products based on the volatility index can be used as a mechanism for portfolio insurance against sharp declines.We also provide evidence in support of India VIX as a superior measure of stock market volatility (compared to other traditional measures such as standard deviation, and so forth). Our simulation results suggest that a certain percentage change in India VIX can be used as an indicator to shift between the portfolios and thereby maintaining position returns thereon.\"},{\"title\":\"Cause and Effect between FII Trading Behaviour and Stock Market Returns: The Indian Experience\",\"subtitle\":\"Journal of Indian Business Research\",\"date\":\"October 2, 2012\",\"description\":\"Using daily data on three different measures of FII trading volume as proxy for FII trading behaviour and S&P CNX Nifty returns, Granger-causality approach is applied to investigate into the bi-directional causality between net FII trades and returns. The present study observes bi-directional causality between net FII investment and Indian stock market return. But, in general, the FIIs seem to be chasing the Indian stock market returns. It is found that FII trading behaviour resulting in heavy trading volumes may cause variations in stock market returns only in very short term, but afterwards, it is the stock market returns which cause changes in FII trading behaviour.\"},{\"title\":\"Factors Influencing Indian Individual Investors: Survey Evidence\",\"subtitle\":\"Decision (0304-0941), IIM Calcutta\",\"date\":\"2012\",\"description\":\"Vol. 39, Iss. 3, pp: 141-167.(Vol/Iss. URL: http://facultylive.iimcal.ac.in/content/current-issue-2)\"},{\"title\":\"Stock Market Anomalies: A Test of Calendar Effect in the Bombay Stock Exchange\",\"subtitle\":\"Indian Journal of Finance\",\"date\":\"May 2011\",\"description\":\"Various seasonal patterns in returns have been found in the stock markets across the world. These patterns often referred to as anomalies, can be seasonal. This study examines whether calendar anomalies exist in the stock returns in the Bombay Stock Exchange (BSE). It investigates two types of calendar anomalies such as the turn-of-the-month effect and the time-of-the-month effect in returns in one of the leading stock exchanges of India. Data pertaining to the ten-year period of 1998-2007 has been used for testing the two types of calendar anomalies. Results reveal that the turn-of-the-month effect and the time-of-the-month effect have significantly existed in BSE Sensex returns. Returns in the first few days of the month are found to be positively significant compared to the remaining days of the month. Different time segments of a month, however, witness significantly varying returns. The evidence of this study strongly supports the existence of calendar effects in the returns of the BSE-Sensex.\"},{\"title\":\"Analyzing the Influence of Contextual Factors on the Public Private Partnerships in Infrastructure\",\"subtitle\":\"Macmillan Advanced Research Series [ISBN 9780230332164}\",\"date\":\"January 16, 2011\",\"description\":\"The contribution of infrastructure to economic growth, both in developed and in emerging economies is well recognised in policy debates. As developing sound infrastructure demands funds for their capital needs of high magnitude, governments at all levels have been forced to look beyond traditional sources of finance and consider alternative means of financing them. Governments have been shifting their focus on PPP arrangements to provide education, health, water and waste management, and other social services. Some countries are able to attract more investments in public infrastructure through public-private partnerships than others. What are the determinants of private sector participation with public sector in providing public infrastructure? Why are public-private partnerships increasingly widespread in some countries and in select sectors? This paper attempts to explore these questions, and analyze the determinants of PPPs in infrastructure projects in select developing economies. The basic methodology of this paper rests on the OLS regression models to examine the determinants of the number of PPP projects in infrastructure and the value of each investment, as a percentage of GDP in such ventures. Using the World Bank’s Private Participation in Infrastructure (PPI) database on projects for developing countries during 1999–2008, the study constitutes the analysis of the multisector dataset for select developing countries. The findings of the study suggest that PPPs tend to be dependent on the debt burdens of governments, aggregate demand and market size, and macroeconomic factors. This paper also provides evidence on the PPP determinants varying from industry to industry. This paper also finds that private participation in providing public services with the public sector depends on the political constraints, macroeconomic factors, market environment, and past experience with PPPs.\"},{\"title\":\"Predicting Stock Returns in Nifty Index: An Application of Artificial Neural Network\",\"subtitle\":\"International Research Journal of Finance and Economics\",\"date\":\"Sep 2010\",\"description\":\"Artificial neural network (ANN) models have been proved to be very powerful predictive tools where a variable is explained with a set of explanatory variables without assuming any structural or linear relationship among the variables. In the field of finance, alarge number of models, especially those derived from the field of econometrics, are used to forecasting stock returns. This paper intends to test the forecasting ability of ANN models in case of Nifty index returns. Daily time series data of the index of National Stock Exchange is analyzed using three layer architecture of the ANN. The results of the study reveal that ANN models could be efficiently predict daily returns of Nifty index for a given period under investigation. The results of this study are significant value addition to the trading decisions in the stock index futures.\"},{\"title\":\"Writing Up\",\"subtitle\":\"Postgraduate Toolbox\",\"date\":\"Sep 2010\",\"description\":\"Postgraduate researchers find it very cumbersome to write their dissertation, especially when it comes to write PhD thesis. They are confused about from where to start. This article attempts to through some light on 'how to start writing a good thesis'.\"},{\"title\":\"Selection Behavior of Individual Investors: Evidence from Mutual Fund Investment\",\"subtitle\":\"The Journal of Venture Capital & Financial Services\",\"date\":\"June 1, 2010\",\"description\":\"How investors make investment decisions is the prime concern for any institution offering financial products such as insurance companies, hedge funds, mutual fund institutions and like. This paper attempts to study the selection behaviour with respect to mutual fund investments shown by individual investors. Individual investors differ in mutual fund investment decisions. This is because they can be distinguished on the basis of the sources of information they use for their investment decisions, several selection criteria employed for mutual fund investments, and particularly because of their different demographic characteristics. This study uses data collected through a survey of about 200 individual investors through a structured questionnaire. One-way Anova and chi-square tests were performed for analysis of data. Some multivariate statistical techniques were also applied in order to explore the dimensions in the information sources, and selection criteria, and to examine the extent of impact of different variables on the investors’mutual fund purchase decisions. The study reveals that individual investors are different from other class of investors. They rely, to a great extent, on financial advisors and professionals for information relevant to mutual fund investment decisions. This study suggests that expansion of information sources, selectioncriteria, and other decisive factors regarding investment as well as redemption by individual investors are major issues to be considered by mutual fund firms in order to understand this market in a better way.\"},{\"title\":\"Individual Investors Trading Behavior and the Competence Effect\",\"subtitle\":\"The Icfai University Journal of Behavioral Finance\",\"date\":\"Mar 2009\",\"description\":\"The paper analyzes the impact of competence of individual investors on their trading behavior in the stock market. Individual investors are seen trading too frequently. This impacts their returns from their investments, their belief in the stock markets, and also the functioning of financial markets to some extent. Investors with high level of competence tend to trade more frequently. While some factors affect individuals' perception towards external issues, some affect their belief in themselves, which in turn, influences their confidence and belief in their own judgment and decision making. This holds true in the context of investors in general and individual investors in particular. Individual investors take trading decisions based on their self-perceived competence that is influenced by several factors. The present study identifies the factors that determine individual investors' competence. The study examines the trading behavior of individual investors by using a modified questionnaire. A survey of 250 individual investors across the Delhi-NCR (National Capital Region) was undertaken to collect the primary data. The study uses a competence model to assess the competence effect on trading frequency of individual investors. Based on the findings of the survey data, the study explores the individual investors' trading behavior in the stock market.\"}]",
    "patents": null,
    "projects": "[{\"title\":\"Modeling Connectedness of Firms in Financial Markets with Heterogeneous Agents\",\"start_date\":\"Aug 2018\",\"end_date\":\"Present\"},{\"title\":\"Globalisation and Competition - A Cluster Approach for Enhancing Competitive Advantage for Small and Medium Scale Enterprises (SMEs) in India\",\"start_date\":\"Jan 2016\",\"end_date\":\"Feb 2019\"},{\"title\":\"Risk Aversion Among Individual Investors: Behavioural and Experimental Perspectives\",\"start_date\":\"Feb 2016\",\"end_date\":\"Jan 2019\"},{\"title\":\"India VIX and Risk Management\",\"start_date\":\"Mar 2013\",\"end_date\":\"Dec 2013\"}]",
    "honors_and_awards": null
}