{
    "city": "Bengaluru, Karnataka, India",
    "position": null,
    "experience": null,
    "education": [
        {
            "start_year": "2014",
            "end_year": "2018",
            "description": null,
            "description_html": null,
            "institute_logo_url": null
        }
    ],
    "courses": null,
    "certifications": null,
    "current_company_name": "Superwomen DAO",
    "publications": "[{\"title\":\"Piloting a methodology for sustainability education: project examples and exploratory action research highlights. \",\"subtitle\":\"Emerging Science Journal\",\"date\":\"Oct 2019\"},{\"title\":\"An Analysis of Critical Success Factors of Implementation of Green Supply Chain Management in Indian Tube Manufacturing Industries\",\"subtitle\":\"Springer\",\"date\":\"September 12, 2019\",\"description\":\"Synopsis:Green Supply Chain Management (GSCM) has emerged as an organizational philosophy to strive for sustainability excellence through the integration of ecological concepts with Traditional Supply Chain Management (TSCM) principles. Due to increasing environmental, economic and regulatory issues there is an urgent need to implement GSCM but Indian tube manufacturing SMEs are struggling to do it. This paper aims to identify various critical success factors to implement GSCM in Indian tube manufacturing SMEs by consultation with the industry experts and academicians. Interpretive Structural Modeling (ISM) technique is adopted to propose a structural model that not only helps us to understand the interrelationships between the different CSFs but also explains their interdependence in implementing GSCM. MICMAC analysis is performed to determine the driving and dependence power of the CSFs and classify them according to their significance. This approach is applied to 10 tube-manufacturing industries in the western region of India.About Book:This book focuses on novel design and systems engineering approaches, including theories and best practices, for promoting a better integration of people and engineering systems. It covers a range of hot topics related to: development of human-centered systems; interface design and human-computer interaction; usability and user experience; emergent properties of human behavior; innovative materials in manufacturing, bio-mechanics, and sports medicine, safety engineering and systems complexity business analytics, design and technology and many more.\"}]",
    "patents": null,
    "projects": "[{\"title\":\"Smart Dustbin\",\"start_date\":\"Nov 2017\",\"end_date\":\"May 2018\",\"description\":\"Dustbin which displays the quantity of food dumped, every time an individual throws leftover food in it and generates an alarm if the wastage is beyond a certain value.\"},{\"title\":\"Shape of Me\",\"start_date\":\"Jun 2017\",\"end_date\":\"Jul 2017\",\"description\":\"Put together an online resource community to bring hope and help to those struggling or fighting with body shaming.\"}]",
    "honors_and_awards": [
        {
            "title": "Public Speaker & Featured Expert",
            "publication": "35+ National & International Web3 Events/Hackathons, TV Interviews, & Podcasts",
            "date": "2022-01-01T00:00:00.000Z",
            "description": null
        },
        {
            "title": "Selected for Acumen - Unilever Social Incubator for Plastics",
            "publication": "Acumen - Unilever",
            "date": "2019-04-01T00:00:00.000Z",
            "description": null
        },
        {
            "title": "Fully Sponsored Trip to Singapore for a 10 days' Innovation Lab",
            "publication": "Unleash Lab 2018 - Singapore",
            "date": "2018-05-01T00:00:00.000Z",
            "description": null
        },
        {
            "title": "$2500 scholarship for Internship at Cornell University",
            "publication": "PDPU Office of International Research & Cornell Food & Brand Lab",
            "date": "2017-06-01T00:00:00.000Z",
            "description": null
        },
        {
            "title": "Received $1500 grant for a Summer Exchange Program @ Lamar University",
            "publication": "PDPU & Lamar University (USA)",
            "date": "2016-06-01T00:00:00.000Z",
            "description": null
        },
        {
            "title": "Best Delegate",
            "publication": "Asian Youth Model United Nations(AYMUN'15)",
            "date": "2015-07-01T00:00:00.000Z",
            "description": null
        },
        {
            "title": "Winner of Amethyst, National Level Modelling Competition",
            "publication": "Pandit Deendaya Petroleum University",
            "date": "2015-04-01T00:00:00.000Z",
            "description": null
        },
        {
            "title": "Selected amongst the top 200 for the MIT Media Lab India Initiative DI Workshop",
            "publication": "MIT Media Lab",
            "date": "2015-01-01T00:00:00.000Z",
            "description": null
        },
        {
            "title": "Selected amongst top 100 from 1k+ applications for the Winter School at IIM A",
            "publication": "IIM A",
            "date": "2015-01-01T00:00:00.000Z",
            "description": null
        }
    ]
}