{
    "city": "Ann Arbor, Michigan, United States",
    "position": null,
    "experience": null,
    "education": [
        {
            "title": "University of Nebraska at Omaha",
            "url": "",
            "start_year": "2016",
            "end_year": "2018-06",
            "description": null,
            "description_html": null,
            "institute_logo_url": null
        },
        {
            "start_year": "2006",
            "end_year": "2010",
            "description": null,
            "description_html": null,
            "institute_logo_url": null
        }
    ],
    "courses": "[{\"subtitle\":\"ISQA8220\",\"title\":\"Advanced Systems Analysis and Design\"},{\"subtitle\":\"ISQA8950\",\"title\":\"Capstone Management Information Systems\"},{\"subtitle\":\"ISQA 8546\",\"title\":\"Computer Security Management\"},{\"subtitle\":\"ISQA 8310\",\"title\":\"Data Communications\"},{\"subtitle\":\"ISQA 8410\",\"title\":\"Data Management\"},{\"subtitle\":\"ISQA 8700\",\"title\":\"Data Mining: Theory and Practice\"},{\"subtitle\":\"ISQA 8380\",\"title\":\"Enterprise Architecture and Systems Integration\"},{\"subtitle\":\"ISQA8900\",\"title\":\"Independent Research in MIS - Distributed Ledger Technologies\"},{\"subtitle\":\"CIST 2500\",\"title\":\"Introduction to Applied Statistics for IS&T\"},{\"subtitle\":\"ISQA 8210\",\"title\":\"Management of Software Development\"},{\"subtitle\":\"ISQA 8420\",\"title\":\"Managing the IS Function\"},{\"subtitle\":\"CIST 2100\",\"title\":\"Organizations, Applications, and Technology\"},{\"subtitle\":\"CYBR8470\",\"title\":\"SECURE WEB APPLICATION DEVELOPMENT\"},{\"subtitle\":\"ISQA 8080\",\"title\":\"Seminar in Management Information Systems - BigData Technologies\"}]",
    "certifications": [
        {
            "meta": "Issued Dec 2023Credential ID 4ef736ee-758a-437f-97ea-9cf137578234See credential",
            "subtitle": "Adobe Commerce",
            "title": "Adobe Certified Professional—Adobe Commerce Developer"
        },
        {
            "meta": "Issued Jan 2018Expires Apr 2018",
            "subtitle": "Udacity",
            "title": "Grow with Google Challenge Scholarship "
        },
        {
            "meta": "See credential",
            "subtitle": "Udemy",
            "title": "Angular Fast Crash Course"
        },
        {
            "meta": "See credential",
            "subtitle": "IBM",
            "title": "IBM Blockchain Essentials"
        },
        {
            "subtitle": "University of Nebraska at Omaha",
            "title": "Systems Analysis and Design"
        }
    ],
    "current_company_name": "Rightpoint",
    "publications": null,
    "patents": null,
    "projects": "[{\"title\":\"Blockchain - Technical and business perspective\",\"start_date\":\"Jan 2018\",\"end_date\":\"May 2018\",\"description\":\"Blockchain - Technical and business perspective\"},{\"title\":\"CharityQ\",\"start_date\":\"Jan 2018\",\"end_date\":\"May 2018\",\"description\":\"Together Achieve Greater Good (TAGG) created an application for businesses to streamline the donation request process for small and large businesses. When individuals purchase goods and services from a participating business and then share them on social media a donation is made. To take the TAGG application a step further, the TAGG team dreamed of an additional service named CharityQ that could allow the businesses to easily process the donation requests being generated. This would free the decision makers and business owners to focus more on the business and still support the community by providing donations.This project included -1 Formal SoW2. Release planning3. User Stories4. Two week Sprints5. Mock-ups and Prototype Demo 6. A eight member team in various role7 . Onsite client meetings\"},{\"title\":\"eteams\",\"start_date\":\"Aug 2017\",\"end_date\":\"May 2018\",\"description\":\"ETeams are cross-disciplinary, student-led teams that assist micro-enterprises in using IT to grow their businesses. This process is carried out by IT Therapists who administer customized solutions to address very specific business problems. The IT Therapists administer these solutions through training, trust building, and technology implementation. The outcomes of these interventions are measured in terms of economic, social, and human development criteria. The training of IT Therapists began in 2006 with the IT for Development course offered in the College of IS&T (link). These IT Therapists became part of ETeams in 2007 when funding was secured for them through the NU Foundation. Since then additional funding sources have enabled a larger sample of small businesses to be served. Over 100 businesses have been part of this process since the start of this program. So far improvements have been measured in terms of administrative efficiency, access to new markets, and learning and labor productivity.This program trains micro-enterprise owners how to use information technology effectively by providing needs-based information systems training, technical assistance and operations and development services to micro-enterprises. Micro-enterprise owners gain the skills and knowledge necessary to use information technology to grow their businesses, and learn to access new customers and markets, achieve administrative efficiency, improve their businesses, and increase productivity. Current efforts have focused on highly customized interventions of technology, know-how, and guidance for individual micro enterprises. Students work on location with the micro-entrepreneurs to provide customized technology-based solutions to pressing business problems.\"},{\"title\":\"Information Technology for Development - Eteams\",\"start_date\":\"Aug 2017\",\"end_date\":\"May 2018\",\"description\":\"As a graduate assistant I was tied up with the Information Technology for Development - Eteams for given tenure. I was responsible for maintenance and update of web portal and mobile applications.This program involves projects such as Small Business Development: Opportunities and Challenges, Cloud computing for Small businesses. Using this data collection website, Eteams analyze micro enterprises requirements and recommend solutions. ETeams are cross-disciplinary, student-led teams that assist micro-enterprises in using IT to grow their businesses. This process is carried out by IT Therapists who administer customized solutions to address very specific business problems. Students utilize given Android and iOS mobile application to collect data from various micro enterprise owners and store it on database linked to ITD web portal.The project is led and owned by - Professor Sajda Qureshi, Graduate Program ChairInformation Systems and Quantitative Analysis, Information Science and TechnologyUniversity of Nebraska at Omaha, NE\"},{\"title\":\"The WiSTEM Award Tracker App\",\"start_date\":\"Aug 2017\",\"end_date\":\"Dec 2017\",\"description\":\"The WiSTEM Award Tracker App is an search-oriented award management app for the UNO Women in stem program at the University of Nebraska Omaha. This service learning project was part of coursework and I contributed in backend part of this project in implementing email sending functionality. This project included -1 Formal client meeting 2. Release planning3. User Stories4. Two Sprints5. Mock-ups and Prototype Demo\"},{\"title\":\"NDOR-to-DCHUB\",\"start_date\":\"Feb 2017\",\"end_date\":\"Aug 2017\",\"description\":\"NDOR has been maintaining reports, drawings and other media files for all Nebraska bridges using a local Bridge Management system. This dataset was previously shared with researchers using an FTP server with no metadata and minimal search, query and retreival functions. To improve access to this dataset for NDOR and researchers nationwide, we have developed a set of programs for its curation and transition to a NSF DIBBS platform. Each file related to bridge health is also alinged and annotated with bridge inspection records submitted annually by NDOR to the National Bridge Inventory. This process requires converting the NDOR bridge management system directory structure to DataCenterHub directory structure.\"},{\"title\":\"Apartment Housing - CMS\",\"start_date\":\"Aug 2016\",\"end_date\":\"Dec 2016\",\"description\":\"This project is part of coursework management of software development utilizing agile methodology. The project scope was a real world scenario to build a web based solutions for a apartment company which can keep track of all apartments online and see all complaints etc. raised by apartment tenants. Tenants will also have ability to log complaints using web based form.This project included - 1 Formal SoW2. Release planning 3. User Stories4. Two Sprints5. Mock-ups and Prototype Demo 6. A five member team\"},{\"title\":\"https://github.com/4j4yk/adobe-aem\",\"description\":\"AEM hands on / Demo site using edge delivery services by adobe.\"},{\"title\":\"https://github.com/4j4yk/Demo_CarProfile\",\"description\":\"Demo API module using Laminas framework.\"}]",
    "honors_and_awards": null
}