{
    "city": "Toronto, Ontario, Canada",
    "position": "Astropreneur, Co-Founder of TOMARS // Co-Founder & Graphics Lead at HubTropolis",
    "experience": [
        {
            "title": "Co-Founder",
            "location": "Florence, Tuscany, Italy",
            "description": "TOMARS is a space tourism lifestyle retail greenfield venture concept.",
            "description_html": "TOMARS is a space tourism lifestyle retail greenfield venture concept. <!---->",
            "duration": "2020 - Present 4 years",
            "start_date": "2020",
            "end_date": "Present",
            "duration_short": "4 years",
            "company": "TOMARS",
            "company_id": "tomarsspace",
            "url": "",
            "company_logo_url": ""
        },
        {
            "title": "Co-Founder & Graphics Lead",
            "description": "As the co-founder and graphics/UX lead of HubTropolis, I lead our journey from vision with a creative and talented team focused on operations for blending design, technology, interactive media, and XR content production with maintaining an intense essence on simplicity.",
            "description_html": "As the co-founder and graphics/UX lead of HubTropolis, I lead our journey from vision with a creative and talented team focused on operations for blending design, technology, interactive media, and XR content production with maintaining an intense essence on simplicity. <!---->",
            "duration": "Sep 2021 - Present 3 years 4 months",
            "start_date": "Sep 2021",
            "end_date": "Present",
            "duration_short": "3 years 4 months",
            "company": "HubTropolis",
            "company_id": "hubtropolis",
            "url": "",
            "company_logo_url": ""
        }
    ],
    "education": [
        {
            "title": "University of Toronto",
            "url": "",
            "start_year": "2024",
            "description": null,
            "description_html": null,
            "institute_logo_url": ""
        },
        {
            "title": "Amity Global School",
            "degree": "International Baccalaureate Diploma Programme (IBDP)",
            "url": "",
            "start_year": "2022",
            "end_year": "2024",
            "description": "At Amity Global School Noida, I excelled as the IBDP topper and valedictorian of my batch. I led as Sports Captain and contributed to the Student Council during the 2023-24 academic year. As an Editor and Contributor for The Global Times, I authored impactful articles including \"Breaking the Chains: Healing Generational Wounds\" and \"A Chef's Culinary Capers.\" My commitment to community service was demonstrated through my volunteer work at Amitasha, where I taught diverse subjects to… Show more",
            "description_html": "At Amity Global School Noida, I excelled as the IBDP topper and valedictorian of my batch. I led as Sports Captain and contributed to the Student Council during the 2023-24 academic year. As an Editor and Contributor for The Global Times, I authored impactful articles including \"Breaking the Chains: Healing Generational Wounds\" and \"A Chef's Culinary Capers.\" My commitment to community service was demonstrated through my volunteer work at Amitasha, where I taught diverse subjects to…",
            "institute_logo_url": ""
        },
        {
            "title": "St. Xavier's World School",
            "start_year": "2020",
            "end_year": "2022",
            "description": null,
            "description_html": null,
            "institute_logo_url": ""
        },
        {
            "title": "Pathways School Noida",
            "url": "",
            "start_year": "2017",
            "end_year": "2020",
            "description": null,
            "description_html": null,
            "institute_logo_url": ""
        },
        {
            "title": "Kothari International School",
            "url": "",
            "start_year": "2012",
            "end_year": "2017",
            "description": null,
            "description_html": null,
            "institute_logo_url": ""
        }
    ],
    "courses": "[{\"subtitle\":\"CiSS v4\",\"title\":\"Certified Information Security Specialist\"}]",
    "certifications": [
        {
            "meta": "Issued Dec 2024Credential ID uipvcQKSrugUa9gWvkdeHzHSSee credential",
            "subtitle": "Bloomberg",
            "title": "Bloomberg Market Concepts"
        },
        {
            "meta": "Issued Jul 2024",
            "subtitle": "International Baccalaureate",
            "title": "International Baccalaureate Diploma"
        },
        {
            "meta": "Issued Nov 2021Credential ID lbpqcjxsiw8See credential",
            "subtitle": "University of Helsinki",
            "title": "Elements of AI"
        },
        {
            "meta": "Issued May 2021Credential ID 512799543eef4ca3bd889c506e2969d0See credential",
            "subtitle": "IBM",
            "title": "Big Data Foundations - Level 1"
        },
        {
            "meta": "Issued Jul 2019Credential ID 49b7245bed9e406c993f6b2e8bd5c43cSee credential",
            "subtitle": "IBM",
            "title": "Python for Data Science"
        }
    ],
    "current_company_name": "TOMARS",
    "publications": "[{\"title\":\"Regenesis: AI for Rewilding\",\"date\":\"November 4, 2023\",\"description\":\"\\\"Regenesis: AI for Rewilding\\\" is a captivating literary endeavour that takes you on an awe-inspiring journey at the intersection of artificial intelligence and ecological restoration. Delve into the profound potential of advanced technologies to harmonise with nature and breathe new life into our planet's dwindling ecosystems. In this visionary work, author Aryan Tomar skillfully navigates the realms of science, philosophy, and ethics to unravel the captivating narrative of rewilding our world.Through the eloquent prose and astute rigour of \\\"Regenesis,\\\" embark on a thought-provoking exploration of cutting-edge AI systems that assist in restoring ecological balance. Discover how this perspicacious technology can revolutionise the way we approach conservation efforts, harnessing their analytical prowess to understand and mitigate the impact of human activities on the environment. As the book transcends traditional boundaries, it weaves together profound insights, redefining our understanding of human-nature symbiosis.As you absorb the intricate tapestry of ideas woven within \\\"Regenesis,\\\" immerse yourself in an extraordinary quest for answers. Can we rely on artificial intelligence as a powerful ally in rejuvenating our planet? How can we leverage the vast potential of emerging technologies while ensuring the preservation of our planet's inherent wisdom? Join Aryan Tomar on this odyssey, and discover the profound possibilities that lie at the intersection of AI and rewilding.\"},{\"title\":\"TOMARS CREZ: Multi-Planetary Lifestyle\",\"subtitle\":\"TOMARS\",\"date\":\"December 10, 2021\",\"description\":\"TOMARS has a vision of scaling and sustaining an interplanetary society with an approach to fashion, XR, lifestyle, terraforming, and Martian colonization.We are witnessing the dawn of an incipient space age that will finally make traveling into space an affordable and remuneratively lucrative exercise. Countless entities both inside national governments and in boardrooms—and with the advent of new technologies, are taking aim at space, each according to their strengths and abilities. By blending hyperreality, 3D printing, artificial intelligence, cognizance, autonomous robotics, digital twinning, and neuro-centric cutting-edge technology, TOMARS is expanding the possibilities for human experience and building humanity's multi-planetary habitat a reality. TOMARS believes that space is for everyone, and to increment the global standard of living, we must go to space to tap its illimitable resources.TOMARS is a consortium of fashion visionaries, futurists, techno-creative intellectuals, technopreneurs, astropreneurs, neuroscientists, and XR producers – amalgamated by a common vision towards developing humanity's multi-planetary future.\"},{\"title\":\"Shadowing the Turbulence: A Biography of the Unsung Tomaras\",\"subtitle\":\"Amazon KDP\",\"date\":\"December 8, 2020\",\"description\":\"Western Uttar Pradesh has a proud history, but no historian. They have long memories, but little sense of history. Their record in patriotic valor is glorious. Some had James Tod, some had Grant Duff, some had Cunningham as historians, but this region had no historian. There are many unsung stories of individuals who have sacrificed and contributed to India's freedom and independence but haven't got the recognition they rightfully deserve. In 2022, India will be celebrating 75 years of her freedom, and as an extension of the \\\"i Déjà vu\\\" series, we have committed ourselves to extract and mine the long-lost jewels to recognize and bestow to the world the unknown histories that awaken and stimulates the aggression.The fusion between the dynasties and the rebels of India who fought for their freedom and transformed the ethos of Indian spirits. Aryan Tomar, an Indo-Canadian astropreneur teenager, brings this fascinating period vividly alive, combining cognizance with immersive storytelling, and analysis with an untold story, proudly interrogating his own great-grandfather and beyond.\"},{\"title\":\"3D Printing and Making Drones with Daddy\",\"subtitle\":\"Partridge Publishing\",\"date\":\"January 16, 2020\",\"description\":\"If you hear the word ’drone,’ most people’s first impression is that some kind of high-tech military aircraft is flying over the clouds while the pilot is sitting in a control room hundreds of miles away.That’s not exactly what we’re talking about here. More recently, the same term has been used to describe quadcopters: four-propeller remote-control aircraft. Since the flight stability and control algorithms have become more advanced, these miniature aircraft have become cheaper and more usable.Whether you call them Unmanned Aerial Vehicles (UAVs), Miniature Pilotless Aircraft, or Flying Mini Robots, drones are becoming increasingly popular. They are still in the early stages in terms of widespread acceptance and use, but drones have already broken through rigid conventional barriers in industries that once appeared impenetrable due to similar technical advances.In the past few years, drones have become integral to the operations of numerous companies and government agencies and have continued to pierce into areas where other sectors have either stagnated or lagged. From quick deliveries at rush hour to scanning an unreachable military base, drones are proving to be extremely beneficial in places where people are unable to perform in a timely and efficient manner.‘Making Drones with Daddy’ targets the age group of teenagers and young adults who are willing to explore and learn. The book uses illustrations and explanations to attract young readers and be able to teach with infotainment.Drones are very useful machines. In the future, knowing how to use a drone may be as useful as knowing how to read a book. The good news is that learning to build and flying drones and its fundamentals aren’t as hard as learning to read. If you’re mystified by the basics of a UAV or you just need a refresher, ’Making Drones with Daddy’ will get you up to speed in a lively, fun, and practical way.\"}]",
    "patents": null,
    "projects": "[{\"title\":\"Are We Too Quick to Assume that the Most Recent Evidence is Inevitably the Strongest? A TOK Exploration of Natural Sciences and History\",\"description\":\"This essay critically examines the assumption that recent evidence is inherently the strongest, using the natural sciences and history as areas of knowledge. Through historical cases like Blondlot's N-rays and Wegener's Plate Tectonics in the natural sciences, as well as the \\\"Paul is Dead\\\" rumour and the discovery of Troy in history, the essay explores the interplay between novelty and evidentiary strength. It highlights the need for balancing scepticism and openness when evaluating evidence, contributing to a nuanced understanding of knowledge evolution.\"},{\"title\":\"Exploring Real Estate Price Dynamics Through Mathematical Models (Mathematics IA)\",\"description\":\"Explored the use of mathematical models to understand and predict real estate price trends, with a focus on Toronto's property market from 2014 to 2023. The project involved analyzing data through techniques such as Pearson Correlation, Multiple Linear Regression, R-Squared, and t-Tests to assess the relationship between various factors influencing property prices. This research aimed to bridge the gap between abstract mathematical principles and real-world market dynamics, providing insights for data-driven decision-making in real estate.\"},{\"title\":\"Exploring the Impact of Social Media Algorithms on Political Beliefs and Voting Patterns (Digital Society IA)\",\"description\":\"Investigated the extent to which social media algorithms influence users' political beliefs and voting behavior. This research examined real-world examples, including the 2020 U.S. Presidential election, focusing on how algorithmic filtering can create echo chambers and reinforce confirmation biases. The study explored key digital society concepts such as change, expression, and power, and analyzed how algorithms can shape political discussions, amplify polarization, and impact democratic responsibilities. The project provided insights into the ethical and societal implications of algorithm-driven content in the political sphere.\"},{\"title\":\"Investigation on the Correlation Between Plant-Based Diets and Medication Intake for Chronic Diseases (Environmental Systems and Societies IA)\",\"description\":\"This research explored the potential relationship between adopting a plant-based diet and its impact on the frequency of medication intake for chronic diseases. Through a combination of stratified random sampling, surveys, and statistical analysis, the study examined how dietary choices may influence health outcomes, particularly in managing conditions like cardiovascular disease and diabetes. The findings contribute to a growing body of knowledge on sustainable dietary practices and their potential role in reducing healthcare and environmental burdens.\"},{\"title\":\"The Impact of Cashless UPI Transactions on the Indian Retail Digital Economy Post-COVID (Digital Society Extended Essay)\",\"description\":\"Conducted extensive research on the adoption of Unified Payments Interface (UPI) in India's retail sector post-COVID-19, analyzing its impact on financial inclusion, consumer behavior, and economic growth. The project involved primary research through interviews and surveys with industry stakeholders and a thorough review of scholarly literature. The findings highlight UPI's role in transforming the Indian digital economy by promoting cashless transactions and shaping the future of retail payments.\"},{\"title\":\"To what extent did the Adidas-Kanye controversy impact Adidas's brand image? (Business Management IA)\",\"description\":\"Analyzed the ethical implications of the Adidas-Kanye West controversy and its effects on Adidas's brand image. The study focused on how Kanye West's actions and social media commentary in 2023 affected public perception of Adidas. Using a combination of media reports, social media analysis, and public opinion polls, the research explored the brand's response and its alignment with ethical business practices and corporate social responsibility.\"},{\"title\":\"Venus: A Digitized Vegan Oasis (UI/UX Project)\",\"description\":\"In my concept, Venus, I undertook the design of an innovative user interface for an app that combines my passion for technology and sustainable living. Serving as a haven for the vegan community, Venus offers a seamless and intuitive experience for discovering and exploring vegan-friendly options in local communities. Utilizing my expertise in Figma, Adobe Illustrator, and Adobe Photoshop, I designed an interface that seamlessly merges stunning visuals with user-friendly functionality. By thoughtfully integrating cutting-edge design principles and captivating aesthetics, Venus provides an immersive digital oasis where users can effortlessly connect with plant-based eateries, explore delectable recipes, and engage with a thriving community of like-minded individuals. This project has not only honed my technical skills but has also deepened my understanding of the profound impact that technology can have in promoting sustainable lifestyles and fostering vibrant communities.\"},{\"title\":\"Exploring the Martian Frontier: VR Simulation\",\"description\":\"Step into the future with TOMARS VR, where I had the incredible opportunity to develop a groundbreaking 3D Mars simulation. As part of my entrepreneurial venture, TOMARS, I combined my passion for computational media with the latest scientific data to create an immersive experience of the red planet's surface. The simulation explored Mars' rugged landscapes, ancient geological formations, and potential sites for human colonization. With TOMARS VR, I wanted to push the boundaries of virtual reality technology, allowing users to engage with realistic simulations of rover missions and scientific experiments. This project represents my dedication to merging the realms of technology and exploration. Through TOMARS VR, I aim to foster a deeper understanding of space exploration and inspire future innovations in immersive storytelling and scientific discovery.\"},{\"title\":\"TOMARS Store Interior VR: A Virtual Shopping Experience\",\"description\":\"Using Blender, I created an immersive and visually stunning virtual reality simulation that allows you to explore the innovative products and futuristic designs within the TOMARS store. Discover a hyper-realistic digital environment where you can browse and interact with cutting-edge technologies, from advanced robotics to AI-powered gadgets and virtual reality devices. This unique virtual shopping experience revolutionizes the way customers engage with our brand, offering seamless navigation, interactive demos, and a glimpse into the future of retail.\"},{\"title\":\"Financial Literacy Among Homemakers in India\",\"description\":\"In this research/survey, we review our findings and literature on financial literacy and financial inculcation. We consider how financial literacy is quantified in the current literature and examine how well the subsisting literature addresses whether financial edification amends financial literacy or personal financial outcomes. We surveyed some stakeholders and analyzed the data we recorded and discuss the extent and degree to which sex is more literate in terms of finance. We review our survey on alternative policies to amend financial outcomes as per literacy and compare the evidence with that on the efficacy and cost of financial inculcation.\"},{},{},{\"title\":\"Midnight Passage: Desolate Highway\",\"description\":\"Using Unity and my own meticulously crafted 3D assets from Blender, I created a haunting horror video game \\\"Midnight Passage\\\" that plunges you into the depths of a lonely, dark highway. As you traverse this forsaken road, prepare to confront your deepest fears and unravel the mysteries that shroud this eerie landscape. Can you navigate the shadows of solitude and survive the terrors that lurk within? The Desolate Highway awaits, daring you to uncover its secrets and escape the grip of darkness.\"},{\"title\":\"VVe Being Donna: The Light, the Dark\",\"description\":\"I created a captivating 10-minute documentary called 'VVe Being Donna: The Light, the Dark,' which explores the remarkable life of my late grandmother, Dr. Veerbala. This powerful film delves into her journey, showcasing the challenges she overcame and the personal growth she experienced. Through her story, viewers gain valuable insights into self-awareness, resilience, and the pursuit of a developed mindset.\"},{\"title\":\"Music Project: Wanderer\",\"description\":\"Wanderer, a music project I produced using FL Studio. Within this endeavor, I composed a collection of captivating tracks that transcended genres and stirred introspection. Through intricately woven melodies and mesmerizing rhythms, Wanderer takes listeners on a transformative auditory journey. Exploring enchanting soundscapes and pulsating beats, Wanderer transported listeners to uncharted realms of musical inspiration, evoking profound emotions. It was a musical voyage that allowed Wanderer to serve as the soundtrack to soulful exploration.\"},{\"title\":\"TOMARS AR Experience\",\"description\":\"As part of our venture TOMARS, I created an augmented reality (AR) application using Unity, Vuforia, and Blender. This innovative application combines the power of cutting-edge technology with engaging user experiences. Users can immerse themselves in interactive 3D models and animations overlaid onto the real world, enhancing their understanding of the TOMARS project.\"}]",
    "honors_and_awards": [
        {
            "title": "Valedictorian",
            "publication": "Amity Global School Noida",
            "date": "2024-07-01T00:00:00.000Z",
            "description": "Valedictorian of the International Baccalaureate Diploma Programme (IBDP) Class of 2024 at Amity Global School Noida. Recognised for academic excellence, leadership, and outstanding achievement, graduating as the top student in my cohort."
        }
    ]
}