{
    "city": "Dubai, United Arab Emirates",
    "position": null,
    "experience": null,
    "education": [
        {
            "title": "Heriot-Watt University",
            "url": "",
            "start_year": "2012",
            "end_year": "2015",
            "description": null,
            "description_html": null,
            "institute_logo_url": null
        },
        {
            "start_year": "2011",
            "end_year": "2012",
            "description": null,
            "description_html": null,
            "institute_logo_url": null
        },
        {
            "title": ",",
            "start_year": "2009",
            "end_year": "2010",
            "description": null,
            "description_html": null,
            "institute_logo_url": null
        }
    ],
    "courses": "[{\"subtitle\":\"-\",\"title\":\"Anti Money Laundering Advanced Training Program\"},{\"subtitle\":\"-\",\"title\":\"Auditing and Assurance\"},{\"subtitle\":\"-\",\"title\":\"Business Research Methods\"},{\"subtitle\":\"-\",\"title\":\"Business Venturing\"},{\"subtitle\":\"-\",\"title\":\"Contemporary Issues in Financial Accounting\"},{\"subtitle\":\"-\",\"title\":\"Critical Writing and Analyis\"},{\"subtitle\":\"-\",\"title\":\"Finance, Theory and Markets 1\"},{\"subtitle\":\"-\",\"title\":\"Finance, Theory and Markets 2\"},{\"subtitle\":\"-\",\"title\":\"Financial Accounting\"},{\"subtitle\":\"-\",\"title\":\"Financial Derivatives\"},{\"subtitle\":\"-\",\"title\":\"International Bonds and Currency Markets\"},{\"subtitle\":\"-\",\"title\":\"Introduction to Accounting 1\"},{\"subtitle\":\"-\",\"title\":\"Introduction to Accounting 2\"},{\"subtitle\":\"-\",\"title\":\"Introduction to Economic\"},{\"subtitle\":\"-\",\"title\":\"Introduction to Finance 1\"},{\"subtitle\":\"-\",\"title\":\"Introduction to Finance 2\"},{\"subtitle\":\"-\",\"title\":\"Introduction to Management 1\"},{\"subtitle\":\"-\",\"title\":\"Introduction to Management 2\"},{\"subtitle\":\"-\",\"title\":\"Introduction to Marketing 1\"},{\"subtitle\":\"-\",\"title\":\"Introduction to Marketing 2\"},{\"subtitle\":\"-\",\"title\":\"Management Accounts, Techniques and Decisions\"},{\"subtitle\":\"-\",\"title\":\"Mergers and Acquisitons\"},{\"subtitle\":\"-\",\"title\":\"Quantitative Methods 1\"},{\"subtitle\":\"-\",\"title\":\"Quantitative Methods 2\"}]",
    "certifications": [
        {
            "meta": "Issued Mar 2020Credential ID 113147784See credential",
            "subtitle": "CFA Institute",
            "title": "CFA Institute Charterholder"
        },
        {
            "meta": "Issued May 2019",
            "subtitle": "Moralis Academy",
            "title": "Blockchain 101"
        },
        {
            "meta": "Issued Aug 2016",
            "subtitle": "BSEIndia",
            "title": "Advanced Financial Modeling"
        },
        {
            "meta": "Issued Aug 2016",
            "subtitle": "BSEIndia",
            "title": "Advanced Microsoft Excel"
        },
        {
            "meta": "Issued Aug 2016",
            "subtitle": "The CPD Certification Service",
            "title": "Diploma in Digital Marketing (Distinction 98%)"
        },
        {
            "meta": "Issued Mar 2016",
            "subtitle": "Skyline University College",
            "title": "Skyline University College - Winner New Idea Competition (Entrepreneuriship and Innovation Club)"
        },
        {
            "meta": "Issued Jul 2015",
            "subtitle": "SAP",
            "title": "Intro to ERP - SAP"
        },
        {
            "meta": "Issued Apr 2015",
            "subtitle": "Skyline University College",
            "title": "Winner - Skyline University's Inter-University Business Plan Competition (Entrepreneurship and Innovation Club)"
        },
        {
            "meta": "See credential",
            "subtitle": "McKinsey & Company",
            "title": "Mckinsey Forward Program Champion"
        }
    ],
    "current_company_name": "Cypher Capital Group",
    "publications": null,
    "patents": null,
    "projects": "[{\"title\":\"Global Management Challenge\",\"start_date\":\"Jan 2015\",\"description\":\"GMC is a strategic management challenge based on a case study. With effective group members, the challenge was fun and exciting not forgetting the thrill of new challenges in regular intervals.\"},{},{},{},{\"title\":\"Audit Regulation of UK\",\"start_date\":\"Nov 2014\",\"description\":\"To carry out a project on Audit regulation of UK, covering topics of UK Corporate Governance code 2012, role of an auditor, reasons of auditing. Further the project involved analysis of the elements of that control the audit regulation in UK, mainly legislation, Common law, Profession, Regulation. It was lastly ended with a conclusion through analysis of a case study of a fraud that occurred in UK in recent years.\"},{\"title\":\"International Bond and Currency Markets\",\"start_date\":\"Nov 2014\",\"description\":\"The main point of this project was to explain the fluctuations in exchange rate over a period providing analysis and justification. We as a team did a analysis of short term and long term fluctuations in exchange rates and in addition discussed the parity theory that judge the exchange rate in a period.\"},{},{},{},{\"title\":\"Management Accounts, Techniques and Decisions\",\"start_date\":\"Nov 2014\",\"description\":\"Management accounts project was based on logical understanding of a person in terms of business and accounts. We were given a case study of a bank that wished to change its incentive scheme for its sales staff. We as management accountants of the plan had to analyze the whole basis of the scheme and provide effective solutions to make the plan more productive.\"},{\"title\":\"Mergers and Acquisitions - Takeover Defense strategies based on a Case Study\",\"start_date\":\"Nov 2014\",\"description\":\"This project was based on a case study of Hostile takeover to be implemented by a company over a target. Our job as a team was to save the company from being taking over by highlighting the defense strategies that a target can opt for and our team also guided the target over a possible solution for the same. Overall a fun project and we learned a lot about how companies use intense tricks to gain a control over a firm.\"},{},{},{},{},{},{\"title\":\"Launch of a New Product - Leader\",\"start_date\":\"Dec 2013\",\"description\":\"This project aimed on creating a new product in the market. We decided upon making a product that was required in the market plus that could be sold easily. Our team finally ended to create a healthy chocolate for kids and elders giving them the right nutrients required for their health. The product consisted of many variations and we had many ideas that changed the plan regularly. Lastly, the team was rigid on creating a chocolate that had healthy ingredients like Oats and sesame.\"},{},{},{},{\"title\":\"Business Venturing - The Brokers Hub Restaurant\",\"start_date\":\"Jan 2015\",\"end_date\":\"May 2015\",\"description\":\"The final year course of Business Venturing was headed by Dr. Ummesalma Mujtaba (Professor of School of Management & Languages; Heriot-Watt University). This course required a team of six members who had to work on a 'Detailed Business Plan'​ over the period of 14 Weeks. At the end of 12 weeks the teams were to present the business plan in front of external judges who were Entrepreneurs and CEO's of leading companies from across Dubai. By week 14, all the teams were supposed to submit a hardcopy business plan proposal to the Professors. The project, 'The Brokers Hub Restaurant'​ was a healthy stock-market themed restaurant with price fluctuations. Over the period of 14 weeks, the team worked on management structure, financials, marketing plan, forecasting, costing, and various other important business aspects.- After the presentations in week 12, the team was nominated in the Top 4 teams after competing against 32 teams from the University. After the hardcopy submission in week 14, the team was one of the very few top achievers for the coursework (was Graded A+). - The project was further developed and taken forward to Skyline University's Inter University Business Plan Competition, where the team and the project secured First Position after competing against 22 teams from across the Gulf. The competition was mentored and judged by top bankers and entrepreneurs of UAE.\"},{},{},{},{},{},{\"title\":\"Customer Social Responsibility Project - Leader\",\"start_date\":\"Sep 2012\",\"end_date\":\"Dec 2012\",\"description\":\"Our team had aimed to develop a model to supply solar energy to cities in Abu Dhabi, ensuring cost cutting and saving the environment. We added an extra factor by combining this model with a semi government bank that will help us fund the concept plus gain more business by increasing awareness for their approach. Being the leader of the group, I gained Leadership and Delegating skills which i cherish every time this project comes to mind!\"},{},{},{},{},{},{\"title\":\"Exchange Rate Fluctuations - International Bond and Currency Markets\",\"description\":\"The primary focus of this project was to explain the fluctuations in the exchange rate over a period providing analysis and justification.\"}]",
    "honors_and_awards": [
        {
            "title": "Winner of the Skyline University's New Idea Competition",
            "publication": "Skyline University",
            "date": "2016-03-01T00:00:00.000Z",
            "description": "The Competition was to identify a problem in UAE and solve it in a cost and efficient way. Our team had to compete with over 140 ideas all across GCC, and our team won the competition solving 4 problems in one idea with minimal investment and effective ROI. Full Article here - "
        },
        {
            "title": "2nd Runner Up - CIMA GLOBAL BUSINESS CHALLENGE",
            "publication": "CIMA",
            "date": "2015-06-01T00:00:00.000Z",
            "description": "CIMA Global Business Challenge tested our ability to teamwork on a case study based on the demanding oil & gas industry facing financing and going concern issues. Our job as a team was to sort out the finances for the firm by analytically thinking about different funding options and making a fair judgement for the company. Apart from this, we had to go an extra mile by deciding a future path for the firm that tested our knowledge to think beyond possibility! Overall, it was a competition which… Show more"
        },
        {
            "title": "Winner of the Skyline Inter-University Business Plan Challenge",
            "publication": "Skyline University",
            "date": "2015-04-01T00:00:00.000Z",
            "description": "The challenge was to develop an unique viable business idea and our team stood first battling across 180 teams across UAE and Oman."
        },
        {
            "title": "Global Management Challenge",
            "publication": "GMC",
            "date": "2015-01-01T00:00:00.000Z",
            "description": "GMC is a strategic management challenge based on a case study. With effective group members, the challenge was fun and exciting not forgetting the thrill of new challenges in regular intervals."
        },
        {
            "title": "Top Performance Award - 1st Postion",
            "publication": "First Gulf Bank",
            "date": "2014-06-01T00:00:00.000Z",
            "description": "Achieved the Top performers award for the highest cross-sell of Harres Insurance in June 2014"
        }
    ]
}