{
    "city": "Gurugram, Haryana, India",
    "position": null,
    "experience": null,
    "education": [
        {
            "title": "Sumermal Jain Public School",
            "start_year": "1994",
            "end_year": "2009",
            "description": null,
            "description_html": null,
            "institute_logo_url": null
        }
    ],
    "courses": null,
    "certifications": null,
    "current_company_name": "Tykhe Block Ventures",
    "publications": null,
    "patents": null,
    "projects": "[{\"title\":\"Mercer Enterprise Tech Platform - Global Account Management Team [Fortune 500]\",\"start_date\":\"Jul 2017\",\"end_date\":\"Dec 2023\",\"description\":\"Mercer is a business of Marsh & McLennan (NYSE: MMC), the world’s leading professional services firm in the areas of risk, strategy and people, and annual revenue of $17 billion. Through its market-leading businesses including Marsh, Guy Carpenter and Oliver Wyman, Marsh & McLennan it helps clients navigate an increasingly dynamic and complex environment.\"},{},{},{},{},{\"title\":\"A’ALDA Group Healthcare Technology Platforms\",\"start_date\":\"Mar 2020\",\"end_date\":\"Sep 2023\",\"description\":\"Helping A'alda expand its healthcare businesses in Asian countries, especially India. Helped them design & develop a futurist healthcare technology platform combining electronic medical records and management systems with AI technology. Aiding in attaining their long term goal of - creating an environment where “veterinarians can focus on treatment.\"},{},{},{},{\"title\":\"HULA Global ERP System Design & Development\",\"start_date\":\"Oct 2014\",\"end_date\":\"Sep 2015\",\"description\":\"Hula Global is an apparel supply chain company that owns and operates apparel manufacturing factories in India with an output capacity of 10,000 pieces per day. I successfully led the design & implementation of an ERP system to bring efficiency to their end to end large scale factory operations. I also led the e-commerce and fulfilment operations.\"},{}]",
    "honors_and_awards": null
}