{
    "city": "Kota, Rajasthan, India",
    "position": "Student at Sardar Vallabhbhai National Institute of Technology, Surat",
    "experience": [
        {
            "title": "Team Member",
            "location": "Surat, Gujarat, India",
            "description": "Chintan Pratishthan is a student chapter of National Institute of technology (NIT), Surat.We work for over all development of student by various activities like talk by eminent speakers, Training Camps, Group Discussions, Industrial Trips etc.",
            "description_html": "Chintan Pratishthan is a student chapter of National Institute of technology (NIT), Surat.We work for over all development of student by various activities like talk by eminent speakers, Training Camps, Group Discussions, Industrial Trips etc. <!---->",
            "duration": "Aug 2016 Jan 2020 3 years 6 months",
            "start_date": "Aug 2016",
            "end_date": "Jan 2020",
            "duration_short": "3 years 6 months",
            "company": "Sardar Vallabhbhai National Institute of Technology, Surat",
            "url": "",
            "company_logo_url": ""
        },
        {
            "title": "Summer Internship",
            "location": "Hazira, Gujarat, India",
            "description": "In this internship I have learnt the working mechanical machines, maintenance of machine. I have also learnt production processes from shore gas into  LPG, LNG and NAPHTHA etc.",
            "description_html": "In this internship I have learnt the working mechanical machines, maintenance of machine. I have also learnt production processes from shore gas into LPG, LNG and NAPHTHA etc. <!---->",
            "duration": "Jun 2019 Jul 2019 2 months",
            "start_date": "Jun 2019",
            "end_date": "Jul 2019",
            "duration_short": "2 months",
            "company": "Oil and Natural Gas Corporation Ltd(ONGC)",
            "company_id": "oilandnaturalgascorporation",
            "url": "",
            "company_logo_url": ""
        },
        {
            "title": "Summer Internship",
            "location": "Jaipur, Rajasthan, India",
            "description": "In this internship I have learnt the working,  maintenance  of centrifugal pump.I have also learnt about maintenance about the pipeline, mechanical devices which are usedin plants.I have done this internship in SUMMER-2018.",
            "description_html": "In this internship I have learnt the working, maintenance of centrifugal pump.I have also learnt about maintenance about the pipeline, mechanical devices which are usedin plants.I have done this internship in SUMMER-2018. <!---->",
            "duration": "May 2018 Jul 2018 3 months",
            "start_date": "May 2018",
            "end_date": "Jul 2018",
            "duration_short": "3 months",
            "company": "GAIL (India) Limited",
            "company_id": "gail-india-limited",
            "url": "",
            "company_logo_url": ""
        },
        {
            "title": "Team Member",
            "location": "Surat, Gujarat, India",
            "description": "This is a technical hobby club of NIT Surat. It has been the driving force in igniting the young minds of the national institute in taking up various technical projects. It boasts of providing a platform to the students where they can collaborate, carry out technical projects and can see their most creative and innovative ideas, and thus their dreams materialize. It participates in various Robotics Competitions like ABU Robocon(Asian Oceanian College robot competition), IRC(Indian Rover Challenge), other competitions like CANSAT and TechFests of various institutes all over India. some patent project like LAKE CLEANER BOT.Besides projects of social importance are also taken up.",
            "description_html": "This is a technical hobby club of NIT Surat. It has been the driving force in igniting the young minds of the national institute in taking up various technical projects. It boasts of providing a platform to the students where they can collaborate, carry out technical projects and can see their most creative and innovative ideas, and thus their dreams materialize. It participates in various Robotics Competitions like ABU Robocon(Asian Oceanian College robot competition), IRC(Indian Rover Challenge), other competitions like CANSAT and TechFests of various institutes all over India. some patent project like LAKE CLEANER BOT.Besides projects of social importance are also taken up.",
            "duration": "Jan 2017 Jul 2018 1 year 7 months",
            "start_date": "Jan 2017",
            "end_date": "Jul 2018",
            "duration_short": "1 year 7 months",
            "company": "DRISHTI-A Revolutionary Concept",
            "company_id": "drishti-nitsurat",
            "url": "",
            "company_logo_url": ""
        }
    ],
    "education": [
        {
            "title": "Indian Institute of Technology, Kharagpur",
            "degree": "Master of Technology - M.Tech",
            "field": "Cryogenic Engineering",
            "url": "",
            "start_year": "2020",
            "end_year": "2022",
            "description": null,
            "description_html": null,
            "institute_logo_url": ""
        },
        {
            "title": "Sardar Vallabhbhai National Institute of Technology, Surat",
            "degree": "B.Tech",
            "field": "Mechanical Engineering",
            "url": "",
            "start_year": "2016",
            "end_year": "2020",
            "description": null,
            "description_html": null,
            "institute_logo_url": ""
        },
        {
            "title": "CSRL Super 30",
            "degree": "IIT JEE",
            "field": "Preparation",
            "url": "",
            "start_year": "2015",
            "end_year": "2016",
            "description": null,
            "description_html": null,
            "institute_logo_url": ""
        },
        {
            "title": "Narsingh senior secondary School Itawa(325004)",
            "degree": "Senior Secondary",
            "field": "Science",
            "start_year": "2014",
            "end_year": "2015",
            "description": null,
            "description_html": null,
            "institute_logo_url": ""
        }
    ],
    "courses": null,
    "certifications": null,
    "current_company_name": "Sardar Vallabhbhai National Institute of Technology, Surat",
    "publications": null,
    "patents": null,
    "projects": "[{\"title\":\"Cool down characteristics of Superconducting magnetic energy storage\",\"start_date\":\"Jan 2021\",\"end_date\":\"May 2021\",\"description\":\"In this project, the SMES magnet is designed and calculated the cooldown characteristic of SMES at below 77 K temperature and Simulated the current lead, and optimize the dimension of the current lead.\"},{\"title\":\"Quench Simulation of HTS tape\",\"start_date\":\"Aug 2020\",\"end_date\":\"Dec 2020\",\"description\":\"The simulation of quenches in superconducting magnets is a multiphysics problem of the highest complexity. Operated at 1.9 K above absolute zero, the material properties of superconductors and superfluid nitrogen vary by several orders of magnitude over a range of only 77 K. The heat transfer from metal to nitrogen goes through different transfer and boiling regimes as a function of temperature, heat flux, and transferred energy. Electrical, magnetic, thermal, and fluid dynamic effects are intimately coupled, yet live on vastly different time and spatial scales.The results obtained from comparisons show that the adiabatic models were able to simulate quenches with the desired accuracy. The adiabatic analysis in the commercial simulation tools is more efficient and stable for various scales of spatial discretization. Similarly, the helium-cooled models can simulate quenches with satisfactory accuracy. Nevertheless, the models are not compatible with the automatic time-stepping method of the simulation environment. The use of the fixed time-stepping method in the models resulted from the coupled analysis in COMSOL being far more time-consuming than in QP3.\"},{\"title\":\"MECHANICAL SEAL\",\"start_date\":\"May 2019\",\"end_date\":\"Jul 2019\",\"description\":\"Mechanical seal is a device that prevents / restricts undesirable flow of fluid in rotatingequipment from the high chamber pressure to the atmosphere.\"},{\"title\":\"LAKE CLEANER BOT \",\"start_date\":\"Aug 2017\",\"end_date\":\"Jul 2018\",\"description\":\"Nowadays, a lot of manual labor is being employed in the cleaning of the rivers, lake and other local water bodies. A large amount of time and money is wasted by the government in this task to reduce the river contamination. Hence to provide a Technical Solution for a Time and Cost Effective method to reduce the manual labor, we thought of making an automatic bot which can efficiently do all the chores in less time. This is the basic motive behind our “Lake Cleaning Bot” The main aim of the project is to clean the polluting water bodies with the help of a cleaning bot which is controlled wirelessly and further can be made autonomous. The bot has to perform the functions of collecting the solid trash present in the water bodies like plastic bags, plastic bottles, small objects, etc. Further it should also be able to cut the small plants and weeds growing on the water surface and also collect them in the trash pit. After this process, it should empty this trash into a disposable pit.\"},{},{},{\"title\":\"Mechaical Obstacle Mechanism\",\"start_date\":\"May 2017\",\"end_date\":\"Aug 2017\",\"description\":\"The main moto of the project is to make a hammer like mechanism for GRP using the normal instruments at the same time to learn the basic manufacturing techniques. Here Procedure and different problems overcame during manufacturing are explained.\"},{},{}]",
    "honors_and_awards": null
}