{
    "city": "United Kingdom",
    "position": null,
    "experience": null,
    "education": null,
    "courses": null,
    "certifications": [
        {
            "meta": "Issued May 2020Credential ID YUEPRYV3PY59See credential",
            "subtitle": "Università Bocconi",
            "title": "Private Equity and Venture Capital"
        },
        {
            "meta": "Issued May 2020Credential ID UC-c2d578d4-98cb-4f70-9e72-a4e4b746465aSee credential",
            "subtitle": "edX",
            "title": "Ultimate Venture Capital: How to model investment rounds | Cap Table, Waterfall & Anti-Dilution Provisions"
        },
        {
            "meta": "Issued Jul 2019Credential ID YSS4Z677UC43See credential",
            "subtitle": "Coursera Course Certificates",
            "title": "Financial Markets (with Honors) - 99.4%"
        },
        {
            "meta": "Issued Jul 2019See credential",
            "subtitle": "The Institute of Direct and Digital Marketing (IDM)",
            "title": "IDM Award in Data and Analysis"
        },
        {
            "meta": "Issued Jul 2019See credential",
            "subtitle": "The Institute of Direct and Digital Marketing (IDM)",
            "title": "IDM Award in General Data Protection Regulation"
        },
        {
            "meta": "Issued Sep 2017Credential ID ba9670bd6fda4bcb8496f2c8f345ef9dSee credential",
            "subtitle": "Stanford University",
            "title": "CS101 - Introduction to Computing Principles - 97%"
        }
    ],
    "current_company_name": "Dream VC",
    "publications": null,
    "patents": null,
    "projects": null,
    "honors_and_awards": [
        {
            "title": "Global Startup Mentor Award Winner: Most Dedicated, Western Europe",
            "publication": "Founder Institute",
            "date": "2022-08-01T00:00:00.000Z",
            "description": "Issued award as a top 4 mentor for Founder Institute in Western Europe and among 36 mentors awarded globally for 2022."
        },
        {
            "title": "DataFest @ EDI 2020: WINNING TEAM, Best insight",
            "publication": "DataFest @ EDI 2020",
            "date": "2020-06-01T00:00:00.000Z",
            "description": "Team Phoenix was tasked with exploring the societal impacts of COVID-19 beyond health outcomes. They decided to investigate whether there were surges in certain searches during the UK lockdown. While UK lockdowns began on March 23rd, they chose to study the March 1st - May 25th period, hypothesising that many people would have begun to change their search preferences 2-3 weeks before in anticipation. They limited the search period to May 25th, the day George Floyd died, so that… Show more"
        },
        {
            "title": "Consulting Summit 2020 Top 3 Team",
            "publication": "Consulting Summit 2020",
            "date": "2020-01-01T00:00:00.000Z",
            "description": "Participated in a challenging London-Based Consulting Case Competition bringing together the leading student consultancies from North-Western Europe. Our team came 3rd out of 32 participating teams."
        },
        {
            "title": "Edinburgh Awards (Multiple)",
            "publication": "Edinburgh University Students Association",
            "date": "2019-04-01T00:00:00.000Z",
            "description": "Awards for contribution to student representation and assistance with university strategy with >126h of volunteers logged"
        },
        {
            "title": "Annual Edinburgh University Investment Banking Case Competition",
            "publication": "IBC",
            "date": "2019-03-01T00:00:00.000Z",
            "description": "Won the annual investment banking case competition where I was conducting M&A analysis and then pitching biopharmaceutical acquisition prospects. I was particularly commended for my extensive and thorough research, well formulated pitchbook and presentation skills."
        },
        {
            "title": "Geopolitics and International Relations Prize",
            "publication": "University College School",
            "date": "2018-06-01T00:00:00.000Z",
            "description": "Awarded the Geopolitics and International Relations Prize for my continued research into global political changes, soft power influences and conflict resolutions. Particularly commended for my reports on post-colonial imperial influences, international decision making, nation states, superpowers and contesting spaces, all of which received 100% based off the supplementary research into underlying synergies in Human Geography."
        },
        {
            "title": "UK Bebras Computational Thinking Challenge",
            "publication": "University of Oxford",
            "date": "2018-01-01T00:00:00.000Z",
            "description": "Bebras is an international informatics and computational thinking competition. This competition made me think about the most efficient solutions to a combination of mathematical and computing problems. I took part in the competition two years in a row, both times earning certificates of distinction."
        },
        {
            "title": "Computer Science Prize",
            "publication": "University College School London",
            "date": "2016-06-01T00:00:00.000Z",
            "description": "I was awarded the Computer Science Prize for my continuous high performances in class and extra-curricular computer science activities. I was particularly commended for my Computing Project where I earned 100% for a business plan-proposal of an exotic animal shelter to be built in the UK and the corresponding database I created for it."
        },
        {
            "title": "FMSP Maths Feast Competition",
            "publication": "MEI Further Maths Support Programme",
            "date": "2014-04-01T00:00:00.000Z",
            "description": "This was a challenging team competition oriented around mathematical, team-working and communication skills. My team performed well, coming 3rd from over 30 teams present in our regional group and we were presented with certificates commending our performance."
        }
    ]
}