{
    "city": "Seoul, South Korea",
    "position": null,
    "experience": null,
    "education": null,
    "courses": null,
    "certifications": null,
    "current_company_name": "Mercuryo",
    "publications": "[{\"title\":\"Blockchains and the Token Economy\",\"subtitle\":\"Palgrave Macmillan Cham\",\"date\":\"August 12, 2022\",\"description\":\"In this book, leading practitioners and academics provide comprehensive coverage and novel insights into blockchains and the token economy. Real world case studies from a wide range of industries provide practical examples of blockchain-based tokens for real estate, logistics, insurance, recruitment, collectibles, reservations, metaverses, and more. The cases show how tokens provide an innovative way to create and transfer value without relying on traditional intermediaries. Readers will better understand the business and social benefits of tokenization, but also its challenges.Chapter: Asset Tokenization of Real Estate in EuropeAuthors: Max Zheng, Philipp SandnerPages: 179-211\"}]",
    "patents": null,
    "projects": null,
    "honors_and_awards": [
        {
            "title": "Geh' Deinen Weg Scholarship",
            "publication": "Deutschlandstiftung Integration",
            "date": "2018-01-01T00:00:00.000Z",
            "description": "Every year the programme accepts 100 talented young people with a migrant background. The foundation is under the patronage of German Chancellor Dr. Angela Merkel."
        },
        {
            "title": "KPMG International Case Competition 2018",
            "publication": "KPMG Frankfurt",
            "date": "2017-12-01T00:00:00.000Z",
            "description": "Competed in the KPMG International Case Competition 2018"
        },
        {
            "title": "Foundation of German Business Scholarship - \"Compass of Studies\"",
            "publication": "Stiftung der Deutschen Wirtschaft",
            "date": "2015-01-01T00:00:00.000Z",
            "description": "Scholar at Compass of Studies, an initiative of the Foundation of German Business, Accenture and Deutsche Bank. The program makes young people from non-academic backgrounds aware of the educational opportunities and helps them to plan their future careers. The programme’s success rate is high: 95 percent of participants begin a degree course."
        }
    ]
}