{
    "city": "Jakarta Metropolitan Area",
    "position": null,
    "experience": null,
    "education": [
        {
            "title": "Sanata Dharma University",
            "url": "",
            "start_year": "2003",
            "end_year": "2009",
            "description": null,
            "description_html": null,
            "institute_logo_url": null
        }
    ],
    "courses": null,
    "certifications": [
        {
            "subtitle": "Khastalia | enlightened leadership",
            "title": "Coaching Skill for Manager"
        },
        {
            "subtitle": "Khastalia | enlightened leadership",
            "title": "Communication Model with any personalities by Nasa and White House"
        },
        {
            "subtitle": "Khastalia | enlightened leadership",
            "title": "Effective Negotiation"
        },
        {
            "subtitle": "Peopleshift",
            "title": "Leadership Program"
        },
        {
            "subtitle": "Khastalia | enlightened leadership",
            "title": "Managing People"
        },
        {
            "subtitle": "Khastalia | enlightened leadership",
            "title": "You as a Leader"
        }
    ],
    "current_company_name": "GoPay Indonesia",
    "publications": null,
    "patents": null,
    "projects": "[{\"title\":\"Dragon Mania\",\"start_date\":\"May 2013\",\"end_date\":\"Dec 2013\",\"description\":\"Meet the fiercest and friendliest dragons ever. Raise and breed them to create fantastic dragons and complete your collection. Train them to battle against your friends or team up with them to defeat hordes of enemies and become the ultimate Dragon Breeder!• Original dragons with unique abilities and 11 different elemental attributes.• Combine dragons to create new breeds! 50 dragons to collect and nurture!• Improve their habitats, feed them, boost their level, and attract visitors to your island.• Train your dragons for battle in an epic arena mini-game!• Raid evil Vikings and win big rewards!• Fight against your friends or join forces to defeat foes.\"},{\"title\":\"Gangstar City\",\"start_date\":\"Dec 2012\",\"end_date\":\"May 2013\",\"description\":\"Your brother has been kidnapped and now you have to take out every thug that stands between you and him. Run your own district: Collect money from shops, throw giant house parties, attract gangsters, and guard your crib. Whip out every dirty trick and deadly weapon in your arsenal to take on tons of jobs and make a name for yourself in the L.A. underground. Rob banks, fight police, kidnap enemies and more. Expand your domination over 4 different districts, from sunny Santa Monica to the famous streets of Hollywood. In Gangstar City, you'll become the king of L.A. or die trying!\"},{},{\"title\":\"Assassins Creed III Java Mobile\",\"start_date\":\"Aug 2012\",\"end_date\":\"Nov 2012\"},{},{},{},{},{},{},{},{},{\"title\":\"Asphalt 6 Adrenaline Mobile\",\"start_date\":\"Apr 2012\",\"end_date\":\"Jul 2012\"},{},{},{},{},{},{},{},{},{},{\"title\":\"Batman The Dark Knight Rises\",\"start_date\":\"Apr 2012\",\"end_date\":\"Jul 2012\",\"description\":\"Mainkan game ponsel resmi The Dark Knight Rises dan nikmati game laga luar biasa yang terinspirasi dari seri terakhir trilogi film ini. Bermainlah sebagai Batman atau Catwoman melalui 8 level menegangkan, dari Gotham Street hingga City Hall dan Stock Exchange. Dapatkan gadget Batman dan kendaraan seperti Batarang dan Bat-Pod untuk melawan Bane dan pasukannya. Selami dunia Batman yang luar biasa berkat gameplay kaya yang memungkinkan Anda mengeksplorasi, bertarung, dan memenangkan game.\"},{},{},{},{},{},{},{},{\"title\":\"Wonder Zoo\",\"start_date\":\"Nov 2011\",\"end_date\":\"Jun 2012\",\"description\":\"Make the most entertaining and attractive zoo to increase its reputation. Adopt new animals. Breed species that will inherit traits from their parents. Decorate and customize your zoo with various environments and buildings.Take care of your animals in three mini-games: Animal Dishes, Two by Two and The Parent Tap.Complete quests and level up to keep improving your zoo!\"},{},{},{},{},{},{\"title\":\"Where's Waldo Now?\",\"start_date\":\"Jul 2011\",\"end_date\":\"Oct 2011\",\"description\":\"Follow and find Waldo across time and space!In Where’s Waldo Now?™, join the world’s most famous striped traveler as he journeys across time and space. Test your observational skills in a series of classic search-and-find levels that explore the Pyramids up to the Future in a game perfectly adapted to short gaming sessions. In each level, play mini-games with Waldo’s friends and foes including Woof and Odlaw, and progress through the game to unlock bonus content and earn achievements. Stripe seekers, now is your chance, travel in time and find Waldo!\"},{},{},{},{},{\"title\":\"WordCrafter\",\"start_date\":\"Mar 2011\",\"end_date\":\"Jul 2011\",\"description\":\"A fun adventure where words are your key to new worlds. Place letters to build words upon words and form a path from your starting point to the goal.5 unique worlds - Spring, Fall, Summer, Winter and Greece. Put your skills to the test and take on special challenges like only making words that start with the same letter. Grab power-ups & hints to help you along the way.\"},{},{\"title\":\"DIamond Twister 2\",\"start_date\":\"Jan 2011\",\"end_date\":\"Apr 2011\",\"description\":\"http://www.gameloft.com/mobile-games/diamond-twister-2/\"},{}]",
    "honors_and_awards": null
}