{
    "city": "Midnapore Sadar, India",
    "position": ".",
    "experience": null,
    "education": [
        {
            "title": "Indian Institute of Technology, Kharagpur",
            "degree": "Master's degree",
            "field": "Chemistry",
            "url": "",
            "start_year": "2018",
            "end_year": "2023",
            "description": "I am an Integrated MSc Chemistry student at IIT Kharagpur, a premier technical institute in India. The rigorous curriculum and hands-on learning approach have provided me with opportunities to develop my skills, expand my knowledge, and pursue my passion for Chemistry through coursework, research projects, and initiatives. I am constantly striving for academic excellence and making a meaningful impact in the field.",
            "description_html": "I am an Integrated MSc Chemistry student at IIT Kharagpur, a premier technical institute in India. The rigorous curriculum and hands-on learning approach have provided me with opportunities to develop my skills, expand my knowledge, and pursue my passion for Chemistry through coursework, research projects, and initiatives. I am constantly striving for academic excellence and making a meaningful impact in the field. <!---->",
            "institute_logo_url": ""
        },
        {
            "title": "Jawahar Navodaya Vidyalaya (JNV)",
            "degree": "Intermediate",
            "url": "",
            "start_year": "2010",
            "end_year": "2017",
            "description": "Student at Jawahar Navodaya Vidyalaya Tonk from Classes 6 to 12. JNV Tonk provided a defining period of comprehensive education and opportunities to develop academics, leadership and extracurricular skills. Proud to have been part of the prestigious Navodaya Vidyalaya Scheme promoting quality education for rural talent and national integration. Scheme cultivates values, environmental awareness and physical education. Unique and invaluable educational experience, grateful for opportunities… Show more",
            "description_html": "Student at Jawahar Navodaya Vidyalaya Tonk from Classes 6 to 12. JNV Tonk provided a defining period of comprehensive education and opportunities to develop academics, leadership and extracurricular skills. Proud to have been part of the prestigious Navodaya Vidyalaya Scheme promoting quality education for rural talent and national integration. Scheme cultivates values, environmental awareness and physical education. Unique and invaluable educational experience, grateful for opportunities…",
            "institute_logo_url": ""
        }
    ],
    "courses": null,
    "certifications": null,
    "current_company_name": null,
    "publications": null,
    "patents": null,
    "projects": null,
    "honors_and_awards": null
}