{
    "city": "Bengaluru, Karnataka, India",
    "position": null,
    "experience": null,
    "education": [
        {
            "title": "Indian School of Business",
            "url": "",
            "start_year": "2018",
            "end_year": "2019",
            "description": null,
            "description_html": null,
            "institute_logo_url": null
        },
        {
            "start_year": "2019",
            "end_year": "2019",
            "description": null,
            "description_html": null,
            "institute_logo_url": null
        },
        {
            "title": ",",
            "start_year": "2011",
            "end_year": "2015",
            "description": null,
            "description_html": null,
            "institute_logo_url": null
        },
        {
            "title": "-",
            "start_year": "2009",
            "end_year": "2011",
            "description": null,
            "description_html": null,
            "institute_logo_url": null
        },
        {
            "start_year": "2001",
            "end_year": "2009",
            "description": null,
            "description_html": null,
            "institute_logo_url": null
        }
    ],
    "courses": null,
    "certifications": null,
    "current_company_name": "Revolut",
    "publications": "[{\"title\":\"Journal Photonic Sensor\",\"subtitle\":\"Springer\",\"date\":\"June 11, 2015\"}]",
    "patents": null,
    "projects": "[{\"title\":\"Project Cyrstal\",\"start_date\":\"Jun 2016\",\"description\":\"CRYSTAL is an incentive and compensation management system designed to calculate and automate payouts of both on-role and off-role employees of Vodafone India Limited. The application is based on TrueComp Variable Compensation Management Suite, a product of Callidus Software.1. Acted as the Project Manager for end-to-end planning, development, testing and roll-out of the system in 6 circles viz. Kerela, Andhra Pradesh, Chennai, Rest of Tamil Nadu, Delhi and Uttar Pradesh (West). 4 more circles viz. Mumbai, Karnataka, Punjab and Haryana currently in pipeline2. Worked as a SPOC from Vodafone IT for the project acting as a nexus between VIL business teams and other partners\"},{\"title\":\"Improvement of Touch-Point Net Promoter Score (NPS) for Vodafone Stores in Tamil Nadu\",\"start_date\":\"Jul 2015\",\"description\":\"1. Use of TNPS to understand the expectations and satisfaction level of Vodafone customers in Coimbatore (Chennai and Tamil Nadu Circle)2. Analysis of the results of survey campaigns at various locations (Vodafone Stores and Vodafone Mini Stores) to understand the pattern of TNPS numbers and point the weak links (ventures that generate less revenue and have a low level of customer satisfaction)3. Suggestion and implementation of ideas to boost up the promoters, reduce the number of detractors and improve the overall TNPS of Vodafone Coimbatore\"},{\"title\":\"Project Spike\",\"start_date\":\"Jun 2015\"},{\"title\":\"History Construction and Correction of MSCI Equity Base\",\"start_date\":\"Jan 2015\",\"end_date\":\"Aug 2015\",\"description\":\"1. Constructed a historical model that included the pricing details, volumes and identifier changes of all the assets of MSCI Equity Base. The historical data bank was used as a database for many financial models by MSCI.2. Helped in rectification of various data points and removal of redundant data in the historical data model\"}]",
    "honors_and_awards": null
}