{
    "city": "South Delhi, Delhi, India",
    "position": null,
    "experience": null,
    "education": [
        {
            "title": "Harvard Business School Executive Education",
            "url": "",
            "start_year": "2020",
            "end_year": "2021",
            "description": null,
            "description_html": null,
            "institute_logo_url": null
        },
        {
            "title": ",",
            "start_year": "2008",
            "end_year": "2012",
            "description": null,
            "description_html": null,
            "institute_logo_url": null
        },
        {
            "title": ",",
            "start_year": "2001",
            "end_year": "2008",
            "description": null,
            "description_html": null,
            "institute_logo_url": null
        }
    ],
    "courses": null,
    "certifications": [
        {
            "meta": "Issued Feb 2019",
            "subtitle": "Udemy",
            "title": "Product Management: Agile Fundamentals"
        },
        {
            "meta": "Issued Feb 2018",
            "subtitle": "Unacademy",
            "title": "Leadership Fundamentals"
        },
        {
            "meta": "Issued Oct 2016",
            "subtitle": "Google",
            "title": "Google Analytics"
        },
        {
            "meta": "Issued Jan 2016",
            "subtitle": "Delhi School of Internet Marketing",
            "title": "Digital Marketing Strategies"
        },
        {
            "meta": "Issued Dec 2015",
            "subtitle": "Dell SonicWALL",
            "title": "Dell SonicWALL Product Line"
        },
        {
            "meta": "Issued Nov 2015",
            "subtitle": "Dell",
            "title": "Dell IT Hardware - Entreprise Solutions"
        }
    ],
    "current_company_name": "Zipbolt Innovations",
    "publications": null,
    "patents": null,
    "projects": "[{\"title\":\"Piston replacement in a Mitsubishi Kobe Diesel Engine 8UEC600LSII\",\"start_date\":\"Jan 2013\",\"description\":\"As part of a team of 3 engineers and 2 trainee marine engineers, pulled out and replaced a damaged piston with a new piston in a engine with cylinder bore 900mm and stroke 2550mm. Carried out major repairs on the damaged piston including its piston rings and cooling system.\"},{\"title\":\"Overhauling and recalibration of Daihatsu 5DK-21 Marine diesel generator engine\",\"start_date\":\"Dec 2012\",\"description\":\"As a trainee marine engineer, worked in a team of five engineers to investigate the reasons behind recurrence of major water leakages in the cooling water jacket of one of the cylinder heads of a diesel generator. After finding the faults, made major repairs on the engine re-installed and re-calibrated the engine which resulted in increased operational efficiency and reduced downtime. Received appraisal for efficiency and perfection of the job.\"},{\"title\":\"Design and analysis of Reduction gear system for a Shipping Vessel\",\"start_date\":\"Feb 2012\",\"description\":\"Designed and simulated a reduction gearing system for a LNG Vessel with the help of standard design data and Pro Engineer 5.0 Software. After the completion of simulation, imported the design into ANSYS and analysed the design for structural integrity and with the results, optimized the design for efficient usage of materials and reduced costs. Additionally, covered the future scope of the project.\"},{\"title\":\"Technical report on Liquefied Natural Gas as a fuel for Marine Propulsion\",\"start_date\":\"Feb 2012\",\"description\":\"As member of a team of two, investigated the levels of development in LNG propelled ships by performing a case study on manufacturers of such ships. Briefly studied the method of extraction of LNG and its usage for marine propulsion. With the help of case studies, developed a detailed account of economic, safety and environmental impacts of the LNG propelled ships comparing it briefly with conventional methods of propulsion.\"},{\"title\":\"Detailed Analysis of Feed Water Heaters in External Combustion Engines\",\"start_date\":\"Feb 2011\",\"description\":\"Compared Open and Closed Feed Heaters on basis of functions and efficiency and performed case study on products of Tubular Exchangers Manufacturers Association\"}]",
    "honors_and_awards": null
}