{
    "city": "Riyadh, Saudi Arabia",
    "position": "Strategy & Performance Management | Planning, Translating, Reporting Business Strategies | Business Transformation | CSBP, CPA, XPP, PMP®, MBA-USA, KPIP®, PROSCI",
    "experience": [
        {
            "title": "Business Planning Manager (Strategy)",
            "location": "Riyadh, Saudi Arabia",
            "description": "An integral part of the core-team in Strategy & Transformation unit established to develop the company’s long-term vision, strategy, and business plans in alignment with the Vision 2030. • Spearheaded the development of Holding’s Business & Operating Model and Strategy, establishing Strategic Objectives and a KPI cascading system (3-Tier) that enhanced departmental and employee performance alignment, in collaboration with key Business Partners• Orchestrated the strategic planning for 9 Sectors and 14 Corporate functions, crafting Annual Business Plans that aligned with the company’s overarching strategy, focusing on Vision, Objectives, and KPI-driven Initiatives.• Actively supported the design and implementation of Corporate Governance Policies, enhancing organizational management through structured Committees and clear Authority Delegation. • Led the development and digitalization of a customized Enterprise Portfolio Management System, integrating functions across the organization, training teams, and facilitating knowledge transfer to boost operational efficiency.• Developed and implemented a comprehensive Performance Management System, defining data metrics to effectively track and report on the progress of strategic initiatives.• Directed a critical Business Transformation initiative by implementing an Investment Stage Gate System, which streamlined project approvals and accelerated decision-making. • Collaborated with the Corporate Finance team to revamp the Annual Budgeting Process, formulating robust budgets for 25 Business Units that aligned with strategic financial goals, reducing overall costs.• Developed and Published periodical Performance Dashboards to report on the progress of strategic initiatives and operations. • Played a key role in strategic initiatives including ERP selection and the establishment of Portfolio Companies Governance, driving the development of an Enterprise Risk Management System that mitigated risks.",
            "description_html": "An integral part of the core-team in Strategy &amp; Transformation unit established to develop the company’s long-term vision, strategy, and business plans in alignment with the Vision 2030. • Spearheaded the development of Holding’s Business &amp; Operating Model and Strategy, establishing Strategic Objectives and a KPI cascading system (3-Tier) that enhanced departmental and employee performance alignment, in collaboration with key Business Partners• Orchestrated the strategic planning for 9 Sectors and 14 Corporate functions, crafting Annual Business Plans that aligned with the company’s overarching strategy, focusing on Vision, Objectives, and KPI-driven Initiatives.• Actively supported the design and implementation of Corporate Governance Policies, enhancing organizational management through structured Committees and clear Authority Delegation. • Led the development and digitalization of a customized Enterprise Portfolio Management System, integrating functions across the organization, training teams, and facilitating knowledge transfer to boost operational efficiency.• Developed and implemented a comprehensive Performance Management System, defining data metrics to effectively track and report on the progress of strategic initiatives.• Directed a critical Business Transformation initiative by implementing an Investment Stage Gate System, which streamlined project approvals and accelerated decision-making. • Collaborated with the Corporate Finance team to revamp the Annual Budgeting Process, formulating robust budgets for 25 Business Units that aligned with strategic financial goals, reducing overall costs.• Developed and Published periodical Performance Dashboards to report on the progress of strategic initiatives and operations. • Played a key role in strategic initiatives including ERP selection and the establishment of Portfolio Companies Governance, driving the development of an Enterprise Risk Management System that mitigated risks.",
            "duration": "Nov 2022 - Present 2 years 2 months",
            "start_date": "Nov 2022",
            "end_date": "Present",
            "duration_short": "2 years 2 months",
            "company": "Ajlan & Bros Holding",
            "company_id": "ajlanbrosholding",
            "url": "",
            "company_logo_url": ""
        },
        {
            "title": "AlKifah Holding الكفاح القابضة",
            "location": "Eastern, Saudi Arabia",
            "description_html": null,
            "duration": "5 years 1 month",
            "positions": [
                {
                    "subtitle": "AlKifah Holding الكفاح القابضة",
                    "meta": "Aug 2020 - Nov 2022 2 years 4 months",
                    "description": "•Managed the Office of Strategy Management (OSM) in the Holding Company that built the capabilities of managing strategy in Business Units in alignment with the Vision of the group. •Conducted Portfolio Analysis of Investments and established 3 Strategic Transformation Initiatives in the SBUs and 7 Programs to build capabilities in the group.•Led the Formulation, Planning, and Reporting of Business Strategies for 20+ Business Units using various strategy tools like PESTLE, Industry and Competitors Analysis, SWOT Analysis, Competitor Analysis, Project Prioritization and Impact Analysis, and Balanced Scorecards.•Developed and implemented a Strategy Performance Management framework to link the Holding Company’s Strategic Objectives and initiatives with Departmental and Employee performance.•Assisted in the revision of the Company’s Corporate Governance Manual and guidelines to ensure alignment and sustainable approach with the company’s long-term vision in the changing business environment.•Led the Annual Business Planning and Budgeting Exercise in collaboration with Finance, Investments, Human Resources, and other corporate functions.•Prepared insightful periodical Board Reports in collaboration with other corporate functions efficiently to ensure timely decision-making.•Facilitated the establishment of an ESG (Environmental, Social, and Governance) Strategy for the group and core business units by engaging with international consultants in alignment with international benchmarks and the country’s Vision 2030 to incorporate ESG into the overall strategy of the company.•Worked on multiple successful engagements with Investment function, Business units, and external consultants for projects like Business Valuations, complex bid submissions, and International Partner collaborations.•Developed Market Intelligence report for the Top Management and Board analyzing global and regional industry trends and their potential impact on the group’s current investments.",
                    "duration": "Aug 2020 Nov 2022 2 years 4 months",
                    "start_date": "Aug 2020",
                    "end_date": "Nov 2022",
                    "duration_short": "2 years 4 months",
                    "title": "Strategy Planning Manager",
                    "description_html": "•Managed the Office of Strategy Management (OSM) in the Holding Company that built the capabilities of managing strategy in Business Units in alignment with the Vision of the group. <br>•Conducted Portfolio Analysis of Investments and established 3 Strategic Transformation Initiatives in the SBUs and 7 Programs to build capabilities in the group.<br>•Led the Formulation, Planning, and Reporting of Business Strategies for 20+ Business Units using various strategy tools like PESTLE, Industry and Competitors Analysis, SWOT Analysis, Competitor Analysis, Project Prioritization and Impact Analysis, and Balanced Scorecards.<br>•Developed and implemented a Strategy Performance Management framework to link the Holding Company’s Strategic Objectives and initiatives with Departmental and Employee performance.<br>•Assisted in the revision of the Company’s Corporate Governance Manual and guidelines to ensure alignment and sustainable approach with the company’s long-term vision in the changing business environment.<br>•Led the Annual Business Planning and Budgeting Exercise in collaboration with Finance, Investments, Human Resources, and other corporate functions.<br>•Prepared insightful periodical Board Reports in collaboration with other corporate functions efficiently to ensure timely decision-making.<br>•Facilitated the establishment of an ESG (Environmental, Social, and Governance) Strategy for the group and core business units by engaging with international consultants in alignment with international benchmarks and the country’s Vision 2030 to incorporate ESG into the overall strategy of the company.<br>•Worked on multiple successful engagements with Investment function, Business units, and external consultants for projects like Business Valuations, complex bid submissions, and International Partner collaborations.<br>•Developed Market Intelligence report for the Top Management and Board analyzing global and regional industry trends and their potential impact on the group’s current investments."
                },
                {
                    "subtitle": "AlKifah Holding الكفاح القابضة",
                    "meta": "Nov 2017 - Aug 2020 2 years 10 months",
                    "description": "- Responsible for development for Balanced  Scorecards for more than 12 SBU's in the group- Support the Division and SBU's in selecting the right objectives and KPI's for achieving their strategic plans. - Developing the OSM Department Structure and Process to improve functionality - Project Management Officer for the Office of Strategy Management managing project documentation, execution and reporting of projects progress.  - Supported EPMO in Initiatives Selections to ensure the alignment of Initiatives with the Strategic plans- Assisting the Corporate Strategy Manager in Development of Strategy for the Group and its Portfolio of SBU's- Working with Business Excellence team as a Performance Administrator in the implementation of SAP  Success Factors software implementation across the Corporate Office. - Developed a platform (Gsite- Google product) for the consolidation and integration of information different functions for reporting on the Strategy Execution. - Developed multiple tools and process for better Strategy Formulation and Planning.",
                    "duration": "Nov 2017 Aug 2020 2 years 10 months",
                    "start_date": "Nov 2017",
                    "end_date": "Aug 2020",
                    "duration_short": "2 years 10 months",
                    "title": "Senior Strategy Analyst",
                    "description_html": "- Responsible for development for Balanced Scorecards for more than 12 SBU's in the group<br>- Support the Division and SBU's in selecting the right objectives and KPI's for achieving their strategic plans. <br>- Developing the OSM Department Structure and Process to improve functionality <br>- Project Management Officer for the Office of Strategy Management managing project documentation, execution and reporting of projects progress. <br>- Supported EPMO in Initiatives Selections to ensure the alignment of Initiatives with the Strategic plans<br>- Assisting the Corporate Strategy Manager in Development of Strategy for the Group and its Portfolio of SBU's<br>- Working with Business Excellence team as a Performance Administrator in the implementation of SAP Success Factors software implementation across the Corporate Office. <br>- Developed a platform (Gsite- Google product) for the consolidation and integration of information different functions for reporting on the Strategy Execution. <br>- Developed multiple tools and process for better Strategy Formulation and Planning. <br>"
                }
            ],
            "company": "AlKifah Holding الكفاح القابضة",
            "company_id": "kifahholding",
            "url": "",
            "company_logo_url": null
        },
        {
            "title": "Head Of Strategic Planning",
            "location": "Al-hasa, Riyadh Region, Saudi Arabia",
            "description": "- Developed the detailed Strategic Plan with the Division team for the biggest company in the division ( KRB )    - External Analysis    - Internal Analysis    - Strategy Selection    - Strategic objectives and key Initiatives selection  - Responsible for Project Management Office in the division in coordination with the Holding's EPMO - Managed and published  the monthly and quarterly reports for the division - Worked with Division SBU's in development of Annual Business Plans - Reported directly to the Division's CEO- Responsible for the completion and consolidation of the reports and presentations for Management Committee- Business Process Leader for the SAP Implementation in KRB SBU",
            "description_html": "- Developed the detailed Strategic Plan with the Division team for the biggest company in the division ( KRB )  - External Analysis  - Internal Analysis  - Strategy Selection  - Strategic objectives and key Initiatives selection - Responsible for Project Management Office in the division in coordination with the Holding's EPMO - Managed and published the monthly and quarterly reports for the division - Worked with Division SBU's in development of Annual Business Plans - Reported directly to the Division's CEO- Responsible for the completion and consolidation of the reports and presentations for Management Committee- Business Process Leader for the SAP Implementation in KRB SBU",
            "duration": "Oct 2016 Nov 2017 1 year 2 months",
            "start_date": "Oct 2016",
            "end_date": "Nov 2017",
            "duration_short": "1 year 2 months",
            "company": "Al Kifah Construction Solutions Division",
            "company_logo_url": ""
        },
        {
            "title": "HR Training and Devlopment Head",
            "location": "Saudi Arabia",
            "description": "- Managed the HR Development section - Successful Transition of the HR system to  SAP HCM  - Developed HR Scorecard and Dashboards for the Top Management Reporting - Managed the HR Budget Plans for the company from Data collection, validation to reporting.- Worked extensively data cleansing of more than 1500 employees - Redesigned the Organization Structures and Job Descriptions for the company.- Worked as an active member of Job Description Review committee where the team analyzed over 800 Job Descriptions across the Al Kifah Group and provided ratings with feedback.",
            "description_html": "- Managed the HR Development section - Successful Transition of the HR system to SAP HCM - Developed HR Scorecard and Dashboards for the Top Management Reporting - Managed the HR Budget Plans for the company from Data collection, validation to reporting.- Worked extensively data cleansing of more than 1500 employees - Redesigned the Organization Structures and Job Descriptions for the company.- Worked as an active member of Job Description Review committee where the team analyzed over 800 Job Descriptions across the Al Kifah Group and provided ratings with feedback. ",
            "duration": "May 2015 Oct 2016 1 year 6 months",
            "start_date": "May 2015",
            "end_date": "Oct 2016",
            "duration_short": "1 year 6 months",
            "company": "Al Kifah Readymix & Blocks",
            "company_logo_url": ""
        },
        {
            "title": "Business Development Manager",
            "location": "Saudi Arabia",
            "description": "Business Development Manager in a Seafood Trading Company with a  multi million riyals turnover - Worked with the owner and managing director to formulate the Company’s Mission, Vision and Goals, company’s core values and core competencies that can be used to develop and expand the business in the future.- Designed and implemented a report to track daily sales and inventory across the branches on a daily basis and reporting to management.- Worked with all the departments and developed the business process maps, identified the non-value added work and proposed as well as implemented new process maps for better efficiency.- Analyzed the current sales department and remodeled a complete new department which included methods of Customer Credit Reviews, Sales forecasts, Sales Reporting structures, Commission and compensation plans, Customer Feedback, collection procedures, etc.- Responsible for evaluating the current Accounting system (Delta Business Solutions) and identifying the integrations issues and flaws in the data entry points for customers and inventory and disorganized reporting structure for the management.- Created an MS Access Database to keep a track on the company’s vehicles license and insurance expirations and renewals. -  worked  on marketing strategies and developing a website and improving brand image in the industry and social media to create business opportunities - Restructured the organizational and reporting structure to support and enhance the operations and meet the overall strategic plans of the company.",
            "description_html": "Business Development Manager in a Seafood Trading Company with a multi million riyals turnover - Worked with the owner and managing director to formulate the Company’s Mission, Vision and Goals, company’s core values and core competencies that can be used to develop and expand the business in the future.- Designed and implemented a report to track daily sales and inventory across the branches on a daily basis and reporting to management.- Worked with all the departments and developed the business process maps, identified the non-value added work and proposed as well as implemented new process maps for better efficiency.- Analyzed the current sales department and remodeled a complete new department which included methods of Customer Credit Reviews, Sales forecasts, Sales Reporting structures, Commission and compensation plans, Customer Feedback, collection procedures, etc.- Responsible for evaluating the current Accounting system (Delta Business Solutions) and identifying the integrations issues and flaws in the data entry points for customers and inventory and disorganized reporting structure for the management.- Created an MS Access Database to keep a track on the company’s vehicles license and insurance expirations and renewals. - worked on marketing strategies and developing a website and improving brand image in the industry and social media to create business opportunities - Restructured the organizational and reporting structure to support and enhance the operations and meet the overall strategic plans of the company.",
            "duration": "Mar 2014 Dec 2014 10 months",
            "start_date": "Mar 2014",
            "end_date": "Dec 2014",
            "duration_short": "10 months",
            "company": "Al Hoot Fisheries Co.",
            "company_logo_url": ""
        },
        {
            "title": "Assistant Manager",
            "location": "Hyderabad Area, India",
            "description": "Successfully transitioned the Record-to-Report Process from Canada for CHEP Inc. a subsidiary of Brambles Co. - Responsible for MIS Reporting like GL Accounting, Intercompany accounting with 100% accuracy.- Have built a great rapport and professional relation with the Customers both during OJT and Pilot.- Learned Critical and complex Processes like BRACS (Brambles Consolidation System), Intercompany NETTING & CLEARING during the On Job Training and performed the same immaculately- Documented all the activities learned during the transition by creating SOP’s, displaying good understanding of the process and complexities which was highly appreciated by both the senior management and the Customers.- Facilitated sessions on the Customer Business Processes, fundamentals of Accounting, Customer business models, SAP user interface, indigenous Applications of Genpact.- Responsible for handling the IT Applications for the team to ensure smooth integration of the new process with the applications in the TO-BE Process.- Organized and facilitated Daily and Monthly Customer Calls with the Team for monitoring the progress of process.Penske Truck Leasing (USA client), Financial Planning & Analysis team- Supported the American Client (Penske) by leading and managing an offshore team from India.- Produced and Published Critical Scorecards for huge customers like Merck, Whirlpool that helps their senior management to make decisions. - Created and analyzed various heads for the client such as Contract Maintenance, Commercial/Consumer Rentals, Accounts Receivables, Accounts Payables, and Revenue Analysis.- Built a Personnel Proficiency Index for the team, which measured and reflected each individual’s performance and proficiency in the process over a period of time.- Produced the Monthly Dashboard for the process, which reflected the Teams Performance and reported it to the Vice President and Project Owner of the Company.",
            "description_html": "Successfully transitioned the Record-to-Report Process from Canada for CHEP Inc. a subsidiary of Brambles Co. - Responsible for MIS Reporting like GL Accounting, Intercompany accounting with 100% accuracy.- Have built a great rapport and professional relation with the Customers both during OJT and Pilot.- Learned Critical and complex Processes like BRACS (Brambles Consolidation System), Intercompany NETTING &amp; CLEARING during the On Job Training and performed the same immaculately- Documented all the activities learned during the transition by creating SOP’s, displaying good understanding of the process and complexities which was highly appreciated by both the senior management and the Customers.- Facilitated sessions on the Customer Business Processes, fundamentals of Accounting, Customer business models, SAP user interface, indigenous Applications of Genpact.- Responsible for handling the IT Applications for the team to ensure smooth integration of the new process with the applications in the TO-BE Process.- Organized and facilitated Daily and Monthly Customer Calls with the Team for monitoring the progress of process.Penske Truck Leasing (USA client), Financial Planning &amp; Analysis team- Supported the American Client (Penske) by leading and managing an offshore team from India.- Produced and Published Critical Scorecards for huge customers like Merck, Whirlpool that helps their senior management to make decisions. - Created and analyzed various heads for the client such as Contract Maintenance, Commercial/Consumer Rentals, Accounts Receivables, Accounts Payables, and Revenue Analysis.- Built a Personnel Proficiency Index for the team, which measured and reflected each individual’s performance and proficiency in the process over a period of time.- Produced the Monthly Dashboard for the process, which reflected the Teams Performance and reported it to the Vice President and Project Owner of the Company.",
            "duration": "Dec 2010 Sep 2013 2 years 10 months",
            "start_date": "Dec 2010",
            "end_date": "Sep 2013",
            "duration_short": "2 years 10 months",
            "company": "Genpact",
            "company_id": "genpact",
            "url": "",
            "company_logo_url": ""
        },
        {
            "title": "Business Developer",
            "location": "Hyderabad Area, India",
            "description": "Business Developer and Project Coordinator in an exclusive Interior Design and Architectural firm.- Created Employee Evaluation Reports on a regular basis to give an insight of the issues and challenges in the company regarding the employees.- Headed the marketing and business development department. Explored new opportunities created business leads through various channels of marketing and advertising.- Responsible for the dealing and coordinating with the vendors from international companies relating to the construction.- Been an integral part of a multi-million project by coordinating effectively with the various construction departments. - Managed and administered job interviews and was responsible for selection of new employees for the company.- Closely coordinated consultants, architects, interior designers, contractor’s job schedules and needs with all departments to ensure smooth operation.- Established, monitored, and revised goals for the project team.",
            "description_html": "Business Developer and Project Coordinator in an exclusive Interior Design and Architectural firm.- Created Employee Evaluation Reports on a regular basis to give an insight of the issues and challenges in the company regarding the employees.- Headed the marketing and business development department. Explored new opportunities created business leads through various channels of marketing and advertising.- Responsible for the dealing and coordinating with the vendors from international companies relating to the construction.- Been an integral part of a multi-million project by coordinating effectively with the various construction departments. - Managed and administered job interviews and was responsible for selection of new employees for the company.- Closely coordinated consultants, architects, interior designers, contractor’s job schedules and needs with all departments to ensure smooth operation.- Established, monitored, and revised goals for the project team.",
            "duration": "Mar 2010 Nov 2010 9 months",
            "start_date": "Mar 2010",
            "end_date": "Nov 2010",
            "duration_short": "9 months",
            "company": "Sindhan Designs Pvt Ltd",
            "company_logo_url": ""
        },
        {
            "title": "Business Developer",
            "location": "Al Hasa, Saudi Arabia",
            "description": "Worked as a Business Developer in a leading construction company, AL-Kifah Building Materials Co. with nearly 5000 employees in Saudi Arabia. - Revised and developed company’s mission, vision, goals, core values, organizational structure and strategies for future development. - Created Team scorecards and initiated and organized weekly team meetings. Worked on a Balanced Scorecard implementation program including the Key Performance Indicators. - Initiated a successful Employee Recognition Program & Employee Motivation Program with the Human Resources department.- Created Standard Operating Procedures of an ERP system for all the users who didn’t have a standardized operating system. This improved user efficiency by 40%, saved time, reduced human errors, helped the new employees in training. - Made a detailed analysis for the calculation of Cost of turnover of employees for the company.",
            "description_html": "Worked as a Business Developer in a leading construction company, AL-Kifah Building Materials Co. with nearly 5000 employees in Saudi Arabia. - Revised and developed company’s mission, vision, goals, core values, organizational structure and strategies for future development. - Created Team scorecards and initiated and organized weekly team meetings. Worked on a Balanced Scorecard implementation program including the Key Performance Indicators. - Initiated a successful Employee Recognition Program &amp; Employee Motivation Program with the Human Resources department.- Created Standard Operating Procedures of an ERP system for all the users who didn’t have a standardized operating system. This improved user efficiency by 40%, saved time, reduced human errors, helped the new employees in training. - Made a detailed analysis for the calculation of Cost of turnover of employees for the company.",
            "duration": "May 2009 Oct 2009 6 months",
            "start_date": "May 2009",
            "end_date": "Oct 2009",
            "duration_short": "6 months",
            "company": "Al Kifah for building materials",
            "company_logo_url": ""
        }
    ],
    "education": [
        {
            "title": "Oklahoma City University",
            "degree": "Master of Business Administration (M.B.A.)",
            "field": "Information Technology",
            "url": "",
            "start_year": "2005",
            "end_year": "2008",
            "description": "Activities and Societies: Vice President, Indian student Association Member, Staff Writer, Multicultural Student Association Captain of the cricket team",
            "description_html": "Activities and Societies: Vice President, Indian student Association Member, Staff Writer, Multicultural Student Association Captain of the cricket team",
            "institute_logo_url": ""
        },
        {
            "title": "Badruka College Commerce Arts",
            "degree": "Bachelor's Degree",
            "field": "Corporate Accounting",
            "url": "",
            "start_year": "2002",
            "end_year": "2005",
            "description": "Activities and Societies: Table Tennis, Cricket, Cultural Activities, etc",
            "description_html": "Activities and Societies: Table Tennis, Cricket, Cultural Activities, etc",
            "institute_logo_url": ""
        }
    ],
    "courses": "[{\"subtitle\":\"-\",\"title\":\"ATD Train the Trainer program \"},{\"subtitle\":\"198400\",\"title\":\"Advanced Microsoft Excel 2013\"},{\"subtitle\":\"-\",\"title\":\"CAPM ( Certified Associate of Project Management)\"},{\"subtitle\":\"GQX13G4C\",\"title\":\"Explaining Strategy Course - Strategysys LLC\"},{\"subtitle\":\"-\",\"title\":\"Green Belt Trained & Tested ( Six Sigma)\"},{\"subtitle\":\"-\",\"title\":\"IMA Data Analytics & Visualization Fundamentals Certificate\"},{\"subtitle\":\"-\",\"title\":\"KPI master class \"},{\"subtitle\":\"-\",\"title\":\"Kaplan-Norton Balanced Scorecard Certification Boot Camp\"},{\"subtitle\":\"-\",\"title\":\"Lean Tools\"},{\"subtitle\":\"-\",\"title\":\"MS Project 2013\"},{\"subtitle\":\"-\",\"title\":\"PMP preperation course- 36 PDUs\"},{\"subtitle\":\"-\",\"title\":\"Success factor SAP- Performance administrator training \"}]",
    "certifications": [
        {
            "meta": "Issued Sep 2024Credential ID 1209240049-OCPA1",
            "subtitle": "The KPI Institute",
            "title": "Certified Performance Management Systems Audit Professional"
        },
        {
            "meta": "Issued May 2024",
            "subtitle": "KPI MEGA LIBRARY",
            "title": "Certified Performance Management Professional"
        },
        {
            "meta": "Issued Nov 2021Credential ID 05110882-2141-CSBP1",
            "subtitle": "The KPI Institute",
            "title": "Certified Strategy and Business Planning Professional"
        },
        {
            "meta": "Issued May 2021See credential",
            "subtitle": "Prosci",
            "title": "Prosci® Certified Change Practitioner - Delivered by MARG"
        },
        {
            "meta": "Issued Jan 2021See credential",
            "subtitle": "Intrafocus Limited",
            "title": "Strategy Planning Professional in Balanced Scorecard Methodology"
        },
        {
            "meta": "Issued Jan 2020Credential ID 20010005654See credential",
            "subtitle": "IQN",
            "title": "Certified Strategic Manager"
        },
        {
            "meta": "Issued May 2019",
            "subtitle": "Palladium: Make It Possible",
            "title": "Kaplan Norton Strategy Execution Certified Graduate"
        },
        {
            "meta": "Issued Apr 2019",
            "subtitle": "ATD Middle East",
            "title": "Train the Trainer"
        },
        {
            "meta": "Issued Mar 2018Credential ID 27022012-803-CKPI2",
            "subtitle": "The KPI Institute",
            "title": "Certified KPI Professional"
        },
        {
            "meta": "Issued Oct 2018Expires Oct 2021Credential ID 2245991",
            "subtitle": "Project Management Institute",
            "title": "PMP"
        }
    ],
    "current_company_name": "Ajlan & Bros Holding",
    "publications": null,
    "patents": null,
    "projects": "[{\"title\":\"Initiatives Selection project \",\"start_date\":\"Aug 2018\",\"end_date\":\"Present\"},{},{\"title\":\"Human Resources standardization \",\"start_date\":\"Dec 2015\"},{\"title\":\"Balanced Scorecard Development\",\"start_date\":\"Mar 2018\",\"end_date\":\"Dec 2018\",\"description\":\"Development of strategies and Balanced scorecards for Strategy business Units and corporate functions.\"},{\"title\":\"SAP HCM integration \",\"start_date\":\"May 2015\",\"end_date\":\"Dec 2016\"},{\"title\":\"Job descriptions Mercer\",\"start_date\":\"May 2016\",\"end_date\":\"Jul 2016\"},{},{\"title\":\"Personnel proficiency index\"}]",
    "honors_and_awards": [
        {
            "title": "Customer Satisfaction & Quality",
            "publication": "Brambles",
            "date": "2012-12-01T00:00:00.000Z",
            "description": null
        },
        {
            "title": "Star of the Month",
            "publication": "Management",
            "date": "2012-11-01T00:00:00.000Z",
            "description": null
        }
    ]
}