{
    "city": "Bengaluru, Karnataka, India",
    "position": null,
    "experience": null,
    "education": [
        {
            "title": "Harvard Business School",
            "url": "",
            "start_year": "2021",
            "end_year": "2023",
            "description": null,
            "description_html": null,
            "institute_logo_url": null
        },
        {
            "title": ",",
            "start_year": "2011",
            "end_year": "2016",
            "description": null,
            "description_html": null,
            "institute_logo_url": null
        },
        {
            "title": "-",
            "start_year": "2014",
            "end_year": "2014",
            "description": null,
            "description_html": null,
            "institute_logo_url": null
        },
        {
            "title": ",",
            "start_year": "2005",
            "end_year": "2009",
            "description": null,
            "description_html": null,
            "institute_logo_url": null
        }
    ],
    "courses": null,
    "certifications": null,
    "current_company_name": "Stealth Mode",
    "publications": null,
    "patents": null,
    "projects": "[{\"title\":\"Elite Eight in SPE PetroBowl Asia Pacific Contest, Kuala Lumpur, Malaysia\",\"start_date\":\"May 2015\",\"description\":\"Represented IIT Kharagpur in its first appearance at Asia Pacific PetroBowl Regional Qualifier 2015, Kuala Lumpur, Malaysia\"},{},{},{},{\"title\":\"MagicChalk\",\"start_date\":\"Sep 2014\",\"description\":\"• A social initiative taken by students of IIT Kharagpur dedicated to providing employment opportunity and education facility in urban slums• Selected among the Top 100 applicants to compete in Stanford University's BASES Challenge Startup Competition 2015 at Stanford, California• Finalist: Advaita'14, Annual B-School Competition organized by Indian School of Business, Mohali• Finalist: Hult Prize at Indian Institute of Technology Kharagpur• Semi-finalist: Empresario, Annual Business Model Competition of Indian Institute of Technology Kharagpur• Semi-finalist: Ideas'15-Techkriti, Annual Business Plan Competition of Indian Institute of Technology Kanpur\"},{},{},{\"title\":\"Gravity Study and Analysis of Earthquakes, Terrestrial Water Storage and Rainfall using Earth Observing Satellites (GOCE, GRACE, TRMM)\",\"start_date\":\"Jun 2013\",\"description\":\"1. Studied variation in the Earth's gravity and modeled the geoid with extremely high accuracy. Modeled the Gravity Anomaly and Geoid Height for the entire Earth.2. Studied the variations in Terrestrial Water for the Northern States of India. Studied in detail parameters like percolation, canopy water, soil moisture and ground water. Calculated loss of groundwater in the study area and predicted future losses (5-10 years).3. Analysed the deformation of crustal plates associated with recent earthquakes:Japan 2011Indonesia 2004analysed the pre-seismic, post-seismic and co-seismic variations in gravity anomaly\"},{\"title\":\"Implementation of UAV-based hyperspectral camera system for analyzing soil and its properties\",\"start_date\":\"May 2014\",\"end_date\":\"Jul 2014\"}]",
    "honors_and_awards": null
}