{
    "city": "Patna, Bihar, India",
    "position": null,
    "experience": null,
    "education": [
        {
            "title": "Indian Institute of Technology, Kanpur",
            "degree": "Bachelor of Technology",
            "field": "Civil Engineering",
            "url": "",
            "start_year": "2016",
            "end_year": "2020",
            "description": null,
            "description_html": null,
            "institute_logo_url": ""
        }
    ],
    "courses": null,
    "certifications": null,
    "current_company_name": null,
    "publications": "[{\"title\":\"Comprehensive Airborne Laser Scanning (ALS) Simulation\",\"subtitle\":\"Journal of the Indian Society of Remote Sensing\",\"date\":\"March 17, 2021\",\"description\":\"The 3D topographic data generated by airborne laser scanning (ALS) has numerous applications such as urban planning, transportation planning, flood modeling and mapping. Various types of LiDAR (light detection and ranging) datasets are needed for testing and development of algorithms for these applications. Such datasets are not readily available as the LiDAR data capturing process is complex, time-consuming and expensive. Simulated ALS data can be a low-cost alternative to the expensive LiDAR datasets. This paper presents the development of a simulator (called Limulator 4.0) for ALS data. Limulator includes four components, namely 3D model component, camera component, laser component and LiDAR data generation. The first component provides a user, the facility to input user-defined 3D models of various objects. The laser component mathematically models the scanner movement and flight trajectory to generate simulated ALS parameters. The camera component takes user-defined parameters to generate images captured by a virtual camera. The effects of external and internal forces on flight movement and various errors are also modeled mathematically. Software for this simulation is developed in C +  + , and its user-friendly GUI is developed using QT Creator 5.6. Limulator can serve as the ideal testbed for developing, testing and validation of various algorithms.\"}]",
    "patents": null,
    "projects": "[{\"title\":\"Development of Camera Simulator for Autonomous Vehicles \",\"start_date\":\"Dec 2018\",\"end_date\":\"Dec 2019\",\"description\":\"Developed the code to extract the texture features of the 3D models (OBJ file format) in the form of meshes.Developed simulation to capture images from a moving vehicle using the collinearity equation, including radial lensdistortions at user-defined FPS, camera orientation, and distortion parameters, along with the simulation of LiDAR data.\"},{\"title\":\"Development of Low Cost GPS\",\"start_date\":\"Dec 2018\",\"end_date\":\"Dec 2019\",\"description\":\"Developing low cost GPS using single frequency receivers.\"},{\"title\":\"Development of Airborne LiDAR Simulator - Limulator 4.0\",\"start_date\":\"Aug 2017\",\"end_date\":\"Jul 2018\",\"description\":\"Studied the basics of laser scanning and LiDAR data capturing process. Developed the code to extract coordinates of vertices and their orientation from .obj file format for Limulator 4.0 and further analysed the code for flight trajectory generation and method to calculate intersection points using octrees. Analysed the effect of changing parameters (i.e. Pulse Repetition Frequency, Scanning Frequency, Flying height, Field of view (both along and across), Flight Velocity, Scanner movement type, Overlapping between two consecutive flights) on LiDAR data. Studied about the errors (Systematic, Random, Range, Overall) associated with LiDAR data, developed code to induce them in ideal data and analysed about their effects on the data. Improved the GUI of Limulator 4.0 with hints and tips at every step in generating LiDAR data.\"},{\"title\":\"Ornithopter\",\"start_date\":\"May 2017\",\"end_date\":\"Jul 2017\",\"description\":\"Designed on Autodesk Fusion360 and crafted a flying, lightweight, remotely piloted Ornithopter, with flapping wing mechanism, containing motor, gears and servos in a project under Aeromodelling Club, IIT Kanpur.\"}]",
    "honors_and_awards": null
}