{
    "city": "Midnapore Sadar, India",
    "position": "Incoming @ JLR India | Mechanical Engineering (Applied Design), IIT Kharagpur '24 | Team Leader , TeamKART - FSAE",
    "experience": [
        {
            "title": "Team KART",
            "location": "Kharagpur, West Bengal, India",
            "description_html": null,
            "duration": "5 years",
            "positions": [
                {
                    "subtitle": "Team KART",
                    "meta": "Sep 2021 - Present 3 years 4 months",
                    "description": "• Team Leader of the Official Formula Student Team of IIT Kharagpur.• Responsible for leading a team toward all aspects of the research & development of a Formula Student   prototype vehicle, devised procurement strategies for efficient budget utilization & guided   sponsorship initiatives of the team.• Prepared the design & manufacturing timeline as well as the procurement plan for the fund allocation   to secure the required funding for the team and ensure an efficient workflow for project K6.",
                    "duration": "Sep 2021 - Present 3 years 4 months",
                    "start_date": "Sep 2021",
                    "end_date": "Present",
                    "duration_short": "3 years 4 months",
                    "title": "Team Leader",
                    "description_html": "• Team Leader of the Official Formula Student Team of IIT Kharagpur.<br>• Responsible for leading a team toward all aspects of the research &amp; development of a Formula Student <br> prototype vehicle, devised procurement strategies for efficient budget utilization &amp; guided <br> sponsorship initiatives of the team.<br>• Prepared the design &amp; manufacturing timeline as well as the procurement plan for the fund allocation <br> to secure the required funding for the team and ensure an efficient workflow for project K6."
                },
                {
                    "subtitle": "Team KART",
                    "meta": "Sep 2021 - Present 3 years 4 months",
                    "description": "Design• Designed & engineered an intake manifold for an FSAE car by performing simulations in ANSYS Fluent    which brought an 11% increase in performance• Performed model engine simulations in Ricardo WAVE for a combustion engine to measure the    performance & efficiency characteristics of the engine• Prototyped the design of a new reactive muffler which led to a weight reduction of 28% & verified the    design by performing simulations in COMSOL• Developed a program to perform vehicle simulations to estimate the performance of a vehicle, in    MATLAB and SimulinkManufacturing• Leading the manufacturing effort of the newly designed powertrain components for the current   Formula Student vehicle project, the K6• Responsible for ensuring coordination between the powertrain subsystem and the rest of the team to    ensure the smooth running of the manufacturing and procurement timelines.",
                    "duration": "Sep 2021 - Present 3 years 4 months",
                    "start_date": "Sep 2021",
                    "end_date": "Present",
                    "duration_short": "3 years 4 months",
                    "title": "Powertrain Subsystem Head",
                    "description_html": "Design<br>• Designed &amp; engineered an intake manifold for an FSAE car by performing simulations in ANSYS Fluent <br> which brought an 11% increase in performance<br>• Performed model engine simulations in Ricardo WAVE for a combustion engine to measure the <br> performance &amp; efficiency characteristics of the engine<br>• Prototyped the design of a new reactive muffler which led to a weight reduction of 28% &amp; verified the <br> design by performing simulations in COMSOL<br>• Developed a program to perform vehicle simulations to estimate the performance of a vehicle, in <br> MATLAB and Simulink<br><br>Manufacturing<br>• Leading the manufacturing effort of the newly designed powertrain components for the current <br> Formula Student vehicle project, the K6<br>• Responsible for ensuring coordination between the powertrain subsystem and the rest of the team to <br> ensure the smooth running of the manufacturing and procurement timelines."
                },
                {
                    "subtitle": "Team KART",
                    "meta": "Jan 2020 - Sep 2021 1 year 9 months",
                    "description": "1. Basic knowledge of the working of Internal Combustion engines pertaining to Formula student competitions :  a. Model engine simulations in Ricardo WAVE for a complete Internal combustion engine to obtain       valuable information       pertaining to the efficiency and working of an engine.  b. Static and Transient CFD analysis for an intake manifold based on specific boundary conditions       to  obtain pressure contours and verify the mass flow rate obtained from the Ricardo WAVE       simulations.  c. Turbocharger selection based on given engine criteria and engine data obtained from Ricardo       WAVE simulation for a specific horsepower target.  d. Performed lap time simulations on Optimum lap based on specific engine parameters to       determine the optimum Final Drive Ratio(FDR) for minimum lap times .2. Fundamental knowledge of the drivetrain of an FSAE engine for proper transfer of energy to the tires:  a.  Basic analysis of gears and the forces acting on them.  b.  Designed a sprocket for a chain-driven drivetrain solution and performed force and torque       calculations and simulations on ANSYS to determine the various loads on the sprocket and to       confirm it's feasibility.   c. Performed analysis and force calculations on various iterations of planetary gears to determine        the best solution for an optimized drivetrain setup for the Formula Student electric vehicle.",
                    "duration": "Jan 2020 Sep 2021 1 year 9 months",
                    "start_date": "Jan 2020",
                    "end_date": "Sep 2021",
                    "duration_short": "1 year 9 months",
                    "title": "Powertrain Member",
                    "description_html": "1. Basic knowledge of the working of Internal Combustion engines pertaining to Formula student competitions :<br> a. Model engine simulations in Ricardo WAVE for a complete Internal combustion engine to obtain <br> valuable information <br> pertaining to the efficiency and working of an engine.<br> b. Static and Transient CFD analysis for an intake manifold based on specific boundary conditions <br> to obtain pressure contours and verify the mass flow rate obtained from the Ricardo WAVE <br> simulations.<br> c. Turbocharger selection based on given engine criteria and engine data obtained from Ricardo <br> WAVE simulation for a specific horsepower target.<br> d. Performed lap time simulations on Optimum lap based on specific engine parameters to <br> determine the optimum Final Drive Ratio(FDR) for minimum lap times .<br><br>2. Fundamental knowledge of the drivetrain of an FSAE engine for proper transfer of energy to the tires:<br> a. Basic analysis of gears and the forces acting on them.<br> b. Designed a sprocket for a chain-driven drivetrain solution and performed force and torque <br> calculations and simulations on ANSYS to determine the various loads on the sprocket and to <br> confirm it's feasibility.<br> c. Performed analysis and force calculations on various iterations of planetary gears to determine <br> the best solution for an optimized drivetrain setup for the Formula Student electric vehicle."
                }
            ],
            "company": "Team KART",
            "company_id": "team-kart",
            "url": "",
            "company_logo_url": null
        },
        {
            "title": "Associate Manager",
            "location": "Kharagpur, West Bengal, India",
            "description": "• Responsible for securing sponsorship deals from companies such as LinkedIn Learning & Westbridge   Capital for the Global Entrepreneurship Summit 2021.• Formed close associations with venture capitalists, accelerators & incubators for the development of   entrepreneurial qualities at IIT Kharagpur.• Instrumental in conducting the Entrepreneurship Awareness Drive 2020 which saw the participation of   startups, venture capitalists & investors.",
            "description_html": "• Responsible for securing sponsorship deals from companies such as LinkedIn Learning &amp; Westbridge  Capital for the Global Entrepreneurship Summit 2021.• Formed close associations with venture capitalists, accelerators &amp; incubators for the development of  entrepreneurial qualities at IIT Kharagpur.• Instrumental in conducting the Entrepreneurship Awareness Drive 2020 which saw the participation of  startups, venture capitalists &amp; investors. <!---->",
            "duration": "Jul 2020 Jan 2021 7 months",
            "start_date": "Jul 2020",
            "end_date": "Jan 2021",
            "duration_short": "7 months",
            "company": "Entrepreneurship Cell, IIT Kharagpur",
            "company_id": "ecellkgp",
            "url": "",
            "company_logo_url": ""
        },
        {
            "title": "Associate Member",
            "location": "Kharagpur, West Bengal",
            "description_html": null,
            "duration": "Aug 2019 Jan 2020 6 months",
            "start_date": "Aug 2019",
            "end_date": "Jan 2020",
            "duration_short": "6 months",
            "company": "Spring Fest",
            "company_id": "spring-fest",
            "url": "",
            "company_logo_url": ""
        }
    ],
    "education": [
        {
            "title": "Indian Institute of Technology, Kharagpur",
            "degree": "Dual degree(B.tech+M.tech)",
            "field": "Mechanical Engineering",
            "url": "",
            "start_year": "2019",
            "end_year": "2024",
            "description": null,
            "description_html": null,
            "institute_logo_url": ""
        },
        {
            "title": "FIITJEE junior college",
            "degree": "Mathematics and science, 99.4%",
            "field": "99.4",
            "start_year": "2017",
            "end_year": "2019",
            "description": null,
            "description_html": null,
            "institute_logo_url": ""
        },
        {
            "title": "Navy Children School - India",
            "degree": "CBSE, 10 CGPA",
            "url": "",
            "start_year": "2005",
            "end_year": "2017",
            "description": "Activities and Societies: Debate team, Science club, Quiz club, Squash",
            "description_html": "Activities and Societies: Debate team, Science club, Quiz club, Squash",
            "institute_logo_url": ""
        }
    ],
    "courses": null,
    "certifications": [
        {
            "meta": "Issued Jul 2020Credential ID 4MBTCWHJU3KESee credential",
            "subtitle": "Coursera",
            "title": "Programming Fundamentals"
        }
    ],
    "current_company_name": "Team KART",
    "publications": null,
    "patents": null,
    "projects": null,
    "honors_and_awards": null
}