{
    "id": "abhijeetsoni30",
    "name": "Abhijeet Soni",
    "city": "Gurugram, Haryana, India",
    "country_code": "IN",
    "position": null,
    "about": "As a Senior Data Scientist at American Express, I specialize in leveraging machine…",
    "posts": null,
    "groups": null,
    "current_company": {
        "link": "",
        "name": "American Express",
        "company_id": "american-express"
    },
    "experience": null,
    "people_also_viewed": [
        {
            "profile_link": "",
            "name": "Harshit Kalra",
            "about": "Director - Enterprise Strategy at American Express | Strategy Consulting | Two-time OPJEMS Scholar",
            "location": "Gurgaon"
        },
        {
            "profile_link": "",
            "name": "Vivek Kumar Sinha",
            "about": "Director - Product Development, Credit & Fraud Risk, American Express",
            "location": "Gurgaon"
        },
        {
            "profile_link": "",
            "name": "Kaajal Negi",
            "about": "Account Management | Risk Management | Pizza Lover",
            "location": "India"
        },
        {
            "profile_link": "",
            "name": "Kaustav Tamuly",
            "about": null,
            "location": "Berlin"
        },
        {
            "profile_link": "",
            "name": "Kunal Verma",
            "about": null,
            "location": "Bengaluru"
        },
        {
            "profile_link": "",
            "name": "Sanjay Saroj",
            "about": "AmEx || IIM U || IIT GN",
            "location": "Mumbai"
        },
        {
            "profile_link": "",
            "name": "Smriti Mishra",
            "about": "American Express-Product & Analytics|| SAFe® POPM|| Lean and Six Sigma-Green Belt|| SRCC-GBO",
            "location": "Delhi, India"
        },
        {
            "profile_link": "",
            "name": "Raj Verma",
            "about": "EXL || Ex- SMFG, IIFL || IIT-B'19",
            "location": "Gurugram"
        },
        {
            "profile_link": "",
            "name": "Sneh Pratik",
            "about": null,
            "location": "Bengaluru"
        },
        {
            "profile_link": "",
            "name": "Manish Gupta, PhD",
            "about": null,
            "location": "Noida"
        },
        {
            "profile_link": "",
            "name": "Krishnaraj Palaniselvaraj",
            "about": null,
            "location": "Tamil Nadu, India"
        },
        {
            "profile_link": "",
            "name": "Ankita Sinha",
            "about": null,
            "location": "Aberdeen"
        },
        {
            "profile_link": "",
            "name": "Saketh Turlapati",
            "about": null,
            "location": "Mumbai Metropolitan Region"
        },
        {
            "profile_link": "",
            "name": "Ankur Gupta",
            "about": "Data Scientist Product @Google",
            "location": "Bengaluru"
        },
        {
            "profile_link": "",
            "name": "Yash Kumar",
            "about": null,
            "location": "Delhi, India"
        },
        {
            "profile_link": "",
            "name": "Palak Wadhwa",
            "about": null,
            "location": "Berlin"
        },
        {
            "profile_link": "",
            "name": "Piyush Raj",
            "about": "Founder @ CodeConvert.ai",
            "location": "Bengaluru"
        },
        {
            "profile_link": "",
            "name": "Madhukar Kumar",
            "about": "Founder & CEO || Angel Investor || Technopreneur || Gen AI Leader || Corporate Trainer || Motivational Speaker || Triathlete || Marathoner || Sky Diver || MLE℠",
            "location": "Gurgaon"
        },
        {
            "profile_link": "",
            "name": "Ratnakar Pandey",
            "about": null,
            "location": "Bengaluru"
        },
        {
            "profile_link": "",
            "name": "Aparna Deshmukh",
            "about": null,
            "location": "Gurgaon"
        }
    ],
    "educations_details": "Indian Institute of Technology, Kharagpur",
    "education": [
        {
            "title": "Indian Institute of Technology, Kharagpur",
            "url": "",
            "start_year": "2014",
            "end_year": "2019",
            "description": null,
            "description_html": null,
            "institute_logo_url": null
        },
        {
            "start_year": "2011",
            "end_year": "2013",
            "description": null,
            "description_html": null,
            "institute_logo_url": null
        },
        {
            "start_year": "2001",
            "end_year": "2011",
            "description": null,
            "description_html": null,
            "institute_logo_url": null
        }
    ],
    "recommendations_count": 11.0,
    "courses": null,
    "languages": [
        {
            "subtitle": " Full professional proficiency ",
            "title": " English "
        },
        {
            "subtitle": " Full professional proficiency ",
            "title": " Hindi "
        },
        {
            "subtitle": " Elementary proficiency ",
            "title": " Japanese "
        },
        {
            "subtitle": " Elementary proficiency ",
            "title": " Vietnamese "
        }
    ],
    "certifications": null,
    "recommendations": [
        "“Abhijeet's multitasking ability was unlike I’ve seen before and made an applause-worthy increase in our company’s growth level. He always kept the team morale up, and I believe he is the best manager I ever had as he is friendly. His ability to work through the crisis and develop new ways to achieve the targets were always inspiring. He handle any situation calmly and patiently.This natural skill of his has helped us grab many achievements throughout our journey.I am delighted to work and learn with such professionals. ” Show less"
    ],
    "volunteer_experience": [
        {
            "cause": "Environment",
            "duration": "Jul 2014 - Apr 2016 · 1 year 10 months",
            "duration_short": "1 year 10 months",
            "end_date": "Apr 2016",
            "info": "► Attended a Combined Annual Training Camps in December 2014, where I actively participated in various social activities such as blood donation camps, Swachh Bharat mission, and awareness rallies. These experiences reinforced my dedication to serving the community and promoting social causes.► Proudly participated in parades on significant national occasions like 15th August and 26th January. Taking part in these events was a matter of great honor and patriotism for me.►…\n            \n\n    \n    \n\n    \n        Show more\n\n          \n    \n  \n      \n\n        \n          ► Attended a Combined Annual Training Camps in December 2014, where I actively participated in various social activities such as blood donation camps, Swachh Bharat mission, and awareness rallies. These experiences reinforced my dedication to serving the community and promoting social causes.► Proudly participated in parades on significant national occasions like 15th August and 26th January. Taking part in these events was a matter of great honor and patriotism for me.► Collaborated with the Gopali Youth Welfare Society to provide free education to nearby rural localities. This initiative allowed me to contribute to education accessibility and upliftment in underprivileged areas, making a positive impact on young minds.Being a part of NCC shaped my character, instilling discipline, leadership, and a spirit of service. It strengthened my commitment to contributing meaningfully to society and the nation at large\n            \n\n    \n    \n\n    \n        Show less",
            "start_date": "Jul 2014",
            "subtitle": "National Cadet Core",
            "title": "Cadet"
        }
    ],
    "followers": 11807.0,
    "connections": 500.0,
    "current_company_company_id": "american-express",
    "current_company_name": "American Express",
    "publications": null,
    "patents": null,
    "projects": "[{\"title\":\"Geological Field Trip - Angul Region, Odisha, India\",\"start_date\":\"Dec 2017\",\"description\":\"During the academic session 2017-2018, I had the privilege of participating in the structural geology field trip organized by the Department of Geology and Geophysics, IIT Kharagpur, held in Angul, Orissa. This enlightening field trip spanned from 8th December 2017 to 20th December 2017.The main objective of the field trip was to conduct a comprehensive stress and strain analysis in the region and create a detailed regional geological map. To achieve this, we meticulously observed and plotted Foliations and Lineations on the stereo-net, enhancing our understanding of the geological structures in the area.These meticulously crafted maps served as invaluable tools in analyzing the possible tectonic and deformation history of the region. Throughout the field trip, we encountered a diverse array of major rock types, including Khondalite, Charnockite, Augen Gneiss, Quartzite, and Migmatites, each possessing distinct characteristic minerals and properties. The field trip provided a unique hands-on experience and a deeper insight into the complexities of structural geology.\"},{},{},{},{},{\"title\":\"Geological Mapping - Simultala Region Bihar, India\",\"start_date\":\"Dec 2016\",\"description\":\"The fieldwork was conducted as part of the third-year applied geology curriculum for the 2014-19 Undergraduate Batch of the Department of Geology and Geophysics, Indian Institute of Technology, Kharagpur.The primary objective of the project was to draw a comprehensive geological field map of the Shimultala region. The major aspects and objectives of the fieldwork encompassed:1. Imprints of three deformations were meticulously recorded in the area, and these are represented by three distinct phases of folding, as depicted on the geological map.2. The fieldwork involved thorough observation and investigation of bands of granite-gneiss, including a particularly coarse-grained granite, which were extensively documented in the geological report.Throughout the fieldwork, students gained hands-on experience in geological mapping techniques and deepened their understanding of the region's geological history. The project provided a valuable opportunity for practical learning and analysis of complex geological formations.\"},{},{},{},{},{\"title\":\"High Temperature Deformation of Polycrystalline MgO - Lower mantle rheology at University of Tokyo, Japan\",\"start_date\":\"Jul 2016\",\"description\":\"The primary objectives of the project were:Analyzing the high-temperature deformation behavior of polycrystalline MgO to gain insights into its mechanical properties and understand the fundamentals of lower mantle rheology.Conducting experimental assays to validate the Flow law of polycrystals at different temperatures, thereby contributing to a deeper understanding of the material's mechanical response under varying conditions.\"},{\"title\":\"Geology and Geophysics Field Work - Balasore & Chandipur Region, India\",\"start_date\":\"Dec 2015\",\"description\":\"The field trip was organized for the second-year students of the 2014-19 UG Batch from the Department of Geology and Geophysics, Indian Institute of Technology, Kharagpur, and took place from 7th December 2015 to 15th December 2015.The main objective of the project was to gain practical knowledge about the geological aspects of the region around Balasore, North Odisha. During the field trip, we focused on the following key areas:1. Observing and studying the different compositions of minerals in the Singhbum granite to understand the stratigraphy of the area.2. Examining and analyzing the various grades of weathering in the region.Additionally, we learned that the geological significance of this area lies in it being a part of the Singhbhum Craton, which is considered one of the oldest and earliest-formed landmasses on Earth.Furthermore, during our visit to Chandipur Beach, a sea resort in Balasore District, Odisha, India, our team had the opportunity to study sedimentary facies and sedimentary structures. We also gained insights into understanding the direction of currents and waves in this coastal environment.The field trip provided us with practical exposure to geological fieldwork and enhanced our understanding of the unique geological features of the region. It was a valuable learning experience that complemented our academic studies and allowed us to witness the diverse geological formations first-hand.\"},{},{},{},{\"title\":\"Master's Thesis Project\",\"start_date\":\"Aug 2018\",\"end_date\":\"Apr 2019\",\"description\":\"The primary objective of the project was two fold:1. To investigate and determine the solubility of gold (Au) in Sb2S3 melt, aiming to understand if Au can be dissolved in the Sb2S3 melt.2. To identify and ascertain the temperature and composition of the eutectic, if present, between the gold (Au) and Sb2S3. This aspect was crucial in exploring any potential alloy formations and their properties.The project involved experimental analysis and data collection to gain insights into the solubility of gold in the Sb2S3 melt and to determine any eutectic points that might exist between the two components. The findings were significant in advancing the understanding of materials science and potential applications of these alloys in various industries.\"}]",
    "organizations": null,
    "location": "Gurugram",
    "linkedin_id": "abhijeetsoni30",
    "activity": [
        {
            "interaction": "Liked by Abhijeet Soni",
            "link": "",
            "title": "If tomorrow I were hit by a bus, got a…",
            "img": "",
            "id": "7278258303724371969"
        },
        {
            "interaction": "Liked by Abhijeet Soni",
            "link": "",
            "title": "Roger Federer’s farewell note to Rafa…",
            "img": "",
            "id": "7264842461397622784"
        },
        {
            "interaction": "Liked by Abhijeet Soni",
            "link": "",
            "title": "Why we chose to slow down when everyone…",
            "img": "",
            "id": "7259457514121932801"
        },
        {
            "interaction": "Liked by Abhijeet Soni",
            "link": "",
            "title": "With Diwali around the corner, the…",
            "img": "",
            "id": "7257386933255852033"
        },
        {
            "interaction": "Liked by Abhijeet Soni",
            "link": "",
            "title": "With each salary increment, the quality…",
            "img": "",
            "id": "7254335564735225856"
        },
        {
            "interaction": "Liked by Abhijeet Soni",
            "link": "",
            "title": "I am hiring you as a 𝗗𝗮𝘁𝗮…",
            "img": "",
            "id": "7253978321972051968"
        }
    ],
    "linkedin_num_id": 442388166.0,
    "honors_and_awards": [
        {
            "title": "Winner - Oscar Creation Lab",
            "publication": "Oscar Young Management Consultants",
            "date": "2018-03-01T00:00:00.000Z",
            "description": null
        },
        {
            "title": "JMBS Scholarship",
            "publication": "Government of Canada",
            "date": "2017-06-01T00:00:00.000Z",
            "description": "Recipient of the JMBS Scholarship from Canada Government to work on their sponsored project. Project - To examine the effect of poison pill adoptions on firm value, controlling for the adopting firm's pre-existing corporate governance structure."
        },
        {
            "title": "JST Scholarship",
            "publication": "Japan Science & Technology",
            "date": "2016-07-01T00:00:00.000Z",
            "description": "Selected for Japan-Asia Youth Exchange Program in Science, the program for enhancing exchanges between Asia and Japan of the youths who will play a crucial role in the future field of Geology & Geophysics. Received a scholarship from Japan science and Technology, to work on their sponsored project at University of Tokyo, Japan. Project - Lower mantle rheology at high temperature."
        },
        {
            "title": "Inspire Scholarship",
            "publication": "Department of Science and Technology , Govt. of India",
            "date": "2015-03-01T00:00:00.000Z",
            "description": "Awarded to students who are ranked among the top 1% in 12th grade at their respective Board or Are among top 10,000 candidates in CML list who qualified JEE Advanced Examinations from all over India and are pursuing courses in Natural and Basic sciences."
        }
    ],
    "input": {
        "url": ""
    }
}