{
    "id": "azizarman",
    "name": "Aziz Arman",
    "city": "Dubai, United Arab Emirates",
    "country_code": "AE",
    "position": null,
    "about": "Aziz Arman is the CEO and founder of Jatri. He is an enthusiast of finding innovative…",
    "posts": null,
    "groups": null,
    "current_company": {
        "link": "",
        "name": "Jatri",
        "company_id": "jatri-app"
    },
    "experience": null,
    "people_also_viewed": [
        {
            "profile_link": "",
            "name": "Engr. Md. Shohel Rana Khan",
            "about": "Assistant Programmer at Chief Adviser’s Office Bangladesh",
            "location": "Bangladesh"
        },
        {
            "profile_link": "",
            "name": "Romel Hossain",
            "about": "CEO at XtrinSicSoft Ltd",
            "location": "Bangladesh"
        },
        {
            "profile_link": "",
            "name": "Kazi Ashikur Rasul, PMP",
            "about": "2x Founder | Digital Healthcare | Building an End to End Pharma-Stack | 500 Global '24",
            "location": "Dhaka, Bangladesh"
        },
        {
            "profile_link": "",
            "name": "Md Rizwanul Haque",
            "about": "Project Manager and Full-Stack Web Developer with a knack for SEO and Content Creation. Helping people to add values to their business. #ProjectManagement, #WordPress, #ContentWriting, #SEO, #VirtualAssistant, #WPErrors",
            "location": "Rajshahi, Bangladesh"
        },
        {
            "profile_link": "",
            "name": "Md. Mynul Islam",
            "about": "Chief Technology Officer - CTO",
            "location": "Bangladesh"
        },
        {
            "profile_link": "",
            "name": "Rezaul Karim",
            "about": "CEO at Arobil Limited | Entrepreneur",
            "location": "Bangladesh"
        },
        {
            "profile_link": "",
            "name": "Nayeem Ahmad",
            "about": null,
            "location": "Dhaka, Bangladesh"
        },
        {
            "profile_link": "",
            "name": "Abdur Rahim",
            "about": "Safety and Security against Terror and Threat",
            "location": "Bangladesh"
        },
        {
            "profile_link": "",
            "name": "Hasan Raihan",
            "about": "CEO, MR Technology",
            "location": "Bangladesh"
        }
    ],
    "educations_details": "North South University",
    "education": [
        {
            "title": "North South University",
            "url": "",
            "start_year": "2014",
            "end_year": "2018",
            "description": null,
            "description_html": null,
            "institute_logo_url": null
        }
    ],
    "recommendations_count": 4.0,
    "courses": "[{\"subtitle\":\"-\",\"title\":\"Internet and web technology\"},{\"subtitle\":\"-\",\"title\":\"Programming Language Concept \"},{\"subtitle\":\"-\",\"title\":\"Software Engineering\"},{\"subtitle\":\"-\",\"title\":\"VLSI Chip Design\"},{\"subtitle\":\"-\",\"title\":\"Verilog HDL\"}]",
    "languages": [
        {
            "subtitle": "-",
            "title": " Bengali "
        },
        {
            "subtitle": "-",
            "title": " English "
        }
    ],
    "certifications": [
        {
            "subtitle": "ACM, Association for Computing Machinery",
            "title": "Recognition of Service Award"
        }
    ],
    "recommendations": [
        "Adnan Firoze “Mr. Arman has been excellent in extra curricular activities including securing the President position of ACM Student Chapter at NSU which is a coveted position and he successfully organized a plethora of events conducive to engineering students. However, that is not the end of the story. His academic prowess is outstanding and I shall emphasize on that below. The academic achievements are given below: 1. Champion of IEEE DAY Hackathon 2. Presented Poster in Nsyss 2017 at BUET (2017 4th International Conference on Networking, Systems, and Security (4th NSysS 2017), December 18-20, 2017) 3. Presented Paper in ICICSA (International Conference on Inventive Computing Systems and Applications (ICICSA 2018) 4. Published Journal in International Journal of Pure and Applied Mathematics (IJPAM) The project he did under my supervision in the course - CSE 311 (Database Management System): APHAAS: Towards cloud-based intelligent CS academic project hosting for student influential which represent a collaborative computer science education approach through project sharing platform and proposed a user-friendly, cloud-based project storage service, which will infer to the computer science education. Then extended the infrastructure from the user based to the academic institution based cloud, by which, project influence will spread to a big scale. He is also a co-author of one of my top research papers to be presented in IEEE ICMLA 2018, Orlando, FL, USA. This shows his penchant for research. I wish him all the best in his future endeavors. He is one of the most versatile students I have come across. The potential for his success is extremely high in my opinion. ”",
        "Zunayeed Zahir “It is my immense pleasure to write a recommendation for Mr. Aziz Arman. He is one of the students in our department. Currently, he is doing a course on Senior Design Project under my supervision me. I first came to know Aziz when I became the Faculty Advisor to NSU ACM Student Chapter. He is the Chair (President) of that student branch. I highly admire his leadership and management skills that he possesses as a leader of a student community. Aziz is a dynamic individual along with a cooperative and assistive attitude towards anything that the team needs. He excels at supervising, guiding and motivating other members of the team. He is a natural leader and problem solver, easily identifying and proposing solutions to any road bumps that the team hits along the way. Many times, he has assisted me and suggested me some fruitful and precise solutions to the crisis in the time of need. Aziz is also great at staying on task. More than once, he’s guided the group back to the immediate topic at hand when its focus had begun to err off track. Not only does Aziz possess the leadership skills needed for a team leader, but he also has the behind-the-scenes skills as well. He aptly manages paperwork, orders stock, and help plan promotional activities and ensures that the entire business is running smoothly. Apart from his leadership, managerial and corporate skills, he is also a competent student. His good grip on his academic sector is admirable as well. He pertains good analytical skills. His project on Wireless Sensor Network demonstrated his ability to come up with a detailed understanding of the technical aspects of the project, alongside it’s impact to the society. His overall academic performance also reflects her aptitude that he has over his coursework. He excelled in all the project demonstration and presentation over the semester. He even did some relevant survey on the project topic that readily helped to support his project hypothesis. Alongside is demonstration and presentation skills, he is proficient in interpersonal and communication skills. His written work is both clear and concise, as well as interesting to read. He demonstrated his oral articulateness in the discussion sections that were an integral part of the course. At a personal level, Aziz is a well-disciplined, industrious student with a pleasant personality. He went above and beyond the course requirements in the quantity and quality of his project, putting in a lot of extra research and attending office hours every week. Eventually, he’s also planning to participate in a Capstone Project Showcase, a department requirement for project demonstration in front of the entire university arena. Moreover, he is planning to publish his project idea once he’s complete with his work and gets my approval. Aziz is unquestionably an exceptional candidate for being an entrepreneur as he possesses a mixed blend of a manager, self-motivated team leader and a proactive problem solver for any sce”"
    ],
    "volunteer_experience": null,
    "followers": 16504.0,
    "connections": 500.0,
    "current_company_company_id": "jatri-app",
    "current_company_name": "Jatri",
    "publications": "[{\"title\":\"Structural fracture detection and vibration monitoring system using WSN and Zigbee\",\"subtitle\":\"International conference on Cloud Computing and Internet of things(CCIOT) 2018,Singapore\",\"date\":\"Oct 2018\"},{\"title\":\"Automated Mobile Robot with RFID Scanner and Self Obstacle Avoiding System\",\"subtitle\":\"International Journal of Pure and Applied Mathematics (IJPAM).\",\"date\":\"February 27, 2018\",\"description\":\"Journal\"},{\"title\":\"Automated Mobile Robot with RFID Scanner and Self Obstacle Avoiding System\",\"subtitle\":\"International Conference on Inventive Computing Inventive Computing Systems and Applications (ICICSA 2018).\",\"date\":\"December 19, 2017\"},{\"title\":\"Automated Mobile Robot with QR Scanner and Self Obstacle Avoiding System\",\"subtitle\":\"4th International Conference on Networking, Systems and Security (4th NSysS 2017)\",\"date\":\"November 29, 2017\",\"description\":\"Poster\"},{\"title\":\"Machine Cognition of Violence in Videos using Novel Outlier-Resistant VLAD*\",\"subtitle\":\"https://ieeexplore.ieee.org/document/8614186\",\"description\":\"*This paper has been accepted to International Conference on Machine Learning and Applications (ICMLA) 2018T. Deb, A. Arman, and A. Firoze, “Machine Cognition of Violence in Videos using Novel Outlier-Resistant VLAD.”\"}]",
    "patents": null,
    "projects": "[{\"title\":\"Structural fracture detection and vibration monitoring system using WSN and Zigbee\",\"start_date\":\"Jun 2018\",\"end_date\":\"Dec 2018\"},{\"title\":\"Automated Mobile Robot with RFID Scanner and Self Obstacle Avoiding System\"},{},{},{\"title\":\"Student Project directory\"},{\"title\":\"Web based Home Rental application\"}]",
    "organizations": null,
    "location": "Dubai",
    "linkedin_id": "azizarman",
    "activity": [
        {
            "interaction": "Shared by Aziz Arman",
            "link": "",
            "title": "Join me for four days of exclusive networking and discovery with global innovators at LEAP 2025. This year, enjoy new experiences like LEAP Nights…",
            "img": "",
            "id": "7274711449220825091"
        },
        {
            "interaction": "Liked by Aziz Arman",
            "link": "",
            "title": "We are thrilled to announce an exciting 3-Tier Discount Campaign in partnership with Chaldal Limited and Robi Elite! This exclusive collaboration…",
            "img": "",
            "id": "3"
        },
        {
            "interaction": null,
            "link": "",
            "title": "Liked by Aziz Arman",
            "img": "",
            "id": "50"
        },
        {
            "interaction": "Liked by Aziz Arman",
            "link": "",
            "title": "We are thrilled to announce a year-long partnership with Give Bangladesh Foundation driven by a shared commitment to fostering meaningful and…",
            "img": "",
            "id": "7271788907527061504"
        },
        {
            "interaction": null,
            "link": "",
            "title": "Shared by Aziz Arman",
            "img": "",
            "id": "7271067993046982656"
        },
        {
            "interaction": "Liked by Aziz Arman",
            "link": "",
            "title": "I used to believe that engaging in M&A negotiations was pretty much like fundraising from VCs. After all, you partner with external sources of…",
            "img": "",
            "id": "7270789043880087552"
        },
        {
            "interaction": "Liked by Aziz Arman",
            "link": "",
            "title": "“Increasing private #investment is a national priority. It holds the key to a full spectrum of challenges from jobs to inflation. We have to make it…",
            "img": "",
            "id": "7269397370281291776"
        },
        {
            "interaction": "Liked by Aziz Arman",
            "link": "",
            "title": "It was an absolute honour to meet the Honorable Chief Adviser, Professor Muhammad Yunus, along with the foreign investor delegation from FICCI. The…",
            "img": "",
            "id": "7267230713031122944"
        },
        {
            "interaction": "Liked by Aziz Arman",
            "link": "",
            "title": "I am thrilled to announce that following our success at the ALB Middle East Law Awards, the DHL Group MEA Legal team has been honored as the “Legal…",
            "img": "",
            "id": "7266465198071304192"
        },
        {
            "interaction": "Liked by Aziz Arman",
            "link": "",
            "title": "At Global Swiss Business Hub",
            "img": "",
            "id": "7265418115130232832"
        },
        {
            "interaction": "Shared by Aziz Arman",
            "link": "",
            "title": "At Jatri, we've always known that execution is key. A great vision without strong leadership is just a dream. Today, I’m thrilled to announce a…",
            "img": "",
            "id": "7262436350493155330"
        },
        {
            "interaction": "Liked by Aziz Arman",
            "link": "",
            "title": "ROCH Ventures, in partnership with Dealroom.co, is thrilled to unveil the most comprehensive Travel Tech Market Landscape to date. This report…",
            "img": "",
            "id": "7262053425176002561"
        },
        {
            "interaction": "Liked by Aziz Arman",
            "link": "",
            "title": "The United Arab Emirates led as the top source of remittance, with the top 10 contributing countries bringing in USD 5,576.6 million, which made up…",
            "img": "",
            "id": "7260954544589660160"
        }
    ],
    "linkedin_num_id": 437381695.0,
    "honors_and_awards": [
        {
            "title": "Champion",
            "publication": "IEEE",
            "date": null,
            "description": "Champion of IEEE Day hackathon 2017"
        },
        {
            "title": "Finalist",
            "publication": "-",
            "date": null,
            "description": "Finalist of ICT EXPO 2017.The Project was Home Automation App"
        }
    ],
    "input": {
        "url": ""
    }
}