{
    "id": "bryanfalchuk",
    "name": "Bryan Falchuk",
    "city": "Boston, Massachusetts, United States",
    "country_code": "US",
    "position": null,
    "about": "President & CEO of The Property & Liability Resource Bureau (PLRB), committed to the…",
    "posts": null,
    "groups": null,
    "current_company": {
        "link": "",
        "name": "Property and Liability Resource Bureau",
        "company_id": "property-and-liability-resource-bureau"
    },
    "experience": null,
    "people_also_viewed": [
        {
            "profile_link": "",
            "name": "David True",
            "about": null,
            "location": "New York, NY"
        },
        {
            "profile_link": "",
            "name": "Peter Bardwick",
            "about": null,
            "location": "Mill Valley, CA"
        },
        {
            "profile_link": "",
            "name": "Peter Moustakerski",
            "about": null,
            "location": "New York, NY"
        },
        {
            "profile_link": "",
            "name": "Kurt Schneiber",
            "about": "Helping entrepreneurial leaders gain clear Vision, consistent Traction, and lasting team Health.",
            "location": "Houston, TX"
        },
        {
            "profile_link": "",
            "name": "Bobbi Dunphy",
            "about": null,
            "location": "San Francisco Bay Area"
        },
        {
            "profile_link": "",
            "name": "Lara Hodgson",
            "about": null,
            "location": "Atlanta, GA"
        },
        {
            "profile_link": "",
            "name": "Kumi Walker",
            "about": null,
            "location": "Columbus, OH"
        },
        {
            "profile_link": "",
            "name": "Mary Shelman",
            "about": "Thought Leader | Speaker | Board Member | Founder, Shelman Group",
            "location": "Greater Boston"
        },
        {
            "profile_link": "",
            "name": "Kenneth Douglas",
            "about": null,
            "location": "Bradenton, FL"
        },
        {
            "profile_link": "",
            "name": "Abhijit Chaudhary",
            "about": null,
            "location": "Las Vegas, NV"
        }
    ],
    "educations_details": null,
    "education": null,
    "recommendations_count": null,
    "courses": null,
    "languages": null,
    "certifications": null,
    "recommendations": null,
    "volunteer_experience": null,
    "followers": 12525.0,
    "connections": 500.0,
    "current_company_company_id": "property-and-liability-resource-bureau",
    "current_company_name": "Property and Liability Resource Bureau",
    "publications": "[{\"title\":\"The Future of Insurance - Volume III. The Collaborators\",\"subtitle\":\"Insurance Evolution Press\",\"date\":\"October 19, 2023\",\"description\":\"InsurTech solutions have created amazing new opportunities for insurers to innovate and evolve. But the path to bringing them to market can vary greatly, with some efforts going well and some fraught with delays, cost-overruns, scope issues and more.The key to success is driven by how insurers and solution providers work together collaboratively as partners.But what does that mean, and what actions and approaches specifically have the greatest impact on likelihood of success? Through the stories of different insurers and InsurTech providers working together to bring a solution to market, learn the most important success factors for moving your organization forward.Inspired by the findings of Insurance Collaboration Index, Bryan Falchuk and David Gritz of InsurTech NY collaborated on this project to help the industry as we strive to innovate and evolve.\"},{\"title\":\"The Future of Insurance - Volume II. The Startups\",\"subtitle\":\"Insurance Evolution Press\",\"date\":\"June 18, 2021\",\"description\":\"For centuries, the Insurance industry has been there for people at the worst moments of their lives, and kept the risk of those moments from stopping us from pursuing our dreams.Today, customer expectations are changing at an ever-increasing pace, driven further by the rapid digitization the world embraced in the pandemic. But that isn’t the only thing driving change in the industry, with a new generation of insurers emerging to serve customers differently and rethink the art of the possible in Insurance.The Future of Insurance: From Disruption to Evolution, Volume II. The Startups dives deep into the genesis stories of eight startup carriers and MGAs as they pursued different goals, faced different circumstances, and responded uniquely to the twists and turns of being a startup in the fast-moving world of InsurTech.Whether you are in a startup, thinking about launching or joining one, competing or partnering with one, or something else entirely, understanding their journeys can inform and inspire you to help move the industry forward as we all face an ever-rising bar of customer expectations and needs.Read the first-hand accounts directly from the people who lived the stories in the second installment in the series that is the blueprint for evolution in Insurance.\"},{\"title\":\"The Future of Insurance - Volume I. The Incumbents\",\"subtitle\":\"Insurance Evolution Press\",\"date\":\"June 22, 2020\",\"description\":\"For over 100 years, Insurers have stood by customers at some of the toughest moments in their lives, and helped allow people to go about their lives and pursue their business ideas without having to worry about the risks involved.Today, those customers have different expectations for how they want to do business and be served. And those expectations are changing faster than ever before.The industry has faced many headwinds, making it difficult to keep up with change – regulation, bureaucracy, system constraints, past technology project pain, thin margins, etc.And yet, several carriers have innovated and evolved.Understanding their paths to success can help shed light on how we as an industry can continue to evolve to meet our customers’ needs despite the disruption and headwinds we all face.The Future of Insurance shares the first-hand accounts of insurers across functions and lines of business to not just give inspiration, but leave readers with a tangible blueprint for evolving through a new set of modern, flexible and responsive approaches and tools.\"},{\"title\":\"The 50 75 100 Solution: Build Better Relationships\",\"subtitle\":\"newbodi.es publishing\",\"date\":\"November 19, 2019\",\"description\":\"In any difficult relationship, whether professional, romantic, family, friendship or some other type of relationship, there are two sides to the story. What if there was a way to rid any relationship from its dysfunction, even if you think you aren’t the cause of it? Seeing not just your role in the problem, but your ability to change the role of the other side of the equation is powerful.That’s The 50 75 100 Solution. Learn how to build better relationships.\"},{\"title\":\"Can 3 Simple Numbers Rescue Troubled Relationships?\",\"subtitle\":\"TEDxSevilleSq\",\"date\":\"August 4, 2018\",\"description\":\"We all have tough relationships. And we usually ask questions about them like, “Why are they doing this to me?” Or, “Why are they acting so badly?” Best-Selling author and certified Behavior Change Specialist Bryan Falchuk asks, what if it’s not them, but you? He doesn’t mean you are the problem per se, but whether or not you’re the reason for the difficulty in the relationship, you can still be the reason for the solution. That idea is what he calls, “The 50 75 100 Solution,” which he teaches in this TEDx talk. Starting with three Buddhist principles, Falchuk goes on to explain how these can be used to see our control and influence over the majority of any relationship dynamic, and how recognizing and using that can lead the relationship to be 100% better.\"},{\"title\":\"Overcoming Challenges to Achieve Your Goals\",\"subtitle\":\"TEDx\",\"date\":\"March 20, 2018\",\"description\":\"TEDx Talk at Bergen Community College on March 6, 2018 on the idea of Do a Day and how you can live a better life everyday\"},{\"title\":\"The Simple 2-Step Process to Recovering from Burnout\",\"subtitle\":\"Inc. Magazine\",\"date\":\"February 26, 2018\",\"description\":\"We're all capable of breaking the burnout cycle and becoming productive again\"},{\"title\":\"Don’t let negative self-talk hold you back\",\"subtitle\":\"Chicago Tribune\",\"date\":\"January 21, 2018\",\"description\":\"We spend our days focusing on what's wrong and talking down our achievements. That might be enough to hold our careers - and lives - bask from what they could be.\"},{\"title\":\"The 4 Ingredients of Motivation You Need to Success\",\"subtitle\":\"Inc Magazine\",\"date\":\"July 5, 2017\",\"description\":\"People go after big goals only to lose their drive or fail. Why? They lack real motivation. Learn the ingredients to find yours.\"},{\"title\":\"Do a Day: How to Live a Better Life Every Day\",\"subtitle\":\"newbodi.es publishing\",\"date\":\"March 30, 2017\",\"description\":\"Bryan Falchuk faced challenges in life - obesity, depression, work stress, illness, and more. And he struggled, like anyone else. Through that struggle, Bryan learned the secret to not just overcoming any individual challenge, but creating a life of achievement, happiness and harmony. That way is Do a Day.\"},{\"title\":\"Ten Steps to Transform Your Claims Customer Experience\",\"subtitle\":\"Insurance Nexis\",\"date\":\"March 1, 2017\",\"description\":\"It is safe to say that the insurance claims process is undergoing a period of intense change. The recognition that this is the single most important moment of truth for the customer is embedded across the industry and as such, the spotlight is on the claims process when customer experience is of paramount importance.Insurance and claims executives must transform the claims process, making it satis- fying to the consumer while also acting in the best interest of the insurer. The latter doesn’t mean denying liability or withholding payment by any means possible - quite the opposite. It means establishing a strong, empathetic yet e cient process that re ects well on the insurer while protecting their business (largely from fraud) and enhancing competitiveness.\"},{\"title\":\"Trying Times Make Some ‘Luxuries’ Essential\",\"subtitle\":\"Insurance Journal\",\"date\":\"October 19, 2009\",\"description\":\"Discussion of the false economies of forgoing insurance coverage during tough economic times.\"}]",
    "patents": null,
    "projects": null,
    "organizations": null,
    "location": "Boston",
    "linkedin_id": "bryanfalchuk",
    "activity": [
        {
            "interaction": "Liked by Bryan Falchuk",
            "link": "",
            "title": "Happy Holidays!!! Wishing you joy, peace, and inspiration this season. Here’s to a bright and prosperous new year!",
            "img": "",
            "id": "7277764271558561792"
        },
        {
            "interaction": "Liked by Bryan Falchuk",
            "link": "",
            "title": "Happy holidays from Encova Insurance! Here are a few of their highlights from 2024.",
            "img": "",
            "id": "7278424415745241090"
        },
        {
            "interaction": "Liked by Bryan Falchuk",
            "link": "",
            "title": "Happy Holidays everyone!!! It’s gonna be a weird 2 weeks of work. Hope everyone gets some good downtime and is ready to rock 2025.",
            "img": "",
            "id": "7276825701486379008"
        },
        {
            "interaction": "Liked by Bryan Falchuk",
            "link": "",
            "title": "Forget the ping pong tables and free snacks. The real key to attracting and retaining top talent? ↪ Invest in their growth. It's about…",
            "img": "",
            "id": "7273320776651448320"
        },
        {
            "interaction": "Shared by Bryan Falchuk",
            "link": "",
            "title": "\"This really built our confidence that, as a team, we were able to turn around our learnings on the travel product and quickly bring together an…",
            "img": "",
            "id": "7278581714380095488"
        },
        {
            "interaction": "Liked by Bryan Falchuk",
            "link": "",
            "title": "❄️ I will keep this short...a quick message and some thoughts before winding down for next week's festivities!🎄 Like a lot of us, when we look back…",
            "img": "",
            "id": "7275567500287713280"
        },
        {
            "interaction": "Shared by Bryan Falchuk",
            "link": "",
            "title": "Fantastic to join Alex Bond for another episode of The Leadership In Insurance Podcast to share about my new book, ‘The Future of Insurance :…",
            "img": "",
            "id": "7278564843807203328"
        },
        {
            "interaction": "Shared by Bryan Falchuk",
            "link": "",
            "title": "Learn 8 lessons from the 8 startups in my book, \"The Future of Insurance Volume II. The Startups,\" that I shared in this article for National…",
            "img": "",
            "id": "7278547991718682624"
        },
        {
            "interaction": "Shared by Bryan Falchuk",
            "link": "",
            "title": "Vern Steiner, CEO of The State Compensation Insurance Fund, talks about how he sees a clear push for more and more self-service. That’s not…",
            "img": "",
            "id": "7278531124740382721"
        },
        {
            "interaction": "Shared by Bryan Falchuk",
            "link": "",
            "title": "Casualty claims have been under fire for some time now. With nuclear verdicts, medial inflation, social inflation, pressure from the plaintiff's bar…",
            "img": "",
            "id": "7278522838305652736"
        },
        {
            "interaction": "Shared by Bryan Falchuk",
            "link": "",
            "title": "Have you checked out \"The Future of Insurance Volume III. The Collaborators\"? The path of bringing new solutions to market in insurance varies…",
            "img": "",
            "id": "7278480531657306112"
        },
        {
            "interaction": "Shared by Bryan Falchuk",
            "link": "",
            "title": "Joshua Hollander, CEO, North America, Horton International and co-founder of the InsurTech Association, shares some of the themes they noticed when…",
            "img": "",
            "id": "7278446562152706050"
        },
        {
            "interaction": "Shared by Bryan Falchuk",
            "link": "",
            "title": "People often ask me what's the tech they really need to invest in, or which particular solution they should go with for a specific need. I think…",
            "img": "",
            "id": "7278429707409186816"
        },
        {
            "interaction": "Liked by Bryan Falchuk",
            "link": "",
            "title": "Let me say it loudly for those at the back: the attached image is not sales and marketing. But let me tell you what is... 👇👇👇👇👇 Hey Ed, I had…",
            "img": "",
            "id": "7278397186722201600"
        }
    ],
    "linkedin_num_id": 157713.0,
    "honors_and_awards": [
        {
            "title": "Top 50 Data and Analytics Professionals for the USA and Canada",
            "publication": "Corinium",
            "date": "2018-03-01T00:00:00.000Z",
            "description": "Corinium Global Intelligence is proud to unveil their first compilation of the 50 leaders in data and analytics across the USA and Canada, which aims to showcase the movers and shakers they have worked with and seen in the industry who are driving innovation and commerciality for data and analytics in these two countries. This prestigious list of those within the data and analytics industry who Corinium have worked with celebrates data and analytics leadership, excellence and showcases… Show more"
        }
    ],
    "input": {
        "url": ""
    }
}