{
    "id": "dr-ankur-narang-7a791616",
    "name": "Dr Ankur Narang",
    "city": "Dubai, United Arab Emirates",
    "country_code": "AE",
    "position": null,
    "about": "Dr. Ankur Narang has 30+ years of experience in senior Technology R&D leadership and CXO…",
    "posts": null,
    "groups": null,
    "current_company": {
        "link": "",
        "name": "Virtual Advisory Board (VAB)",
        "company_id": "virtual-advisory-board-vab"
    },
    "experience": null,
    "people_also_viewed": [
        {
            "profile_link": "",
            "name": "Debdoot Mukherjee",
            "about": null,
            "location": "Bengaluru"
        },
        {
            "profile_link": "",
            "name": "Vivek Y S",
            "about": null,
            "location": "Bengaluru"
        },
        {
            "profile_link": "",
            "name": "Arpit Agarwal",
            "about": null,
            "location": "Bengaluru"
        },
        {
            "profile_link": "",
            "name": "Naresh Mehta",
            "about": null,
            "location": "Gurgaon"
        },
        {
            "profile_link": "",
            "name": "Pradnya Karbhari",
            "about": null,
            "location": "Chennai"
        },
        {
            "profile_link": "",
            "name": "Gaurav Lahoti",
            "about": null,
            "location": "Bengaluru"
        },
        {
            "profile_link": "",
            "name": "Subhabrata Ghosh",
            "about": "On a new journey...",
            "location": "Bengaluru"
        },
        {
            "profile_link": "",
            "name": "Piyush Goel",
            "about": null,
            "location": "Bengaluru"
        },
        {
            "profile_link": "",
            "name": "Vikash Goyal",
            "about": null,
            "location": "Bengaluru"
        },
        {
            "profile_link": "",
            "name": "Ravindra Babu Tallamraju",
            "about": null,
            "location": "Bengaluru"
        },
        {
            "profile_link": "",
            "name": "Dr Mohit Kumar",
            "about": null,
            "location": "Bengaluru"
        },
        {
            "profile_link": "",
            "name": "Neeraj Agrawal",
            "about": null,
            "location": "Greater Hyderabad Area"
        },
        {
            "profile_link": "",
            "name": "Rajiv Verma",
            "about": null,
            "location": "Bengaluru"
        },
        {
            "profile_link": "",
            "name": "Bharat Krishnamurthy",
            "about": null,
            "location": "Bengaluru"
        },
        {
            "profile_link": "",
            "name": "Sudheer Dhurjati",
            "about": null,
            "location": "Bengaluru"
        },
        {
            "profile_link": "",
            "name": "Kechit Goyal",
            "about": null,
            "location": "Mumbai"
        },
        {
            "profile_link": "",
            "name": "Sunil Goyal",
            "about": null,
            "location": "Gurgaon"
        },
        {
            "profile_link": "",
            "name": "Ramkumar Venkatesan",
            "about": null,
            "location": "Bengaluru"
        },
        {
            "profile_link": "",
            "name": "Nitin Chowdhary",
            "about": null,
            "location": "Noida"
        },
        {
            "profile_link": "",
            "name": "Jairaj Sathyanarayana",
            "about": null,
            "location": "Bengaluru"
        }
    ],
    "educations_details": "Indian Institute of Technology, Delhi",
    "education": [
        {
            "title": "Indian Institute of Technology, Delhi",
            "url": "",
            "start_year": "2005",
            "end_year": "2011",
            "description": null,
            "description_html": null,
            "institute_logo_url": null
        },
        {
            "start_year": "1998-01",
            "end_year": "2000-05",
            "description": null,
            "description_html": null,
            "institute_logo_url": null
        },
        {
            "start_year": "1998",
            "end_year": "2000",
            "description": null,
            "description_html": null,
            "institute_logo_url": null
        },
        {
            "title": ",",
            "start_year": "1990",
            "end_year": "1994",
            "description": null,
            "description_html": null,
            "institute_logo_url": null
        }
    ],
    "recommendations_count": 3.0,
    "courses": null,
    "languages": [
        {
            "subtitle": " Professional working proficiency ",
            "title": " Hindi "
        },
        {
            "subtitle": " Full professional proficiency ",
            "title": " English "
        }
    ],
    "certifications": null,
    "recommendations": [
        "Anshuman Misra “Firstly, it's a privilege to write a recommendation for Dr Ankur. I onboarded Ankur as VP AI at hike and partnered with him at hike from Product and Engg side. As one of the top Data Scientists globally, he had an immediate impact on our Sticker Recommendations metrics and customer experience as he drove our next level inventions and innovations on our NLP Stack . He also drove our V1 Hikemoji at a rapid pace with some innovative work in Computer Vision around generating a hyperlocal Hikemoji. Ankur helped hire an exceptionally strong bar raising ML&AI Team, laid foundations for our ML Ops Pipeline and helped us iterate exceptionally fast on the same. His presence at while representing Hike at global ML&AI forums (such as TensoFlowGlobal 2019), gave our team and brand great global Visibility. As a co-leader in the hike Executive team, I found him to be a Brilliant, Humble and Business/Product Metrics focussed Leader. It would be awesome to work with Dr Ankur sometime in future!”",
        "Harsha Bhat “I had the privilege of working with Ankur at Bytelearn. Ankur's ability to communicate complex concepts in a clear and concise manner sets him apart. His effective communication skills have played a vital role in guiding and mentoring teams, fostering collaboration, and ensuring alignment towards organizational goals. As a guide, Ankur's expertise and insights have been instrumental in shaping AI strategies and driving innovation. His visionary approach has paved the way for groundbreaking advancements in the field, positioning Bytelearn at the forefront of AI development. Overall, Dr. Ankur Narang's exceptional leadership, effective communication, and visionary mindset make him an invaluable asset. I've learnt a lot by observing his day-to-day conduct and sincerely hope to work with him in the future.”"
    ],
    "volunteer_experience": null,
    "followers": 13160.0,
    "connections": 500.0,
    "current_company_company_id": "virtual-advisory-board-vab",
    "current_company_name": "Virtual Advisory Board (VAB)",
    "publications": "[{\"title\":\"High Performance Offline and Online Distributed Collaborative Filtering\",\"subtitle\":\"Data Mining (ICDM), 2012 IEEE 12th International Conference on / IEEE\",\"date\":\"December 10, 2012\",\"description\":\"Big data analytics is a hot research area both in academia and industry. It envisages processing massive amounts of data at high rates to generate new insights leading to positive impact (for both users and providers) of industries such as E-commerce, Telecom, Finance, Life Sciences and so forth. We consider collaborative filtering (CF) and Clustering algorithms that are key fundamental analytics kernels that help in achieving these aims. High throughput CF and co-clustering on highly sparse and massive datasets, along with a high prediction accuracy, is a computationally challenging problem. In this paper, we present a novel hierarchical design for soft real-time (less than 1-minute.) distributed co-clustering based collaborative filtering algorithm. We study both the online and offline variants of this algorithm. Theoretical analysis of the time complexity of our algorithm proves the efficacy of our approach. Further, we present the impact of load balancing based optimizations on multi-core cluster architectures. Using the Netflix dataset(900M training ratings with replication) as well as the Yahoo KDD Cup(2.3B training ratings with replication) datasets, we demonstrate the performance and scalability of our algorithm on a large multi-core cluster architecture. In offline mode, our distributed algorithm demonstrates around 4x better performance (on Blue Gene/P) as compared to the best prior work, along with high accuracy. In online mode, we demonstrated around 3x better performance compared to baseline MPI implementation. To the best of our knowledge, our algorithm provides the best known online and offline performance and scalability results with high accuracy on multi-core cluster architectures.\"},{\"title\":\"Towards intelligent compression in streams: a biased reservoir sampling based Bloom filter approach\",\"subtitle\":\"Proceedings of the 15th International Conference on Extending Database Technology / ACM\",\"date\":\"March 27, 2012\",\"description\":\"With the explosion of information stored world-wide, data intensive computing has emerged as a central area of research. Efficient management and processing of this massively exponential amount of data from diverse sources, such as telecommunication call data records, telescope imagery, online transaction records, web pages, stock markets, medical records (monitoring critical health conditions of patients), climate warning systems, etc., has become a necessity. Removing redundancy from such huge (multi-billion records) datasets results in resource and compute efficiency for downstream processing and constitutes an important area of study. \\\"Intelligent compression\\\" or deduplication in streaming scenarios, for precise identification and elimination of duplicates from the unbounded data stream is a greater challenge given the real-time nature of data arrival. Stable Bloom Filters (SBF) [13] address this problem to a certain extent. However, SBF suffers from a high false negative rate and slow convergence rate, thereby rendering it inefficient for applications with low false negative rate tolerance.In this paper, we present a novel reservoir sampling based Bloom filter (RSBF) technique, based on the combined concepts of reservoir sampling and Bloom filters for approximate detection of duplicates in data streams. Using detailed theoretical analysis we prove analytical bounds on its false positive rate, false negative rate and convergence rates with low memory requirements. We show that RSBF outperforms SBF in terms of false negative rates and convergence rates while consuming the same amount of memory. Using empirical analysis on real-world datasets (3 million records) and synthetic datasets with around 1 billion records, we demonstrate upto 2× improvement in false negative rate with better convergence rates as compared to SBF, while maintaining comparable false positive rates.\"},{\"title\":\"Dynamic distributed scheduling algorithm for state space search\",\"subtitle\":\"Euro-Par 2012 Parallel Processing / Springer Berlin Heidelberg\",\"date\":\"January 1, 2012\",\"description\":\"Petascale computing requires complex runtime systems that need to consider load balancing along with low time and message complexity for scheduling massive scale parallel computations. Simultaneous consideration of these objectives makes online distributed scheduling a very challenging problem. For state space search applications such as UTS, NQueens, Balanced Tree Search, SAT and others, the computations are highly irregular and data dependent. Here, prior scheduling approaches such as [16], [14], [7], HotSLAW [10], which are dominantly locality-aware work-stealing driven, could lead to low parallel efficiency and scalability along with potentially high stack memory usage.In this paper we present a novel distributed scheduling algorithm (LDSS) for multi-place parallel computations, that uses an unique combination of d-choice randomized remote (inter-place) spawns and topology-aware randomized remote work steals to reduce the overheads in the scheduler and dynamically maintain load balance across the compute nodes of the system. Our design was implemented using GASNet API and POSIX threads. For the UTS (Unbalanced Tree Search) benchmark (using upto 4096 nodes of Blue Gene/P), we deliver the best parallel efficiency (92%) for 295B node binomial tree, better than [16] (87%) and demonstrate super-linear speedup on 1 Trillion node (largest studied so far) geometric tree along with higher tree node processing rate. We also deliver upto 40% better performance than Charm++. Further, our memory utilization is lower compared to HotSLAW. Moreover, for NQueens (N = 18), we demonstrate superior parallel efficiency (92%) as compared Charm++ (85%).\"},{\"title\":\"Fast community detection algorithm with gpus and multicore architectures\",\"subtitle\":\"Parallel & Distributed Processing Symposium (IPDPS), 2011 IEEE International\",\"date\":\"May 16, 2011\",\"description\":\"In this paper, we present the design of a novel scalable parallel algorithm for community detection optimized for multi-core and GPU architectures. Our algorithm is based on label propagation, which works solely on local information, thus giving it the scalability advantage over conventional approaches. We also show that weighted label propagation can overcome typical quality issues in communities detected with label propagation. Experimental results on well known massive scale graphs such as Wikipedia (100M edges) and also on RMAT graphs with 10M 40M edges, demonstrate the superior performance and scalability of our algorithm compared to the well known approaches for community detection. On the hep-th graph (352K edges) and the wikipedia graph (100M edges), using Power 6 architecture with 32 cores, our algorithm achieves one to two orders of magnitude better performance compared to the best known prior results on parallel architectures with similar number of CPUs. Further, our GPGPU based algorithm achieves 8× improvement over the Power 6 performance on 40M edge R-MAT graph. Alongside, we achieve high quality (modularity) of communities detected, with experimental evidence from well-known graphs such as Zachary karate club, Dolphin network and Football club, where we achieve modularity that is close to the best known alternatives. To the best of our knowledge these are best known results for community detection on massive graphs (100M edges) in terms of performance and also quality vs. performance trade-off. This is also a unique work on community detection on GPGPUs with scalable performance.\"},{\"title\":\"Real-time approximate range motif discovery & data redundancy removal algorithm\",\"subtitle\":\"Proceedings of the 14th International Conference on Extending Database Technology / ACM\",\"date\":\"March 21, 2011\",\"description\":\"Removing redundancy in the data is an important problem as it helps in resource and compute efficiency for downstream processing of massive (10 million to 100 million records) datasets. In application domains such as IR, stock markets, telecom and others there is a strong need for real-time data redundancy removal of enormous amounts of data flowing at the rate of 1Gb/s or higher. We consider the problem of finding Range Motifs (clusters) over records in a large dataset such that records within the same cluster are approximately close to each other. This problem is closely related to the approximate nearest neighbour search but is more computationally expensive. Real-time scalable approximate Range Motif discovery on massive datasets is a challenging problem. We present the design of novel sequential and parallel approximate Range Motif discovery and data de-duplication algorithms using Bloom filters. We establish asymptotic upper bounds on the false positive and false negative rates for our algorithm. Further, time complexity analysis of our parallel algorithm on multi-core architectures has been presented. For 10 million records, our parallel algorithm can perform approximate Range Motif discovery and data de-duplication, on 4 sets (clusters), in 59s, on 16 core Intel Xeon 5570 architecture. This gives a throughput of around 170K records/s and around 700Mb/s (using records of size 4K bits). To the best of our knowledge, this is the highest real-time throughput for approximate Range Motif discovery and data redundancy removal on such massive datasets.\"},{\"title\":\"High throughput data redundancy removal algorithm with scalable performance\",\"subtitle\":\"Proceedings of the 6th International Conference on High Performance and Embedded Architectures and Compilers / ACM\",\"date\":\"January 24, 2011\",\"description\":\"The ever growing need to process and analyze massive amounts of data from diverse sources such as telecom call data records, telescope imagery, web pages, stock markets, medical records and other domains has triggered worldwide research in data intensive computing. A key requirement here involves removing redundancy from data, as this enhances the compute efficiency for downstream data processing. These application domains have an intense need for high throughput data deduplication for huge volumes of data flowing at the rate of 1 GB/s or more. In this paper, we present the design of a novel parallel data redundancy removal algorithm. We also present a queueing theoretic analysis to optimize the throughput of our parallel algorithm on multi-core architectures. For 500M records, our parallel algorithm can perform complete deduplication in 255s, on 16 core Intel Xeon 5570 architecture. This gives a throughput of around 2M records/s. For 2048 byte records, we achieve a throughput of 0.81 GB/s. To the best of our knowledge, this is the highest throughput for data redundancy removal on such massive datasets. We also demonstrate strong and weak scalability of our algorithm for both multi-core Power6 and Intel Xeon 5570 architectures.\"},{\"title\":\"Distributed scalable collaborative filtering algorithm\",\"subtitle\":\"Euro-Par 2011 Parallel Processing / Springer Berlin Heidelberg\",\"date\":\"January 1, 2011\",\"description\":\"Collaborative filtering (CF) based recommender systems have gained wide popularity in Internet companies like Amazon, Netflix, Google News, and others. These systems make automatic predictions about the interests of a user by inferring from information about like-minded users. Real-time CF on highly sparse massive datasets, while achieving a high prediction accuracy, is a computationally challenging problem. In this paper, we present a novel design for soft real-time (less than 10 sec.) distributed co-clustering based Collaborative Filtering algorithm. Our distributed algorithm has been optimized for multi-core cluster architectures using pipelined parallelism, computation communication overlap and communication optimizations. Theoretical parallel time complexity analysis of our algorithm proves the efficacy of our approach. Using the Netflix dataset (100M ratings), we demonstrate the performance and scalability of our algorithm on 1024-node Blue Gene/P system. Our distributed algorithm (implemented using OpenMP with MPI) delivered training time of around 6s on the full Netflix dataset and prediction time of 2.5s on 1.4M ratings (1.78μs per rating prediction). Our training time is around 20× (more than one order of magnitude) better than the best known parallel training time, along with high accuracy (0.87 ±0.02 RMSE). To the best of our knowledge, this is the best known parallel performance for collaborative filtering on Netflix data at such high accuracy and also the first such implementation on multi-core cluster architectures such as Blue Gene/P.\"},{\"title\":\"Perfectly balanced allocation with estimated average using approximately constant retries\",\"subtitle\":\"CoRR, vol. abs/1111.0801, 2011\",\"date\":\"2011\",\"description\":\"Balanced allocation of online balls-and-bins has long been an active area of research for efficientload balancing and hashing applications. There exists a large number of results in this domain withdifferent settings, such as parallel allocations [1], multi-dimensional allocations [5], weighted balls [4]etc. For sequential multi-choice allocation where m balls are thrown into n bins with each ball choosingd (constant) bins independently uniformly at random, the maximum load of a bin is O(log log n)+m=nwith high probability [3]. This offers the current best known allocation scheme. However, for d =\\u0002(log n), the gap obtained is of O(1) [9]. A similar constant gap bound has been established for parallelallocations with O(log\\u0003 n) communication rounds [12].In this paper we propose a novel multi-choice allocation algorithm, Improved D-choice with EstimatedAverage (IDEA) achieving a constant gap with high probability for the sequential single-dimensionalonline allocation problem with constant d. We achieve a maximum load of dm=ne with high probabilityfor constant d choice scheme with approximately constant number of retries or rounds per ball. Wealso show that the bound holds even for an arbitrary large number of balls, m >> n. Further, we generalizethis result to the weighted case, where the balls have weights drawn from an arbitrary weightdistribution with finite variance. We show that the gap in this case is also independent of the number ofballs thrown and is a constant. We also propose that IDEA provides constant gap bound w.h.p. in themulti-dimensional scenario for m = n.\"},{\"title\":\"Highly scalable parallel collaborative filtering algorithm\",\"subtitle\":\"High Performance Computing (HiPC), 2010 International Conference on/ IEEE\",\"date\":\"December 19, 2010\",\"description\":\"Collaborative filtering (CF) based recommender systems have gained wide popularity in Internet companies like Amazon, Netflix, Google News, and others. These systems make automatic predictions about the interests of a user by inferring from information about like-minded users. Realtime CF on highly sparse massive datasets, while achieving a high prediction accuracy, is a computationally challenging problem. In this paper, we present the design of a soft real-time (around 1 min.) parallel CF algorithm based on the Concept Decomposition technique. Our parallel algorithm has been optimized for multicore/many-core architectures while maintaining the prediction accuracy of 0.84 RMSE. Using the Netflix dataset, we demonstrate the performance and scalability of our algorithm (in both batch mode and online mode) on a 32-core Power6 based SMP system. Our parallel algorithm delivered training time of 64s on the full Netflix dataset and prediction time of 4.5s on 1.4M ratings (3.2/μs per rating prediction). This is 12.6× better than the best known sequential training time and around 33 × better than the best known sequential prediction time, along with high accuracy (0.84 RMSE). To the best of our knowledge, this is also the best known parallel performance at such high accuracy.\"},{\"title\":\"Real-time memory efficient data redundancy removal algorithm\",\"subtitle\":\"Proceedings of the 19th ACM international conference on Information and knowledge management / ACM\",\"date\":\"October 26, 2010\",\"description\":\"Data intensive computing has become a central theme in research community and industry. There is an ever growing need to process and analyze massive amounts of data from diverse sources such as telecom call data records, telescope imagery, online transaction records, web pages, stock markets, medical records (monitoring critical health conditions of patients), climate warning systems, etc. Removing redundancy in the data is an important problem as it helps in resource and compute efficiency for downstream processing of the massive (1 billion to 10 billion records) datasets. In application domains such as IR, stock markets, telecom and others, there is a strong need for real-time data redundancy removal (referred to as DRR) of enormous amounts of data flowing at the rate of 1 GB/s or more. Real-time scalable data redundancy removal on massive datasets is a challenging problem. We present the design of a novel parallel data redundancy removal algorithm for both in-memory and disk-based execution. We also develop queueing theoretic analysis to optimize the throughput of our parallel algorithm on multi-core architectures. For 500 million records, our parallel algorithm can perform complete de-duplication in 255s, on 16 core Intel Xeon 5570 architecture, with in-memory execution. This gives a throughput of 2M records/s. For 6 billion records, our parallel algorithm can perform complete de-duplication in less than 4.5 hours, using 6 cores of Intel Xeon 5570, with disk-based execution. This gives a throughput of around 370K records/s. To the best of our knowledge, this is the highest real-time throughput for data redundancy removal on such massive datasets. We also demonstrate the scalability of our algorithm with increasing number of cores and data.\"},{\"title\":\"Parallel exact time series motif discovery\",\"subtitle\":\"Euro-Par 2010-Parallel Processing / Springer Berlin Heidelberg\",\"date\":\"January 1, 2010\",\"description\":\"Time series motifs are an integral part of diverse data mining applications including classification, summarization and near-duplicate detection. These are used across wide variety of domains such as image processing, bioinformatics, medicine, extreme weather prediction, the analysis of web log and customer shopping sequences, the study of XML query access patterns, electroencephalograph interpretation and entomological telemetry data mining. Exact Motif discovery in soft real-time over 100K time series is a challenging problem. We present novel parallel algorithms for soft real-time exact motif discovery on multi-core architectures. Experimental results on large scale P6 SMP system, using real life and synthetic time series data, demonstrate the scalability of our algorithms and their ability to discover motifs in soft real-time. To the best of our knowledge, this is the first such work on parallel scalable soft real-time exact motif discovery.\"}]",
    "patents": "[{\"title\":\"Distributed scalable clustering and community detection\",\"date_issued\":\"March 24, 2015\",\"patents_id\":\"US 8990209\",\"description\":\"Techniques, an apparatus and an article of manufacture for distributed scalable clustering and community detection. A method includes generating a label for each node in a graph, wherein said label identifies a community in which a node participates, propagating each label locally within two or more segments of the graph based on a participation percentage of each node in at least one identified community within the graph, and deriving at least one cluster of nodes in the graph that corresponds to the at least one identified community based on said propagating.\"},{\"title\":\"Systems and methods for affinity driven distributed scheduling of parallel computations\",\"date_issued\":\"February 17, 2015\",\"patents_id\":\"US 8959525\",\"description\":\"Embodiments of the invention provide efficient scheduling of parallel computations for higher productivity and performance. Embodiments of the invention provide various methods effective for affinity driven and distributed scheduling of multi-place parallel computations with physical deadlock freedom.\"},{\"title\":\"System and method for multithreaded text indexing for next generation multi-core architectures\",\"date_issued\":\"February 25, 2014\",\"patents_id\":\"US 8661037\",\"description\":\"A system and method for indexing documents in a data storage system includes generating a single document hash table in storage memory for a single document using an index construction in a multithreaded and scalable configuration wherein multiple threads are each assigned work to reduce synchronization between threads. The single document hash table includes partitioning the single document and indexing strings of partitioned portions of the single document to create a minor hash table for each document sub-part; generating a document level hash table from the minor hash tables; updating a stream level hash table for the strings which maps every string to a global identifier; and generating a term reordered array from the document level hash table.\"},{\"title\":\"Systems and methods for performing parallel multi-level data computations\",\"date_issued\":\"September 10, 2013\",\"patents_id\":\"US 8533423\",\"description\":\"Systems and methods for performing parallel multi-level data computations in a storage system are provided. One system includes a memory storing data, multiple caches, and a processor. The processor is configured to perform the method below. One method includes determining the total amount of data in the memory, dividing the amount of data by each cache capacity to determine the number of nodes needed for processing the data in the memory, and automatically creating the nodes. Here, the nodes form a tree structure including multiple levels where the lowest level includes a first number of nodes equal to the amount of data divided by the cache memory capacity. Also, each lowest level node is configured to process an amount of data equal to the cache memory capacity and each level above the lowest level is configured to include one or more nodes for receiving an input from lower level nodes.\"},{\"title\":\"Systems and methods for joint analytics on user level and network level data of a communications network\",\"date_issued\":\"May 21, 2013\",\"patents_id\":\"US 8447269\",\"description\":\"Systems and associated methods provide for joint analytics on user level data and network level data. Systems and methods provide for accessing telecommunication network user level data and network level data and integrating analysis on both data types to produce a common result. Embodiments utilize joint analytics to generate patterns and rules concerning the content and services accessed by a user, when they are accessed, and how they are accessed.\"},{\"title\":\"Parallel data redundancy removal\",\"date_issued\":\"December 11, 2012\",\"patents_id\":\"US 8332367\",\"description\":\"A method, system, and computer usable program product for parallel data redundancy removal are provided in the illustrative embodiments. A plurality of values is computed for a record in a plurality of records stored in a storage device. The plurality of values for the record is distributed to corresponding queues in a plurality of queues, wherein each of the plurality of queues is associated with a corresponding section of a Bloom filter. A determination is made whether each value distributed to the corresponding queues for the record is indicated by a corresponding value in the corresponding section of the Bloom filter. The record is identified as a redundant record in response to a determination that each value distributed to the corresponding queues for the record is indicated by a corresponding value in the corresponding section of the Bloom filter.\"},{\"title\":\"Assigning threads and data of computer program within processor having hardware locality groups\",\"date_issued\":\"September 4, 2012\",\"patents_id\":\"US 8261273\",\"description\":\"A computer program having threads and data is assigned to a processor having a processor cores and memory organized over hardware locality groups. The computer program is profiled to generate a data thread interaction graph (DTIG) representing the computer program. The threads and the data of the computer program are organized over clusters using the DTIG and based on one or more constraints. The DTIG is displayed to a user, and the user is permitted to modify the constraints such that the threads and the data of the computer program are reorganized over the clusters. Each cluster is mapped onto one of the hardware locality groups. The computer program is regenerated based on the mappings of clusters to hardware locality groups. At run-time, optimizations are performed to improve execution performance, while the computer program is executed.\"},{\"title\":\"Method for massively parallel multi-core text indexing\",\"date_issued\":\"July 24, 2012\",\"patents_id\":\"US 8229916\",\"description\":\"There is provided, in a parallel pipelined structure on a multi-core device, a method for parallel pipelined multi-core indexing. The method includes generating one or more single document indexes respectively corresponding to one or more single documents of a given data stream. The method further includes generating one or more multi-document interval-based hash tables from the one or more single document indexes. The method also includes generating a global hash table formed from merging one or more of the multi-document interval-based hash tables, the global hash table representing a collective index for all of the single documents for which the one or more single document indexes were generated.\"},{\"title\":\"Compiling and linking modules of a cycle-based logic design\",\"date_issued\":\"March 18, 2008\",\"patents_id\":\"US 7346903\",\"description\":\"A method for compiling a logic design includes inputting a logic design and an input file into a plurality of compilers, respectively, where the logic design comprises a plurality of modules, compiling separately the plurality of modules into a plurality of object files, and linking the plurality of object files to execute the logic design.\"},{\"title\":\"Constraint-based global router for routing high performance designs\",\"date_issued\":\"November 14, 2006\",\"patents_id\":\"US 7137097\",\"description\":\"A method, system, computer system, and computer program product including an algorithm that performs the constraints-based global routing step in the physical design of integrated circuits. The algorithm is based on finding routes for the entire circuit based on constraints being satisfied for the entire design. Initially, for each net, a set of possible routing solutions is determined based on applicable constraints. The possible solutions for the nets are combined to create a highly-connected “intersection graph,” with each intersection graph node representing a net. The intersection graph is partitioned based on constraints and performance criteria. An optimal solution is determined for each partition. The optimal solutions for the partitions are then combined to produce a global routing solution. The global routing solution is provided to a detailed router, which completes the routing for the design.\"},{\"title\":\"Method and apparatus for simulation system compiler\",\"date_issued\":\"July 18, 2006\",\"patents_id\":\"US 7080365\",\"description\":\"A method for compiling a cycle-based design involves generating a parsed cycle-based design from the cycle-based design, elaborating the parsed cycle-based design to an annotated syntax tree, translating the annotated syntax tree to an intermediate form, and converting the intermediate form to an executable form.\"},{\"title\":\"ONLINE AND DISTRIBUTED OPTIMIZATION FRAMEWORK FOR WIRELESS ANALYTICS\",\"date_issued\":\"January 19, 2012\",\"patents_id\":\"US 20130172041\",\"description\":\"A method, computer program product, and computer system directed to an online and distributed optimization framework for wireless analytics. A radio network controller determines a ranking for each of a plurality of received objects using a plurality of similarity graphs. The radio network controller extracts a common structure by collaborative filtering data associated with a plurality of user devices and the plurality of received objects. The common structure is analyzed to infer usage patterns within a time slot. The radio network controller stores a subset of the ranked objects of the plurality of received objects in response to the analysis.\"},{\"title\":\"Distributed data scalable adaptive map-reduce framework\",\"patents_id\":\"US 9053067\",\"description\":\"A method, an apparatus and an article of manufacture for generating a distributed data scalable adaptive map-reduce framework for at least one multi-core cluster. The method includes partitioning a cluster into at least one computational group, determining at least one key-group leader within each computational group, performing a local combine operation at each computational group, performing a global combine operation at each of the at least one key-group leader within each computational group based on a result from the local combine operation, and performing a global map-reduce operation across the at least one key-group leader within each computational group.\"}]",
    "projects": null,
    "organizations": [
        {
            "title": "AAAI",
            "membership_type": "Member",
            "membership_number": null
        },
        {
            "title": "Association of Computing Machinery (ACM)",
            "membership_type": "Member",
            "membership_number": null
        },
        {
            "title": "IEEE",
            "membership_type": "Senior Member",
            "membership_number": null
        }
    ],
    "location": "Dubai",
    "linkedin_id": "dr-ankur-narang-7a791616",
    "activity": [
        {
            "interaction": "Liked by Dr Ankur Narang",
            "link": "",
            "title": "It was indeed my privilege and honour to be named a distinguished Fellow of the Indian National Academy of Engineering (INAE) , the highest status…",
            "img": "",
            "id": "7278372716427059200"
        },
        {
            "interaction": "Liked by Dr Ankur Narang",
            "link": "",
            "title": "Top 10 quantum breakthroughs and emerging trends: 2024. Here are my top 10 quantum breakthroughs and highlights of this year. Did any other quantum…",
            "img": "",
            "id": "10"
        },
        {
            "interaction": "Liked by Dr Ankur Narang",
            "link": "",
            "title": "It was my privilege to be part of the Expert Committee established by AICTE and Department of Science & Technology, Government of India, which…",
            "img": "",
            "id": "7277369088945876994"
        },
        {
            "interaction": "Liked by Dr Ankur Narang",
            "link": "",
            "title": "#IITDelhi students have secured over 1200 job offers, including pre-placement offers (PPOs), with about 1150 individual students being uniquely…",
            "img": "",
            "id": "7276887675020746752"
        },
        {
            "interaction": "Liked by Dr Ankur Narang",
            "link": "",
            "title": "Thank you for inviting me, Taranjeet Singh my old friend, and Medhavi Singh and Criteo team. It was great to share thoughts on how AI, immersive…",
            "img": "",
            "id": "7275436878382645248"
        },
        {
            "interaction": "Liked by Dr Ankur Narang",
            "link": "",
            "title": "Micron’s team delivered a record revenue quarter for our fiscal Q1, which represented an 84% increase from our year-ago revenue results. Our data…",
            "img": "",
            "id": "7275294706048159744"
        },
        {
            "interaction": "Liked by Dr Ankur Narang",
            "link": "",
            "title": "In many parts of India, students have potential but lack opportunities to learn future-ready skills. Our school and college curriculums are extremely…",
            "img": "",
            "id": "7275011644810780672"
        },
        {
            "interaction": "Liked by Dr Ankur Narang",
            "link": "",
            "title": "#linkedinFam we finally did the 1st NoCode AI workshop in Dubai and it was a hit! We had to change our plans at the last min and go online instead of…",
            "img": "",
            "id": "7275485158131048449"
        },
        {
            "interaction": "Liked by Dr Ankur Narang",
            "link": "",
            "title": "The Indian Army takes a bold step forward with the launch of the Indian Army AI Incubation Centre (IAAIIC). It is a matter of tremendous honour and…",
            "img": "",
            "id": "7275451195761029121"
        },
        {
            "interaction": "Liked by Dr Ankur Narang",
            "link": "",
            "title": "Big Data and Analytics are transforming India's economy by driving data-driven decision-making, enhancing productivity, and fostering innovation…",
            "img": "",
            "id": "7275396985426223104"
        },
        {
            "interaction": "Liked by Dr Ankur Narang",
            "link": "",
            "title": "We are thrilled to announce our first investment in the Quantum space by leading a $2M funding round in Quanfluence alongside our friends at Golden…",
            "img": "",
            "id": "7275414702887739392"
        },
        {
            "interaction": "Liked by Dr Ankur Narang",
            "link": "",
            "title": "Furthering Dubai's leadership in future mobility, we launched the Middle East's first-of-its-kind drone delivery system today. We have directed teams…",
            "img": "",
            "id": "7274788228077936640"
        },
        {
            "interaction": "Liked by Dr Ankur Narang",
            "link": "",
            "title": "Here is an inspiring article about my distinguished colleague and friend, Dr. Milt Halem. Dr. Halem not only studies forces of nature…",
            "img": "",
            "id": "7274452994274824194"
        },
        {
            "interaction": "Liked by Dr Ankur Narang",
            "link": "",
            "title": "Mobikwik Goes Public!! Today marks a historic milestone as Mobikwik, India’s leading digital wallet and payments platform, officially goes public!…",
            "img": "",
            "id": "7275020292840636416"
        },
        {
            "interaction": "Liked by Dr Ankur Narang",
            "link": "",
            "title": "Today, I had the privilege of speaking at the United Nations IGF meeting about the intersection of #innovation and #sustainability. Reflecting on the…",
            "img": "",
            "id": "7274469281348640768"
        },
        {
            "interaction": "Liked by Dr Ankur Narang",
            "link": "",
            "title": "Looking forward to this launch. Great work, Sri Valluri Steven Qi Heiko Claussen Ary Bressane Ron Beck",
            "img": "",
            "id": "7274266184483508225"
        },
        {
            "interaction": "Liked by Dr Ankur Narang",
            "link": "",
            "title": "Big Thank you for everyone for your valuable insights #SRF2024, each driven by leaders in the retail industry and adding immense value to the journey…",
            "img": "",
            "id": "7274338032063774722"
        }
    ],
    "linkedin_num_id": 56019439.0,
    "honors_and_awards": [
        {
            "title": "AAAI Application Deployment Award for Deep Learning driven Sticker Recommendation",
            "publication": "AAAI",
            "date": "2020-02-01T00:00:00.000Z",
            "description": null
        },
        {
            "title": "Top 100 Innovative CIO",
            "publication": "CIO Axis",
            "date": "2019-02-01T00:00:00.000Z",
            "description": "Leadership In Innovative Technologies based Digital Transformation"
        },
        {
            "title": "Top 50 Analytics Awards India, MachineCon 2018",
            "publication": "Analytics India Magazine",
            "date": "2018-04-01T00:00:00.000Z",
            "description": "Recognized for exemplary Data Science/ML/AI contributions and leadership, amongst India's Top 50 Analytics Leaders"
        },
        {
            "title": "Top 10 Data Scientists in India, 2017",
            "publication": "Analytics India Magazine",
            "date": "2017-11-01T00:00:00.000Z",
            "description": "Recognized as Top10 data scientist in India, owing to solid scientific and industry contributions to the field of Data Science/ML/AI"
        },
        {
            "title": "Technical Accomplishment Award for Massive Scale Indexing & Search",
            "publication": "IBM Research",
            "date": "2012-12-01T00:00:00.000Z",
            "description": null
        },
        {
            "title": "Certificate for contributions in HPC for US National Medal of Technology & Innovation (IBM Blue Gene SuperComputer)",
            "publication": "IBM Research",
            "date": "2008-07-01T00:00:00.000Z",
            "description": null
        },
        {
            "title": "Innovation Leadership Award",
            "publication": "Sun Microsystems Inc",
            "date": "2002-04-01T00:00:00.000Z",
            "description": "For outstanding contributions to the Massive Scale Simulation (Phaser)"
        },
        {
            "title": "Sun AttaTeam Award",
            "publication": "Sun Microsystems Inc.",
            "date": "1997-09-01T00:00:00.000Z",
            "description": null
        },
        {
            "title": "Millennium Falcon Award",
            "publication": "Sun Microsystems Inc",
            "date": "1997-05-01T00:00:00.000Z",
            "description": "For outstanding contributions to the Millennium Sparc processor development project"
        },
        {
            "title": "IEEE Award in Hardware Design Contest at International Conference on VLSI Design, 1995",
            "publication": "IEEE",
            "date": "1995-01-01T00:00:00.000Z",
            "description": "Best hardware design: FPGA based Wormhole Router Chip"
        },
        {
            "title": "National Talent Search Scholarship",
            "publication": "NCERT",
            "date": "1988-03-01T00:00:00.000Z",
            "description": "Selection based on National Level Scholastic Exam and Interview"
        },
        {
            "title": "Junior Science Talent Search Scholarship",
            "publication": "Department of Education, Science Branch, Delhi",
            "date": "1987-05-01T00:00:00.000Z",
            "description": "Topper in Delhi"
        }
    ],
    "input": {
        "url": ""
    }
}