{
    "id": "dr-jonathan-doerr-60b0a334",
    "name": "Dr. Jonathan Doerr",
    "city": "United Arab Emirates",
    "country_code": "AE",
    "position": null,
    "about": null,
    "posts": null,
    "groups": null,
    "current_company": {
        "link": "",
        "name": "Antler",
        "company_id": "antlerglobal"
    },
    "experience": null,
    "people_also_viewed": [
        {
            "profile_link": "",
            "name": "Andreas Skorski",
            "about": "Connecting commerce via <Genesys> AI",
            "location": "New York, NY"
        },
        {
            "profile_link": "",
            "name": "Saygin Yalcin",
            "about": null,
            "location": "Dubai, United Arab Emirates"
        },
        {
            "profile_link": "",
            "name": "Tanaz Dizadji",
            "about": null,
            "location": "United Arab Emirates"
        },
        {
            "profile_link": "",
            "name": "Joe Afif",
            "about": null,
            "location": "Dubai, United Arab Emirates"
        },
        {
            "profile_link": "",
            "name": "Kiran Kolisetty",
            "about": "Founder & CEO at Scale Global Ventures driving international growth.",
            "location": "Singapore"
        },
        {
            "profile_link": "",
            "name": "Molly Moon (문선민)",
            "about": "A global growth bearer, capable of connecting MENA markets with Korean capital & technologies.",
            "location": "Dubai, United Arab Emirates"
        },
        {
            "profile_link": "",
            "name": "Hyder Mumtaz",
            "about": "CEO @ Ailaaj",
            "location": "Lahore"
        },
        {
            "profile_link": "",
            "name": "Ramy Assaf",
            "about": null,
            "location": "United Arab Emirates"
        },
        {
            "profile_link": "",
            "name": "Muqadas Wattoo",
            "about": "Serial Entrepreneur / Founder DubaiCars.com",
            "location": "Lahore"
        },
        {
            "profile_link": "",
            "name": "Fodhil Benturquia",
            "about": null,
            "location": "United Arab Emirates"
        },
        {
            "profile_link": "",
            "name": "Mubarak Muaz",
            "about": null,
            "location": "United Arab Emirates"
        },
        {
            "profile_link": "",
            "name": "Luke Nolan",
            "about": null,
            "location": "Dubai, United Arab Emirates"
        },
        {
            "profile_link": "",
            "name": "Ahmed Fasih Akhtar",
            "about": null,
            "location": "United Arab Emirates"
        },
        {
            "profile_link": "",
            "name": "Jane Drury",
            "about": "Group CEO @ ME Digital Group | CEO & Founder",
            "location": "United Arab Emirates"
        },
        {
            "profile_link": "",
            "name": "Sanjeet Singh Sahni",
            "about": null,
            "location": "Dubai, United Arab Emirates"
        },
        {
            "profile_link": "",
            "name": "Adam Cukrowski",
            "about": null,
            "location": "Dubai, United Arab Emirates"
        },
        {
            "profile_link": "",
            "name": "Amélie Hua",
            "about": null,
            "location": "United Arab Emirates"
        },
        {
            "profile_link": "",
            "name": "Natasha Al Fadhli",
            "about": null,
            "location": "Dubai, United Arab Emirates"
        },
        {
            "profile_link": "",
            "name": "Ali Chaudhry",
            "about": null,
            "location": "Lahore"
        },
        {
            "profile_link": "",
            "name": "Philipp Tachas",
            "about": "GM UAE at Calo",
            "location": "Dubai, United Arab Emirates"
        }
    ],
    "educations_details": null,
    "education": null,
    "recommendations_count": null,
    "courses": null,
    "languages": null,
    "certifications": null,
    "recommendations": null,
    "volunteer_experience": null,
    "followers": 14429.0,
    "connections": 500.0,
    "current_company_company_id": "antlerglobal",
    "current_company_name": "Antler",
    "publications": "[{\"title\":\"Music as a Service as an Alternative to Music Piracy?\",\"subtitle\":\"Business & Information Systems Engineering\",\"date\":\"2013\",\"description\":\"Despite increasing acceptance of digital channels, total sales in the music business decreased by 31 % from 2004 to 2010. Music piracy is still considered one of the main causes for this. However, several studies found no effects or even positive effects of illegal downloading on record sales. In the past, piracy has been counteracted especially by prosecution and legal offers. Music as a Service (MaaS) represents a new, differing distribution approach in digital music. In contrast to the well-known music platforms for so-called à-la-carte downloads, such as the iTunes Store, MaaS possesses two important characteristics: transmission (streaming instead of downloading) and pricing model (flat rate instead of pay-per-download). Therefore, the consumption of music by means of purchasing and downloading is replaced by a monthly payment service (paid MaaS) and an ad-supported (free MaaS) service. First user surveys suggest that many music pirates are making use of these offers. To find out if MaaS is an attractive distribution channel for music pirates, we developed a model to explain the intention to use MaaS based on the Theory of Planned Behavior. To empirically test this model, we surveyed 132 music pirates. Among others, the outcome shows that the intention to use free MaaS is mainly affected by the attitude towards MaaS, while using paid MaaS is predominantly a result of the influence of users’ closest peers. The attitude towards MaaS is positively influenced by the desire to receive music recommendations, the payment type (in the form of a flat rate model), and the relative advantage of MaaS compared to illegal choices.\"},{\"title\":\"Music as a Service - Ein neues Geschäftsmodell für digitale Musik\",\"subtitle\":\"ePubli\",\"date\":\"2012\",\"description\":\"Langsam scheint sich der Markt für legale Musikdownloads zu etablieren. Mittlerweile werden 32% (5.2 Mrd. US$) des Umsatzes der Musikbranche in digitalen Kanälen generiert, welche von weltweit über 500 lizensierten Musikplattformen erwirtschaftet werden. Allein im Jahr 2011 konnten die Umsätze des weltweiten digitalen Musikmarkts um 8% gesteigert werden. Mit Music as a Service (MaaS) gibt es seit einiger Zeit ein neues Geschäftsmodell für digitale Musik. Im Vergleich zu bekannten Musikangeboten mit sog. à-la-carte-Downloads, wie bspw. dem iTunes Store oder Amazonmp3, unterscheidet sich MaaS in zwei wichtigen Eigenschaften: der Übertragungsart (Streaming statt Download) und dem Preismodell (Flatrate statt Pay per Download). Kauf plus Download wird durch einen monatlich zu bezahlenden bzw. werbefinanzierten Streaming-Service ersetzt. Beim Erlösmodell verwendet MaaS das Freemium Prinzip. Der Kunde kann dabei zwischen einer kostenlosen werbefinanzierten sowie einer kostenpflichtigen Variante des Services wählen. Das kostenpflichtige „Premium“ Angebot, welches für einen monatlichen Festbetrag von etwa zehn Euro erhältlich ist, beinhaltet zusätzliche Eigenschaften und Funktionen wie z.B. verbesserte Klangqualität, Zugang über eine Applikation für mobile Endgeräte inkl. Offlineverfügbarkeit und Werbefreiheit. Zu den bekanntesten Anbietern zählen Spotify, Simfy, Deezer, MOG, Rdio, Music Unlimited, Rhapsody, rara und JUKE. Dieses Buch fasst drei unabhängige quantitativ-empirische Untersuchungen zusammen, welche die Kernelemente des Geschäftsmodells MaaS analysieren.\"},{\"title\":\"Pricing of Content Services – An Empirical Investigation of Music as a Service\",\"subtitle\":\"Proceedings of the 16th Americas Conference on Information Systems (AMCIS 2010), Lima, Peru\",\"date\":\"2010\",\"description\":\"In the last years new concepts of digital music distribution have been developed. One of them is Music as a Service, which provides music streaming over the internet as a service - without transferring ownership for the content. This differentiates Music as a Service from Download to Own, which is used by music download platforms predominantly and is the most widely studied concept in academic research. The aim of this paper is to receive first research implications about customers’ attitudes towards MaaS.Based on an empirical survey of 132 Music as a Service users, this research explores the effects of product configurations on consumers’ utility and their willingness to pay (WTP) for premium offers. We can show that next to price, contract duration and music quality as the most important product attributes, there is a high WTP for overcoming insufficient mobile internet coverage.\"},{\"title\":\"Will abandoning DRM have a boomerang effect on Apple? - An empirical analysis of lock-in and network effects\",\"subtitle\":\"Proceedings of the 42th Hawaii International Conference on System Sciences (HICSS 2009), Hawaii, 2009\",\"date\":\"2009\",\"description\":\"Is Digital Rights Management in online music platforms already doomed to die out? Having decided to gradually abandon the copy protection of online music sold on iTunes, Apple strives to return more degrees of freedom to customers. But what seems to be promising at first sight, may entail major drawbacks for Apple’s predominant tandem between iTunes and iPod. What will be the response of existing and potentially new customers, once the DRM link between these two Componentswill be abolished? Drawing on lock-in and network effect theory, the paper at hand analyzes the implications of removing DRM on customer adoption behavior. Based on an empirical survey of 432 iTunes users and non-users, several hypotheses on potential response behaviors were tested. One crucial finding of this study is that Apple may have to make up for a potential negative boomerang effect when existing clients migrate to alternative sources and providers of online music.\"}]",
    "patents": null,
    "projects": null,
    "organizations": null,
    "location": null,
    "linkedin_id": "dr-jonathan-doerr-60b0a334",
    "activity": null,
    "linkedin_num_id": 119652779.0,
    "honors_and_awards": null,
    "input": {
        "url": ""
    }
}