{
    "id": "edo-segal",
    "name": "Edo Segal",
    "city": "Tel Aviv District, Israel",
    "country_code": "IL",
    "position": "Founder and CEO at Touchcast",
    "about": "With over 20 years of experience at the forefront of Artificial Intelligence and Communications Technologies, Edo Segal leads Touchcast in the pursuit of the future of of the \"Generative Web\". A reboot of the legacy static web. With a full stack, native, Generative Web stack. Touchast offers customers a turnkey, cost-effective, lightning-fast, accurate  and safe path for generating (Genything), publishing (Ciscape - gCMS), caching and distributing (Cogcache - cCDN)  conversational, multimodal generative web experiences.",
    "posts": null,
    "groups": null,
    "current_company": {
        "link": "",
        "name": "TouchCast",
        "company_id": "touchcast",
        "title": "Founder and CEO at Touchcast"
    },
    "experience": [
        {
            "title": "Founder and CEO",
            "location": "Greater New York City Area",
            "description_html": null,
            "duration": "Jan 2012 - Present 13 years",
            "start_date": "Jan 2012",
            "end_date": "Present",
            "duration_short": "13 years",
            "company": "TouchCast",
            "company_id": "touchcast",
            "url": "",
            "company_logo_url": ""
        },
        {
            "title": "CEO",
            "location": "New York",
            "description_html": null,
            "duration": "2008 - Present 16 years",
            "start_date": "2008",
            "end_date": "Present",
            "duration_short": "16 years",
            "company": "bMuse",
            "company_id": "bmuse",
            "url": "",
            "company_logo_url": ""
        },
        {
            "title": "Founder",
            "description_html": null,
            "duration": "2011 - Present 13 years",
            "start_date": "2011",
            "end_date": "Present",
            "duration_short": "13 years",
            "company": "Kinsa",
            "company_id": "kinsa",
            "url": "",
            "company_logo_url": ""
        }
    ],
    "people_also_viewed": [
        {
            "profile_link": "",
            "name": "Dylan Beynon",
            "about": null,
            "location": "Austin, TX"
        },
        {
            "profile_link": "",
            "name": "Sunil Modi",
            "about": null,
            "location": "Irvine, CA"
        },
        {
            "profile_link": "",
            "name": "Mudit Garg",
            "about": null,
            "location": "Mountain View, CA"
        },
        {
            "profile_link": "",
            "name": "Angelina Jao",
            "about": null,
            "location": "Washington, DC"
        },
        {
            "profile_link": "",
            "name": "Brad Fowler",
            "about": null,
            "location": "Altamonte Springs, FL"
        },
        {
            "profile_link": "",
            "name": "Paul Francis",
            "about": null,
            "location": "Kansas City, MO"
        },
        {
            "profile_link": "",
            "name": "Mark McCool",
            "about": null,
            "location": "North Port-Sarasota Area"
        },
        {
            "profile_link": "",
            "name": "Inder Singh",
            "about": null,
            "location": "Oakland, CA"
        },
        {
            "profile_link": "",
            "name": "Ting Shih",
            "about": null,
            "location": "Rockville, MD"
        },
        {
            "profile_link": "",
            "name": "Adam Grossman",
            "about": null,
            "location": "Los Angeles, CA"
        },
        {
            "profile_link": "",
            "name": "Royan Kamyar, M.D., MBA",
            "about": null,
            "location": "Encinitas, CA"
        },
        {
            "profile_link": "",
            "name": "Michael Dermer",
            "about": null,
            "location": "New York, NY"
        },
        {
            "profile_link": "",
            "name": "Autumn O'Bryan",
            "about": null,
            "location": "Greater Boston"
        },
        {
            "profile_link": "",
            "name": "Jim Kimzey",
            "about": "Dementia Care Professional",
            "location": "San Francisco, CA"
        },
        {
            "profile_link": "",
            "name": "Michael Pandelakis",
            "about": "Founder & CEO at BloodHub",
            "location": "Phoenix, AZ"
        },
        {
            "profile_link": "",
            "name": "David Osterweil",
            "about": null,
            "location": "Tampa, FL"
        },
        {
            "profile_link": "",
            "name": "Ray Doustdar",
            "about": "Founder BUICED Liquid Vitamins | HOST Deep Shallow Dive Podcast.",
            "location": "Laguna Niguel, CA"
        },
        {
            "profile_link": "",
            "name": "Patrick Hitchins",
            "about": null,
            "location": "Austin, Texas Metropolitan Area"
        },
        {
            "profile_link": "",
            "name": "Oliver Kharraz, MD",
            "about": null,
            "location": "New York, NY"
        },
        {
            "profile_link": "",
            "name": "Jesse Lopez",
            "about": null,
            "location": "Greater Chicago Area"
        }
    ],
    "educations_details": null,
    "education": null,
    "recommendations_count": 1.0,
    "courses": null,
    "languages": null,
    "certifications": null,
    "recommendations": [
        "Sharon Fridman “The dictionary definition of entrepreneur. An evangelist of the highest technology serving human basic needs to communicate, share, connect and belong. A creative multi disciplinary thinker and executer. A person.”"
    ],
    "volunteer_experience": null,
    "followers": 9516.0,
    "connections": 500.0,
    "current_company_company_id": "touchcast",
    "current_company_name": "TouchCast",
    "publications": null,
    "patents": "[{\"title\":\"System and Method for Interactive Video Conferencing\",\"date_issued\":\"October 10, 2017\",\"patents_id\":\"US US 9,787,945\",\"description\":\"A networked communication session is defined vis-à-vis parameter information received from a first device, and access to the networked communication session is provided to the first device. Access to the networked communication session is further provided to each of additional device(s) in accordance with information associated with each of the additional device(s). A composited interactive audio/video feed is generated and transmitted that comprises audio/video input received during the networked communication session from each of the devices. Each of the devices is configured via a gesture-based user interface to enable user-based selection and respective manipulation of at least a portion of the composited audio/video feed that results in a customized representation of the composited audio-video feed at a particular one device that is not represented at a particular other of the device(s).\"},{\"title\":\"System and Method for Providing and Interacting with Coordinated Presentations\",\"date_issued\":\"May 30, 2017\",\"patents_id\":\"US US 9,666,231\",\"description\":\"A system and method for generating a coordinated presentation. Content selected by a user is curated for inclusion in the coordinated presentation, and images are captured for inclusion in the coordinated presentation. A first data stream associated with the curated content and a second data stream associated with the captured images are received, and a first arrangement of content associated with at least some of the first and second data streams are output. Respective content associated the two data streams are integrated to generate the coordinated presentation.\"},{\"title\":\"System and Method for Providing and Interacting with Coordinated Presentations\",\"date_issued\":\"May 23, 2017\",\"patents_id\":\"US US 9,661,256\",\"description\":\"A system and method for providing uninterrupted video content in a portion of a display while simultaneously providing other content. A coordinated presentation is provided that comprises a content unit and controllable display units. The content unit plays video content, a first controllable display unit plays first interactive video content and a second controllable display unit plays second interactive video content. The representation of the coordinated presentation is provided in a third controllable display unit without interrupting the playing of the video content.\"},{\"title\":\"Temperature Measurement System and Method\",\"date_issued\":\"March 14, 2017\",\"patents_id\":\"US US 9,593,985\",\"description\":\"In one or more implementations, a temperature measuring system is provided, including a temperature sensing probe having (a) a thermistor operatively connected to a first conductor and (b) a resistor operatively connected to a second conductor, and a temperature determination application stored in a memory of a computing device operatively connected to the temperature sensing probe. When executed by a processor of the computing device, the temperature determination application configures the computing device to: transmit a first instance of a signal to the first conductor, receive a temperature signal from the thermistor, the temperature signal corresponding to the first instance of the signal as output from the thermistor, transmit a second instance of the signal to the second conductor, receive a reference signal from the resistor, the reference signal corresponding to the second instance of the signal as output from the resistor, process the temperature signal and the reference signal to determine a relationship between the temperature signal and the reference signal, and compute a temperature based on the relationship.\"},{\"title\":\"System and Method for Providing and Interacting with Coordinated Presentations\",\"date_issued\":\"June 7, 2016\",\"patents_id\":\"US US 9,363,448\",\"description\":\"A system and method to generate coordinated presentations that includes a module to curate content selected by a user for inclusion in the coordinated presentation; an audio/visual input module to capture via camera images for inclusion in the coordinated presentation; a display module to display the presentation via a computing device.\"},{\"title\":\"Thermometer Probe\",\"date_issued\":\"November 24, 2015\",\"patents_id\":\"US US D743,817\"},{\"title\":\"System and Method for Generating and Transmitting Interactive Coordinated Presentations\",\"date_issued\":\"May 19, 2015\",\"patents_id\":\"US US 9,036,043\",\"description\":\"A teleprompter system and method including use of a touch-screen interface positioned intermediate to the user and a camera such that the camera captures the user's image through a transparency of the touch-screen interface. The touchscreen interface is coupled to a computer and is operably connected so as to enable user control and manipulation of interactive media content generated by the computer. A video mixing component integrates images captured by the camera with interactive media content generated by the computer, as may be manipulated by the user via the touch-screen interface, to generate a coordinated presentation.\"},{\"title\":\"System and Method for Interactive Mobile Gaming\",\"date_issued\":\"March 31, 2015\",\"patents_id\":\"US US 8,991,691\",\"description\":\"A method and apparatus for providing information to a camera associated with a computing device. The apparatus includes a base portion with an interior region that provides an illuminable surface. A machine-readable code is included that is supported by the surface, and a lens is disposed between the code and the bottom side of the base portion. The base is configured to seat the lens over the camera associated with the computing device in a first orientation and a second orientation. The machine-readable code presents, for reading by the computing device, first information in response to the lens being seated over the camera in the first orientation and second information in response to the lens being seated over the camera in the second orientation, respectively.\"},{\"title\":\"Temperature Measurement System and Method\",\"date_issued\":\"March 10, 2015\",\"patents_id\":\"US US 8,974,115\",\"description\":\"A temperature measuring system that includes a temperature-sensing probe having (a) a thermistor operatively connected to a first conductor and (b) a resistor operatively connected to a second conductor, and a temperature determination application stored on the mobile device connected to the temperature sensing probe.\"},{\"title\":\"System and Method for Interactive Mobile Gaming\",\"date_issued\":\"February 17, 2015\",\"patents_id\":\"US US 8,955,750\",\"description\":\"A method and apparatus for providing isolated actuations in a plurality of animated points of an object. A base portion and an object portion are provided with an apparatus, and a plurality of light-receiving elements are configured with the base portion that are operable to detect light emanating from pixels that flash on a computing device display screen. Actuators are provided with the base portion and each is configured to independently actuate in response to the light detected by the light-receiving elements. A plurality of passive mechanical components is provided with the object portion. The mechanical portions are operatively coupled to respective ones of the plurality of actuators, wherein independent movement of respective parts of the object portion is provided by the respective actuators in response to the light detected by the computing device.\"},{\"title\":\"System and Method for Single-User Control of Multiple Roles within a Music Simulation\",\"date_issued\":\"September 9, 2014\",\"patents_id\":\"US US 8,829,323\",\"description\":\"A system and method for enhancing interaction with a music simulation program. A controller interacts with the program in conjunction with a motion sensor to enable selection from among various operating modes, each representing a musical instrument or role.\"},{\"title\":\"System and Method for Interactive Mobile Gaming\",\"date_issued\":\"July 22, 2014\",\"patents_id\":\"US US 8,783,557\",\"description\":\"Disclosed is a method and apparatus for providing information to a camera associated with a computing device. The base portion of the gaming apparatus is configured with light-receiving elements that detect light emanating from pixels that flash on a device’s display screen.\"},{\"title\":\"Analog-Signal Controller for Mobile Electronic Devices\",\"date_issued\":\"March 18, 2014\",\"patents_id\":\"US US 8,672,756\",\"description\":\"A system and method for interfacing with a mobile device. One or more unique tones/signals are generated at a respective peripheral device corresponding to an event detected by that device.\"},{\"title\":\"Teleprompting System and Method\",\"date_issued\":\"August 13, 2013\",\"patents_id\":\"US US 8,508,614\",\"description\":\"A teleprompter system and method including use of a touchscreen interface positioned intermediate to the user and a camera that captures the user's image through a transparency of the touchscreen interface. The touchscreen interface is coupled to a computer and is operably connected so as to enable user control and manipulation of interactive media content generated by the computer. A video mixing component integrates images captured by the camera with interactive media content generated by the computer that the user can then manipulate to generate a coordinated presentation.\"},{\"title\":\"System and Method for Real-Time Alerts\",\"date_issued\":\"September 28, 2004\",\"patents_id\":\"US US 7,191,223\",\"description\":\"A system and method for receiving information streams, analyzing those streams, and generating an alert. The system provides alerts based on information sourced during a predetermined period of time.\"},{\"title\":\"Media Monitor System\",\"date_issued\":\"September 28, 2004\",\"patents_id\":\"US US 8,893,232\",\"description\":\"A media monitoring system that allows a monitoring device to control the media content that can be downloaded by a monitored device. The monitoring device reviews requests for media content from the monitored device and makes a decision whether to allow the monitored device access to the media content. Authorization may occur interactively or automatically using media settings associated with the monitored device. The monitored device is prevented from accessing media content until the media content is authorized. The media monitoring system may operate in a wired and/or wireless network.\"},{\"title\":\"Temperature measurement system and method\",\"date_issued\":\"April 26, 2013\",\"patents_id\":\"US US20130315276\"}]",
    "projects": null,
    "organizations": null,
    "location": "Tel Aviv District",
    "linkedin_id": "edo-segal",
    "activity": [
        {
            "interaction": "Liked by Edo Segal",
            "link": "",
            "title": "🌟 What a journey! 🌟 Over the last 3 months, we’ve witnessed 12 exceptional startups transform their visions into reality at the GrowthX…",
            "img": "",
            "id": "7274407971038593025"
        },
        {
            "interaction": "Liked by Edo Segal",
            "link": "",
            "title": "Maybe you shouldn't play favorites with features, but Copilot Vision is an update I've been excited about since day one. It's the first AI experience…",
            "img": "",
            "id": "7270482761298186245"
        },
        {
            "interaction": "Liked by Edo Segal",
            "link": "",
            "title": "Success is not defined by results achieved at a specific point in time but by is a continuous journey where it is fundamental not to get distracted…",
            "img": "",
            "id": "7275508146649919490"
        },
        {
            "interaction": "Liked by Edo Segal",
            "link": "",
            "title": "I cannot wait to see what is possible with this amazing cohort of UK AI builders.",
            "img": "",
            "id": "12"
        },
        {
            "interaction": "Liked by Edo Segal",
            "link": "",
            "title": "🎄✡️ The team at Impact Partners wishes you a joyful holiday season filled with love, laughter, and success! ❄️🎁 As we reflect on an incredible…",
            "img": "",
            "id": "7275193938729218048"
        },
        {
            "interaction": "Liked by Edo Segal",
            "link": "",
            "title": "The pace of AI innovation this past year has been truly remarkable. But looking back, what stands out most is the incredible speed at which this…",
            "img": "",
            "id": "7274843267580477441"
        },
        {
            "interaction": "Liked by Edo Segal",
            "link": "",
            "title": "🎙️✨ Impact Partners is pleased to share the latest episode of the AI and Healthcare podcast featuring our client Mika Newton, CEO of xCures. 💼🔬…",
            "img": "",
            "id": "7274809427545714688"
        },
        {
            "interaction": "Liked by Edo Segal",
            "link": "",
            "title": "Every day I see a UK apprentice doing something amazing for one of our customers, and it just reaffirms my passionate belief in the power of…",
            "img": "",
            "id": "7275491394771648514"
        },
        {
            "interaction": "Liked by Edo Segal",
            "link": "",
            "title": "Today at the Microsoft CFO Connect event, I had the pleasure of sharing how Microsoft empowers the startup dynamic businesses with cutting-edge AI…",
            "img": "",
            "id": "7275200850359181312"
        },
        {
            "interaction": "Liked by Edo Segal",
            "link": "",
            "title": "Great points here—founders absolutely need to be aware of every term they agree to, and that applies to any business relationship. While there may…",
            "img": "",
            "id": "7275535344014413824"
        },
        {
            "interaction": "Liked by Edo Segal",
            "link": "",
            "title": "20 years since I joined HSBC. How time flies! I joined Markets, moved into Global Research, lived in Hong Kong and managed our Asia business, then…",
            "img": "",
            "id": "7275423373076099072"
        },
        {
            "interaction": "Liked by Edo Segal",
            "link": "",
            "title": "Women in AI She mapped the world and changed technology forever, but her name remained unknown for decades. Ready to uncover her story? 🌍 What’s…",
            "img": "",
            "id": "7275542843048284160"
        },
        {
            "interaction": "Liked by Edo Segal",
            "link": "",
            "title": "Gotta love what Jensen and Nvidia have been cooking: the Jetson Orin Nano Super, a compact AI computer capable of 70 trillion operations per second…",
            "img": "",
            "id": "7275061037085687808"
        },
        {
            "interaction": "Liked by Edo Segal",
            "link": "",
            "title": "GitHub Copilot Free for VS Code has arrived. Sign up today: ",
            "img": "",
            "id": "7275211018723540993"
        },
        {
            "interaction": "Liked by Edo Segal",
            "link": "",
            "title": "Read about my amazing summer experience as one of 10 high school students interning at Naval Undersea Warfare Center Division, Keyport, through the…",
            "img": "",
            "id": "7274753243447021570"
        },
        {
            "interaction": "Liked by Edo Segal",
            "link": "",
            "title": "This week is one of my favorites from a nerdy data photo/video perspective as Lensrentals posts its annual list of the most popular photo and video…",
            "img": "",
            "id": "7273001678763659265"
        },
        {
            "interaction": "Liked by Edo Segal",
            "link": "",
            "title": "Generative AI is getting better and better. This weekend, using the prompt 'A vintage snow globe with the Eiffel Tower on a white background,' it…",
            "img": "",
            "id": "7274415888315867137"
        }
    ],
    "linkedin_num_id": 157944.0,
    "honors_and_awards": [
        {
            "title": "Edison Award - Media and Visual Communications",
            "publication": "The Edison Awards",
            "date": "2016-04-01T00:00:00.000Z",
            "description": "TouchCast won this award for it's next generation video communication platform"
        },
        {
            "title": "Webby Award - Lifestyle (Handheld Devices)",
            "publication": "The International Academy of Digital Arts and Sciences",
            "date": "2015-01-01T00:00:00.000Z",
            "description": null
        },
        {
            "title": "Webby Award - Best Use of Mobile Video",
            "publication": "The International Academy of Digital Arts and Sciences",
            "date": "2014-01-01T00:00:00.000Z",
            "description": null
        },
        {
            "title": "Webby Award - Lifestyle (Handheld Devices)",
            "publication": "The International Academy of Digital Arts and Sciences",
            "date": "2014-01-01T00:00:00.000Z",
            "description": null
        },
        {
            "title": "Hasbro Inventor of the Year Award",
            "publication": "Hasbro",
            "date": "2013-09-01T00:00:00.000Z",
            "description": "Won Hasbro's Inventor of the Year Award for Telepods. A connected toy who made the most money out of any other third party inventor submission that year. Telepods sold over $50M and at the time was the top selling mobile connected toy of all time. "
        }
    ],
    "input": {
        "url": ""
    }
}