{
    "id": "nupur-relekar",
    "name": "Nupur Relekar",
    "city": "Dubai, United Arab Emirates",
    "country_code": "AE",
    "position": null,
    "about": "Having spent over 12 years as a Creative Director, I bring a unique blend of creativity…",
    "posts": null,
    "groups": null,
    "current_company": {
        "name": "6thStreet.com",
        "company_id": "6thstreet-com"
    },
    "experience": null,
    "people_also_viewed": [
        {
            "name": "Devendra Singh",
            "about": null,
            "location": "Mumbai"
        },
        {
            "name": "Reshma Rajiwdekar",
            "about": "Creative Director at House of Anita Dongre Limited",
            "location": "Mumbai"
        },
        {
            "name": "Arpan Chakraborty",
            "about": "Creative Eye | Design Specialist | Illustrator | Artist | Brand Development | Painter",
            "location": "Kolkata"
        },
        {
            "name": "Hitesh Hariya",
            "about": "Creative Director at OktoBuzz",
            "location": "Mumbai"
        },
        {
            "name": "Sourabh Ahuja",
            "about": "creative",
            "location": "Delhi, India"
        },
        {
            "name": "Niharika Ghosh",
            "about": "Creative Director at Boundless I Optimising Brand Communication, Identity Design and Branding Systems.",
            "location": "Bengaluru"
        },
        {
            "name": "Kiran Kale",
            "about": "Associate Design Manager @ Nykaa | Creative Art Direction, Branding",
            "location": "Thane"
        },
        {
            "name": "Rajeev VeePee",
            "about": "Creative Designer",
            "location": "Pune"
        },
        {
            "name": "Vrinda Goyal",
            "about": "Make your brand stand out: Crafting creative solutions to take your brand to the next level | 20+ years of experience in advertising and branding | Founder and Creative Director at Kosh Communications",
            "location": "Bengaluru"
        },
        {
            "name": "Sudeb Bhattacharjee",
            "about": "Associate Creative Director at BetheBee Ex Azure || Ex Decalogue || Ex Addon",
            "location": "Kolkata"
        }
    ],
    "educations_details": "Sir JJ Institute of Applied Arts",
    "education": [
        {
            "title": "Sir JJ Institute of Applied Arts",
            "start_year": "2005",
            "end_year": "2009",
            "description": null,
            "description_html": null,
            "institute_logo_url": null
        }
    ],
    "recommendations_count": 3.0,
    "courses": null,
    "languages": null,
    "certifications": null,
    "recommendations": [
        "“Nupur is a total creative rockstar! I've seen her take ideas and spin them into absolute gold. As the leader of the creative, content, and studio teams, she always pushed everyone to do more, be bold, and most importantly, have fun with their work. She's an absolute team player who’s always in the trenches, constantly experimenting, and coming up with brilliant stuff. Under her watch, our brand soared to new heights. She reshaped the look of our site and redefined our social media campaigns, infusing fresh energy and appeal into our brand. A testament to her creative prowess and leadership was the time she conceptualized a Mother's Day campaign on TikTok. The campaign generated a whopping 4.3 billion views, created a major PR buzz, and was recognized as the 'Best Viral Marketing Campaign' at the Masters of Modern Marketing Awards 2019. But what makes Nupur stand out is not just her creativity. She's also one of those rare creative minds that understands business. She doesn't create for creativity's sake but uses her skills to solve business problems and add tangible value. Since our time at Hopscotch, Nupur's been my first port of call for anything creative. She's got this knack for turning even the most complicated concepts into awesome creations. As the Creative Head, Nupur displayed an extraordinary blend of imagination, leadership, and dedication. Any team would be super lucky to have her. She's a creative powerhouse, an inspiring leader, and just an all-around great person to work with.” Show less",
        "“It is with great pleasure that I write this LinkedIn recommendation. I had the privilege of working closely with Nupur at our company, Hopscotch, and I was consistently impressed by her exceptional talent and unwavering dedication. Nupur exudes humility. This has undoubtedly shaped her work ethic and determination. Her journey from JJ School or Art to where she has reached today showcases her relentless pursuit of excellence and personal growth. This background has instilled in her a unique perspective, allowing her to approach projects with a refreshing creativity and ingenuity. One of Nupur's standout qualities is her fabulous sense of taste in design. Whether it's creating visually stunning creatives or designing captivating user interfaces for our storefront, she has an innate ability to strike the perfect balance between aesthetics and functionality. Her work has been instrumental in transforming Hopscotch's brand, making us highly aspirational and leaving a lasting impression on consumers across India. Moreover, Nupur possesses an incredible startup DNA that sets her apart. She thrives in fast-paced environments and demonstrates an exceptional ability to wear multiple hats. Her versatility allows her to seamlessly transition between various design projects and adapt to new situations with ease. She embraces challenges head-on, diving into unfamiliar territories and consistently delivering outstanding results. Throughout her time at Hopscotch, we threw one big challenge at Nupur after the other. I had the privilege of witnessing Nupur's unwavering focus and determination. Her commitment to excellence and meticulous attention to detail ensure that every project she undertakes is executed to perfection. She consistently goes above and beyond, exceeding expectations and consistently delivering exceptional work. In summary, I wholeheartedly recommend Nupur for any Creative design role. Her unique background, fabulous sense of taste, and startup DNA make her an invaluable asset to any team. She is a true professional who consistently exceeds expectations and brings a fresh perspective to every project. Please feel free to reach out to me if you would like to discuss Nupur's qualifications further. I have no doubt that she will continue to thrive and make a significant impact wherever she goes.” Show less"
    ],
    "volunteer_experience": null,
    "followers": 833.0,
    "connections": 500.0,
    "current_company_company_id": "6thstreet-com",
    "current_company_name": "6thStreet.com",
    "publications": null,
    "patents": null,
    "projects": null,
    "organizations": null,
    "location": "Dubai",
    "linkedin_id": "nupur-relekar",
    "activity": [
        {
            "interaction": "Liked by Nupur Relekar",
            "title": "Winter is here in the UAE, and so is…",
            "id": "7274417155847192576"
        },
        {
            "interaction": "Liked by Nupur Relekar",
            "title": "100 Crocs stores and counting!…",
            "id": "7257634556898398208"
        },
        {
            "interaction": "Liked by Nupur Relekar",
            "title": "🤘 We did it again 🤘 Johannes von…",
            "id": "7255266466403438592"
        },
        {
            "interaction": "Liked by Nupur Relekar",
            "title": "Always a pleasure to meet & discuss…",
            "id": "7256725642946199552"
        }
    ],
    "linkedin_num_id": 477951303.0,
    "honors_and_awards": null
}