{
    "id": "rupamiics",
    "name": "Rupam Das",
    "city": "Bengaluru, Karnataka, India",
    "country_code": "IN",
    "position": null,
    "about": "Wiser than yesterday, inexperienced than tomorrow, learning, teaching, creating, and…",
    "posts": [
        {
            "title": "POST III:- Whom To Reach Out for What (Acculi Labs Pvt Ltd ecosystem) 1. jatinder singh mann is heading the investment and Business development. i)…",
            "attribution": "Posted by Rupam Das",
            "img": "",
            "link": "",
            "interaction": "Posted by Rupam Das",
            "id": "2LF9"
        },
        {
            "title": "POST II: Acculi Labs PAIO Exit and Delay A. Announced Deadline Acculi Lab's exit to PAIO-I investor's exit was promised to be completed by October…",
            "attribution": "Posted by Rupam Das",
            "img": "",
            "link": "",
            "interaction": "Posted by Rupam Das",
            "id": "2tRX"
        }
    ],
    "groups": null,
    "current_company": {
        "name": "Acculi Labs Pvt. Ltd."
    },
    "experience": null,
    "people_also_viewed": [
        {
            "profile_link": "",
            "name": "Saurav Kumar",
            "about": null,
            "location": "Delhi, India"
        },
        {
            "profile_link": "",
            "name": "Kumar Sharma",
            "about": "Founder and CEO at Pavo Technologies Private Limited",
            "location": "Kolkata"
        },
        {
            "profile_link": "",
            "name": "Krishna Kiran Kasturi",
            "about": null,
            "location": "Andhra Pradesh, India"
        },
        {
            "profile_link": "",
            "name": "Ankur Jain",
            "about": null,
            "location": "Delhi, India"
        },
        {
            "profile_link": "",
            "name": "Kumar Shubham Narayan",
            "about": null,
            "location": "Delhi, India"
        },
        {
            "profile_link": "",
            "name": "Advitiya Sharma",
            "about": null,
            "location": "Mumbai"
        },
        {
            "profile_link": "",
            "name": "Bipin Preet Singh",
            "about": null,
            "location": "Gurgaon"
        },
        {
            "profile_link": "",
            "name": "Amit K Mehandiyan",
            "about": "Founder\\CEO @Zerohomz\\HomzOk, TAPS Fintech,10M+ Impressions, Entrepreneur, Investor, Real Estate Services, Real Estate Consultant, Social Media Lead Generation, Credit Distribution Microfinance",
            "location": "Noida"
        },
        {
            "profile_link": "",
            "name": "Vishwadeep Khatri",
            "about": null,
            "location": "South Delhi"
        },
        {
            "profile_link": "",
            "name": "Malika Datt Sadani",
            "about": null,
            "location": "Gurugram"
        },
        {
            "profile_link": "",
            "name": "Rajeev Shukla",
            "about": null,
            "location": "Hyderabad"
        },
        {
            "profile_link": "",
            "name": "Bharat Sethi",
            "about": null,
            "location": "Delhi, India"
        },
        {
            "profile_link": "",
            "name": "Shradha Sharma",
            "about": "Founder & CEO at YourStory Media",
            "location": "India"
        },
        {
            "profile_link": "",
            "name": "Vikrant Khanna",
            "about": null,
            "location": "South Delhi"
        },
        {
            "profile_link": "",
            "name": "Sunitha Bharadwaj",
            "about": null,
            "location": "Bengaluru"
        },
        {
            "profile_link": "",
            "name": "Rahul Joshi",
            "about": "Founder and CEO Sampark Career Developers",
            "location": "West Delhi"
        },
        {
            "profile_link": "",
            "name": "Deepak Garg",
            "about": null,
            "location": "Gurugram"
        },
        {
            "profile_link": "",
            "name": "Samar Singla",
            "about": null,
            "location": "Dubai, United Arab Emirates"
        },
        {
            "profile_link": "",
            "name": "Sukanta Sen",
            "about": "Founder and CEO at \"Holidays Unlimited....Your Complete Travel Solution\"",
            "location": "Greater Kolkata Area"
        },
        {
            "profile_link": "",
            "name": "Deepak Chowdhary",
            "about": null,
            "location": "Dubai, United Arab Emirates"
        }
    ],
    "educations_details": "VTU Belgaum",
    "education": [
        {
            "title": "VTU Belgaum",
            "start_year": "2013",
            "end_year": "2016",
            "description": null,
            "description_html": null,
            "institute_logo_url": null
        },
        {
            "title": ",",
            "start_year": "2008",
            "end_year": "2011",
            "description": null,
            "description_html": null,
            "institute_logo_url": null
        },
        {
            "start_year": "1998",
            "end_year": "2002",
            "description": null,
            "description_html": null,
            "institute_logo_url": null
        },
        {
            "title": ". .",
            "start_year": "1996",
            "end_year": "1998",
            "description": null,
            "description_html": null,
            "institute_logo_url": null
        },
        {
            "title": ". .  ,",
            "start_year": "1984",
            "end_year": "1996",
            "description": null,
            "description_html": null,
            "institute_logo_url": null
        }
    ],
    "recommendations_count": null,
    "courses": null,
    "languages": [
        {
            "subtitle": " Professional working proficiency ",
            "title": " English "
        },
        {
            "subtitle": "-",
            "title": " Bengali "
        },
        {
            "subtitle": "-",
            "title": " Hindi "
        },
        {
            "subtitle": "-",
            "title": " Kannada "
        }
    ],
    "certifications": null,
    "recommendations": null,
    "volunteer_experience": null,
    "followers": 18457.0,
    "connections": 500.0,
    "current_company_company_id": null,
    "current_company_name": "Acculi Labs Pvt. Ltd.",
    "publications": "[{\"title\":\"Intimacy Laws for Men, Volume 1, The Birth of the Lugal\",\"subtitle\":\"Acculi Labs Pvt. Ltd.\",\"date\":\"September 26, 2022\",\"description\":\"Intimacy laws for men help men to learn the dynamics of life, spirituality, relationship, sexuality, femininity, ancestry, biology, economy, history, animal ethology, and philosophy to become intimate with themselves and transform all the relationships in life into an intimate relationship. The book enables men to take back the control of their life in an environment that is obsessed with emasculation.\"},{\"title\":\"A Novel Framework for Prediction and Detection of Myocardial Ischemia with Single Lead ECG and PAT\",\"subtitle\":\"IEEE\",\"date\":\"August 1, 2018\",\"description\":\"Myocardial Ischemia (Heart attack) is the major disease, most of the population country like India is suffering from Cardiac problems. Several past studies have been conducted in the area of early detection of myocardial ischemia based on 12 lead ECG or Pulse Wave Velocity. However, past studies fail to take into consideration of the “cardio stress” due to endothelium dysfunction. In the proposed work, an extremely low cost device is developed for detection of early stage Myocardial Ischemia and atherosclerosis through endothelium dysfunction and arterial stiffness analysis by using Cardio Neuro Coherence, Electrophysiology and cardio vascular blood flow analysis. The Heart Rate Variability and Pulse Arrival Time are combined using a single lead ECG and simultaneous capture of arterial pulse. The test procedure is carried out on 75 subjects consisting of male(80%) and female(20%) with 39 existing MI cases, 24 long term diabetic with high MI probability and other normal subjects. This system could detect all the MI cases with 100% accuracy, including 7 cases where the subjects had hypertension with MI. Out of 24 high risk individuals our system mis-detected two cases with MI, where the ST segment was little depressed but not enough to be categorized as NSTEMI. The system had no mis-detection for normal subjects. This shows that proposed system can be a unique model that can be used for long term MI monitoring and risk predictability.\"},{\"title\":\"GeroSim: A simulation framework for gesture driven robotic arm control using Intel RealSense\",\"subtitle\":\"IEEE\",\"date\":\"July 1, 2016\",\"description\":\"Intel RealSense™ is an exciting new technology from Intel that offers a more immersive and intuitive human-computer interaction (HCI) with hand and head tracking and gesture recognition. Robotics has been an ever evolving area of research and development. Robotics has been extensively used in automation. Several past works have been focused towards developing robots that can respond to human voice, gesture in a more natural ways. However, a simulation framework has never been proposed for gesture driven robotic control. Realistic simulation of robotic arm that can mimic the actual actions of a robot and respond to exactly the same way is essential in designing several applications including automation. This paper provides a unique framework for robotic arm simulation for gesture driven control called GeroSim (Gesture-Robotics-Simulator). The simulation engine is logically bind with internet of things (IoT) to enable remote controlling. Any control mechanism can be added as a plugin to the interface to test the interface viability before adopting real hardware. Proposed work presents a unique scripting language called Geroscript that enables different modalities to control a robot seamlessly. Results shows that the engine can support multiple modalities and can be used for practical design of gesture controlled robotic systems.\"},{\"title\":\"Augmented World: Real Time Gesture Based Image Processing Tool with Intel RealSense™ Technology\",\"subtitle\":\"International Journal of Signal Processing, Image Processing and Pattern Recognition\",\"date\":\"February 2, 2016\",\"description\":\"Intel RealSense™ is an exciting new technology that offers innovative multimodalhuman computer interaction with hand tracking, face tracking, emotion detection, speechsynthesis and voice recognition. The technology supports real time backgroundseparation by combining the depth and RGB streams of RealSense™ camera. Severalpast works have provided robust techniques for background separation. Backgroundseparated frame is used to augment segmented user photo in an artificial scene. In thiswork we propose a novel real time technique for augmenting the user in an artificialscene and apply various image filters on the constructed scene. We also propose a “SplitGrid” based novel hand gesture driven UI control system that enables the user anintuitive way of working with the system with on-air hand movement and gesture. Thesystem can be used in a wide range of applications like puppetry, photo retouching, andvideo recording on augmented scene .Usability tests performed by both amateur as wellas professional digital photo artists proves ease and efficiency of the tool in generatingquick wonderful photo effect in multimodal environment.\"},{\"title\":\"A Fuzzy Logic based Human Behavioural Analysis model using Facial Feature Extraction with Perceptual Computing\",\"subtitle\":\"IJETTCS\",\"date\":\"March 2, 2014\",\"description\":\"face movements presents many aspects of human behaviour. Even though human emotion detection is is under research for long now human emotion is never seen in perspective with face landmark and face movement. Therefore no research work has looked into the broader perspective of aligning face detection, emotion detection, face landmarks, head movement to study of human characters. In the proposed work we use Intel Perceptual Computing SDK with fuzzy logic to analyze broad human behaviour and characteristics.\"},{\"title\":\"Offline Signature Verification with Random and Skilled Forgery Detection Using Polar Domain Features and Multi Stage Classification-Regression Model\",\"subtitle\":\"International Journal of Advanced Science and Technology\",\"date\":\"2013\",\"description\":\"Vol.59, (2013), pp.27-40 http://dx.doi.org/10.14257/ijast.2013.59.03 In this paper we propose an innovative approach for offline signature verification with polar feature descriptor for signature that contains Radon Transform and Zernike Moments. Verification is performed using Multiclass Support Vector Machine.\"},{\"title\":\"Opinion Polarity Detection in Blog Comments from Blog Rss Feed by Modified TF-IDF Algorithm\",\"subtitle\":\"IJERA\",\"date\":\"Jan 2012\",\"description\":\"ISSN: 2248-9622Vol. 2, Issue 1, pp. 412-416Understanding people's response in a certain topic is one of the most essential part of strategic marketing. The work proposes a real time solution to fetch and then classify the reader's sentiment as positive or negative using improved TF-IDF technique\"},{\"title\":\"A Unique Intrusion Detection System for Wireless Networks By Combining Proactive Technique with Data Mining based Intrusion Detection Systems\",\"subtitle\":\"Paper ID Number: CI-9.3 ,the ICSCI-2011\",\"date\":\"2011\",\"description\":\"The paper proposes a hybrid solution for effective intrusion detection in wireless network using both proactive as well as reactive technique.\"},{\"title\":\"Design and Simulation of MANET Architecture over ZigBee Protocol Suite with Cross Layer Energy aware design for Performance Optimization\",\"subtitle\":\"GCET\",\"date\":\"2011\",\"description\":\"The paper proposes an architecture based on MANET for sensor nodes. Sensors generally sends the data to a sink. However in certain typical communication, inter sensor full duplex data exchange is essential. MANET architecture is extended for ZigBee\"},{\"title\":\"Cross layer AODV with Position based forwarding routing for mobile adhoc network\",\"subtitle\":\"IEEE\",\"date\":\"December 20, 2009\",\"description\":\"On page(s): 1 - 6 Location: Allahabad Print ISBN: 978-1-4244-5876-9 INSPEC Accession Number: 11205405 Digital Object Identifier: 10.1109/WCSN.2009.5434796 Date of Current Version: 22 March 2010The paper leverages on GPS data mutually exchanged by MANET nodes with hello packets to find out an optimum route with least power consumption.\"},{\"title\":\"A cross layer approach for controlling jitter in MANET based on bandwidth estimation\",\"subtitle\":\"IEEE\",\"date\":\"November 24, 2009\",\"description\":\"Print ISBN: 978-1-4244-4569-1 INSPEC Accession Number: 10986088 Digital Object Identifier: 10.1109/AHICI.2009.5340274The paper proposes a unique bandwidth estimation technique for MANET that takes into account of packet collision, channel delay and jitter. The statistical feedback is used by Network layer to obtain optimum route and packet transmission.\"},{\"title\":\"Cross layer fair scheduling for MANET with 802.11 CDMA channels\",\"subtitle\":\"AH-ICI 2009. IEEE\",\"date\":\"November 24, 2009\",\"description\":\"page(s): 1 - 5 Print ISBN: 978-1-4244-4569-1 INSPEC Accession Number: 10986128 Digital Object Identifier: 10.1109/AHICI.2009.5340331 The paper proposes fair weighted scheduling for cross layer Mobile Adhoc Network. This takes into consideration of elaborated MAC 802.11 for MANET.\"},{\"title\":\"ENHANCED PACKET SCHEDULING USING CROSS LAYER DESIGN IN MANET FOR SERVICE DIFFERENTIATION\",\"subtitle\":\"NCA, Mumbai\",\"date\":\"2008\",\"description\":\"The paper offers a solution of performance enhancement in Mobile Adhoc Network by packet scheduling at MAC layer in a cross layer framework\"},{\"title\":\"Lossless Medical Image Compression Techniques And Their Performance Analysis\",\"subtitle\":\"IEEE Student Chair, UVCE\",\"date\":\"2008\",\"description\":\"The Paper focuses on analyzing medical image compression quality with JPEG, SPIHT, and Laplacian pyramid techniques\"},{\"title\":\"Offline signature verification and skilled forgery detection using HMM and sum graph features with ANN and knowledge based classifier\",\"subtitle\":\"SPIE\",\"description\":\"Proceedings Vol. 7546, Second International Conference on Digital Image Processing, Kamaruzaman Jusoff; Yi Xie, Editors, 75462GThe Paper proposes a unique offline signature verification system along with detecting forgery ( both skilled and random). Hidden Markov Model helps estimating the states in a handwriting. Hence recognition becomes size and thickness invariant.\"}]",
    "patents": null,
    "projects": "[{\"title\":\"Emometric\",\"start_date\":\"Aug 2016\",\"description\":\"Emometric helps you to track and analyze customer's emotion in real time and use that for businesses.\"},{},{\"title\":\"Rainbow\",\"start_date\":\"Nov 2015\",\"description\":\"Rainbow helps parents and teachers to teach the kid with amazing intuitive animation. It offers an amazing cognitive learning.\"},{\"title\":\"Datafly\",\"start_date\":\"Jan 2014\",\"description\":\"Datafly is an authentication and document validation app meant for Intel tablets.\"},{\"title\":\"ShadowArt Show Maker\",\"start_date\":\"2013\",\"description\":\"The App is developed with Intel Perceptual Computing. It brings a whole new level of experience to user interface by offering a complete voice driven solution to interface. The App essentially is a creative entertainment suite which can be used to make shadow art movies.\"},{\"title\":\"Perceptual ImageGrassy\",\"description\":\"Image and Photo retouch with on air gesture, voice and head tracking. An Image processing experience that you would never forget!\"}]",
    "organizations": [
        {
            "title": "Integrated Ideas",
            "membership_type": "Founder, CEO",
            "membership_number": null
        }
    ],
    "location": "Bengaluru",
    "linkedin_id": "rupamiics",
    "activity": [
        {
            "interaction": "Posted by Rupam Das",
            "link": "",
            "title": "POST III:- Whom To Reach Out for What (Acculi Labs Pvt Ltd ecosystem) 1. jatinder singh mann is heading the investment and Business development. i)…",
            "img": "",
            "id": "7277156489436246017"
        },
        {
            "interaction": "Posted by Rupam Das",
            "link": "",
            "title": "POST II: Acculi Labs PAIO Exit and Delay A. Announced Deadline Acculi Lab's exit to PAIO-I investor's exit was promised to be completed by October…",
            "img": "",
            "id": "7277145459016482817"
        },
        {
            "interaction": "Shared by Rupam Das",
            "link": "",
            "title": "PALO: Day 3: Population Economy \"Tripping Point\" A. Species Classification on Survival Strategy a) Hunting:- Lion's success rate is less than 15%…",
            "img": "",
            "id": "3"
        }
    ],
    "linkedin_num_id": 148920312.0,
    "honors_and_awards": [
        {
            "title": "Elevate 2018",
            "publication": "Startup Cell, Government of Karnataka",
            "date": "2018-09-01T00:00:00.000Z",
            "description": "Elevate selects some selected groups of startups through a thorough multi-round process and fund them with a grant to help the startups to reach to next level."
        },
        {
            "title": "ICICI Appathon Winner 2017",
            "publication": "ICICI",
            "date": "2017-05-01T00:00:00.000Z",
            "description": "ICICI Appathon invites innovative mobile solutions in fintech sectors every year. This year we had ten finalist. Our Solution called \"Muutmi\" medical underwriting under two minutes, disruupts the current medical underwriting process by offering a scalable, mobile, IoT enabled device called Lyfas which is capable of detecting ) Blood Pressure ( HIGH, LOW, NORMAL) 2) Diabetese ( through Hypo Glycamia and Hyper Glycamia) 3) Cardio Vascular diseases such as Artrial Fibrillation… Show more"
        },
        {
            "title": "Codeproject MVP 2017",
            "publication": "codeproject.com",
            "date": "2017-01-01T00:00:00.000Z",
            "description": "Codeproject most valuable professional is given to selected sets of programmers and authors in codeproject( a leading site for devs) for their contribution for the community. I am selected codeproject MVP for 2017 among 40 others around the world."
        },
        {
            "title": "Second Runner UP, HDFC LiFe Mobility Hack",
            "publication": "HDFC Life",
            "date": "2017-01-01T00:00:00.000Z",
            "description": "We got the award for our revolutionary Insurance tech linked Health solution Hrydyalysis."
        },
        {
            "title": "Winner, Target Accelerator, Innovation Hackathon",
            "publication": "Target Accelerator, India",
            "date": "2016-12-01T00:00:00.000Z",
            "description": "We won the first prize for our app idea GranAI in Target accelerator's innovation hackathon."
        },
        {
            "title": "Winner, Best Innovative business solution, Apache Spark Contest",
            "publication": "Devpost",
            "date": "2016-10-01T00:00:00.000Z",
            "description": "We won the business solution award for Apache spark contest organized by Devpost for our app Emometric."
        },
        {
            "title": "Winner, General Health Category, Codehealthy by RedHat Linux",
            "publication": "Devpost.com, RedHat Cloud",
            "date": "2016-10-01T00:00:00.000Z",
            "description": "Won the best app for general health application in Codehealthy contest organized by Devpost on behalf of RedHat Linux Cloud. The award was given for Hrydyalysis, a cloud based ECG diagnosis system."
        },
        {
            "title": "Codeproject IoT Article Challenge 2016- Grand Prize Winner and 6 Category First Prize Winner",
            "publication": "Codeproject.com",
            "date": "2016-08-01T00:00:00.000Z",
            "description": ""
        },
        {
            "title": "Intel Software Innovator",
            "publication": "Intel",
            "date": "2015-08-01T00:00:00.000Z",
            "description": "Intel Software Innovator Program is a community driven Intel program. It is given to developers across the globe for their contribution in Intel's technologies."
        },
        {
            "title": "Intel RealSense 2015 Trailblazer",
            "publication": "Intel Corporation",
            "date": "2015-05-01T00:00:00.000Z",
            "description": "Intel RealSense App challenge was intense challenge with developers from 37 countries . The objective was to develop intuitive apps using RealSense that redefines the human computer interaction limits. I was recognized by Intel as one among 25 Trailblazers by the company. "
        },
        {
            "title": "Best Demo Apps, Intel RealSense Challenge 2014",
            "publication": "Intel",
            "date": "2015-01-01T00:00:00.000Z",
            "description": "The project demo Sands, Datafly and Pixelife wins best Demo App under early submission prizes for Intel RealSense Challenge."
        },
        {
            "title": "Winner, Internet of Thing Tutorial Contest",
            "publication": "Codeproject.com",
            "date": "2015-01-01T00:00:00.000Z",
            "description": "Internet of Things tutorial Contest was organized by Codeproject.com to allow developers to write tutorial on standards, architecture, code and best practices in connecting devices on Internet.  I won 7 out of the twenty group stage prize and the Grand prize in the contest."
        },
        {
            "title": "Top Proposal, Ambassador Track, Intel Real Sense Challenge",
            "publication": "Intel Corporation",
            "date": "2014-12-01T00:00:00.000Z",
            "description": "30 Ideas were selected out of finalist 300 ideas in Intel Real Sense Challenge 2014. My Idea Shadow Artist was one of the top selected ideas in this category. "
        },
        {
            "title": "Winner, Engineering for Change in India Project Report Contest",
            "publication": "Crazyengineers.com",
            "date": "2014-12-01T00:00:00.000Z",
            "description": "The objective was to Identify a problem existing around us in India that could have a technical solution. It could be in computer, room, society, village, city, school/college, office . Contestants needed to come up with a problem definition & its solution and present it in the required format in a project report. I won this contest for my proposal \"Datafly\"- a solution for automation of Personal verification process with face recognition and signature… Show more"
        },
        {
            "title": "Best Article under Article Beginner's Guide to Monetizing Your Android App",
            "publication": "codeproject.com",
            "date": "2014-10-01T00:00:00.000Z",
            "description": "How to build an App from ideation to publication is covered in this article.  Every detail of Android App publishing is covered here."
        },
        {
            "title": "Second Prize, Android Tutorial Contest",
            "publication": "codeproject.com",
            "date": "2014-10-01T00:00:00.000Z",
            "description": "Android Tutorial Contest had 12 topics divided into four rounds where the contestants had to publish their Android articles specifically for beginners. I managed to win overall second prize as well as three top article prizes. #xx4928082xx"
        },
        {
            "title": "Winner, Codeproject Android Article Competition, \"Database and Webservices\" Section",
            "publication": "codeproject.com",
            "date": "2014-10-01T00:00:00.000Z",
            "description": "In this tutorial SQLite, XML, Flat File, Web Service based data handling was covered in a very lucid way. "
        },
        {
            "title": "Finalist,Rekognition API App Idea Contest",
            "publication": "BuntyHunter, POP",
            "date": "2014-01-01T00:00:00.000Z",
            "description": " Datafly is an idea of mobile app using face detection that is expected to revolutionize the way customer's data is validated and maintained. This idea was selected as finalist in the contest."
        },
        {
            "title": "Two Pioneer Awards, Perceptual Computing Phase 2",
            "publication": "Intel Corporation",
            "date": "2013-12-01T00:00:00.000Z",
            "description": "I received two Pioneer awards for both my Apps Perceptual ImageGrassy ShadowArt Showmaker"
        },
        {
            "title": "Best Retail Proposal, App Innovation Contest 2013",
            "publication": "Intel, Codeproject.com",
            "date": "2013-10-01T00:00:00.000Z",
            "description": "The award is given for Datafly. "
        },
        {
            "title": "3 Second Prize, Perceptual Computing Challenge Phase I",
            "publication": "Intel Corporation",
            "date": "2013-03-01T00:00:00.000Z",
            "description": "Perceptual Computing is the new computing experience where you use voice, gesture, head tracking to provide that awesome and unique user experience. In the first phase the sdk was in beta stage and challenge was to build great apps leveraging the SDK. I ended up submitting 20 Apps in a month and was rewarded 3 second prizes for following Apps 1. GesCard: 2. Face Sec:  3. Gestroid:… Show more"
        },
        {
            "title": "2nd Prize, Ultrabook Article Competition",
            "publication": "codeproject.com",
            "date": "2013-01-01T00:00:00.000Z",
            "description": "AppInnovation contest was followed by Ultrabook Article Competition where onus was to share the learning experience and teach fellow community members about whole process of App conceptualization to publishing. "
        },
        {
            "title": "Finalist",
            "publication": "Intel App Innovation Contest 2012",
            "date": "2012-12-01T00:00:00.000Z",
            "description": "Intel came up with this outstanding ultrabook device and had to build an App for the ultrabook prototype. I designed ImageGrassy which was later published in Intel AppUp store. It did a fair business. Write up to the article can be found here. "
        },
        {
            "title": "Winner, Codeproject Android Article Competition, \"Resource management\" Section",
            "publication": "Codeproject.com",
            "date": null,
            "description": "Won the \"Resource Management\" section of 12 section Worldwide Android Tutorial Article Competition. "
        }
    ],
    "input": {
        "url": ""
    }
}