{
    "id": "sneha-sree-v",
    "name": "Sneha Sree V.",
    "city": "San Jose, California, United States",
    "country_code": "US",
    "position": "Actively seeking full time opportunities starting June 2025/ co-op opportunities | MS CS @UMass Amherst | Fractal AI | Lear Corporation | IIT Kharagpur",
    "about": null,
    "posts": null,
    "groups": null,
    "current_company": {
        "link": "",
        "name": "Docket Inc",
        "company_id": "docket-inc",
        "title": "Actively seeking full time opportunities starting June 2025/ co-op opportunities | MS CS @UMass Amherst | Fractal AI | Lear Corporation | IIT Kharagpur"
    },
    "experience": [
        {
            "title": "AI Engineer Intern",
            "description_html": null,
            "duration": "Jun 2024 Aug 2024 3 months",
            "start_date": "Jun 2024",
            "end_date": "Aug 2024",
            "duration_short": "3 months",
            "company": "Docket Inc",
            "company_id": "docket-inc",
            "url": "",
            "company_logo_url": ""
        },
        {
            "title": "Data Scientist(Imagineer)",
            "location": "Bengaluru, Karnataka, India",
            "description_html": null,
            "duration": "Jul 2021 Jul 2023 2 years 1 month",
            "start_date": "Jul 2021",
            "end_date": "Jul 2023",
            "duration_short": "2 years 1 month",
            "company": "Fractal",
            "company_id": "fractal-analytics",
            "url": "",
            "company_logo_url": ""
        },
        {
            "title": "Summer Intern",
            "location": "Pune, Maharashtra",
            "description_html": null,
            "duration": "May 2020 Aug 2020 4 months",
            "start_date": "May 2020",
            "end_date": "Aug 2020",
            "duration_short": "4 months",
            "company": "Lear Corporation",
            "company_id": "lear-corporation",
            "url": "",
            "company_logo_url": ""
        }
    ],
    "people_also_viewed": [
        {
            "profile_link": "",
            "name": "Shivam Kamat",
            "about": "Assistant Manager | Master of Engineering in Industrial Engineering Management",
            "location": "Indore"
        },
        {
            "profile_link": "",
            "name": "Ayush Agrawal",
            "about": "Asset Integrity Engineer",
            "location": "Aligarh"
        },
        {
            "profile_link": "",
            "name": "Leslie Pinto",
            "about": "Industry process consultant at Dassault Systèmes |\"Strategic Design, Seamless Automation\"",
            "location": "Bengaluru"
        },
        {
            "profile_link": "",
            "name": "sanket kasare",
            "about": "Petroleum Engineer | Looking for a job opportunity in Oil and Gas Industry",
            "location": "Mumbai"
        },
        {
            "profile_link": "",
            "name": "Harshvardhan Singh",
            "about": "Student at Indian Institute of Technology, Delhi",
            "location": "Delhi, India"
        },
        {
            "profile_link": "",
            "name": "Saran Prasanth",
            "about": "On-Site Support Engineer at Alstom| Master's in Industrial Engineering from Penn State University",
            "location": "Boston, MA"
        },
        {
            "profile_link": "",
            "name": "Syed Areeb Hasan",
            "about": "Mechanical Engineer | Quality Control & Auditing | Sustainable | Risk Management | Lean Manufacturing | Process Optimization |SOP Development | Supplier Audits | Sedex | HSE Protocols | KPIs",
            "location": "Aligarh"
        },
        {
            "profile_link": "",
            "name": "Er.Pragati Dixit",
            "about": "Graduate engineer",
            "location": "Jaipur"
        },
        {
            "profile_link": "",
            "name": "Abhishek Kulkarni",
            "about": "Water conservation | Carbon neutrality | Green thinker",
            "location": "Pune"
        },
        {
            "profile_link": "",
            "name": "Mayuresh Joshi",
            "about": "Masterstudent der Nutzfahrzeugtechnik Automatisiertes Fahren | Maschinelles Lernen Regelungstechnik | Softwaretechnik",
            "location": "Ludwigsburg"
        }
    ],
    "educations_details": "University of Massachusetts Amherst",
    "education": [
        {
            "title": "University of Massachusetts Amherst",
            "degree": "Master of Science - MS",
            "field": "Computer Science",
            "url": "",
            "start_year": "2023",
            "end_year": "2025",
            "description": "Courses Fall 2023 589 - Machine Learning 682 - Introduction to Neural Networks 532 - Systems for Data Science Courses Spring 2024 685 - Advanced NLP 602 - Business Intelligence and Analytics 574 - Intelligent Visual Computing Courses Fall 2024 646 - Information Retrieval 687 - Reinforcement learning 514 - Algorithms for Data Science",
            "description_html": "Courses Fall 2023 589 - Machine Learning682 - Introduction to Neural Networks532 - Systems for Data ScienceCourses Spring 2024685 - Advanced NLP602 - Business Intelligence and Analytics574 - Intelligent Visual ComputingCourses Fall 2024646 - Information Retrieval687 - Reinforcement learning514 - Algorithms for Data Science <!---->",
            "institute_logo_url": ""
        },
        {
            "title": "Indian Institute of Technology, Kharagpur",
            "degree": "BE - Bachelor of Engineering",
            "field": "Mechanical Engineering",
            "url": "",
            "start_year": "2017",
            "end_year": "2021",
            "description": "Activities and Societies: • General Secretary of Mekanika, official student body of the Mechanical Engineering department • Socio-Cultural Secretary at Mother Teresa Hall of residence • Member of Ad-Design and Vice captain of Prod-Design team • Part of Illumination team, Mother Teresa hall of residence • Active member of women's Volleyball team administered by National Sports Organization, IIT Kharagpur",
            "description_html": "Activities and Societies: • General Secretary of Mekanika, official student body of the Mechanical Engineering department • Socio-Cultural Secretary at Mother Teresa Hall of residence • Member of Ad-Design and Vice captain of Prod-Design team • Part of Illumination team, Mother Teresa hall of residence • Active member of women's Volleyball team administered by National Sports Organization, IIT Kharagpur",
            "institute_logo_url": ""
        }
    ],
    "recommendations_count": 2.0,
    "courses": null,
    "languages": [
        {
            "subtitle": " Native or bilingual proficiency ",
            "title": " Telugu "
        },
        {
            "subtitle": " Full professional proficiency ",
            "title": " English "
        },
        {
            "subtitle": " Professional working proficiency ",
            "title": " Hindi "
        }
    ],
    "certifications": [
        {
            "meta": "Issued Jan 2023",
            "subtitle": "Fractal",
            "title": "SQL developer"
        },
        {
            "meta": "Issued Aug 2021",
            "subtitle": "Fractal",
            "title": "Fractal certified Data Scientist"
        },
        {
            "meta": "Issued Dec 2018",
            "subtitle": "IEEE Student Branch, IIT Kharagpur",
            "title": "Image Processing"
        },
        {
            "meta": "Issued Dec 2018",
            "subtitle": "Coursera",
            "title": "Machine Learning"
        }
    ],
    "recommendations": [
        "Keshav Nag “I have had the pleasure of working closely with Sneha for the past couple of years at Fractal. Sneha is an exceptional data scientist who possesses a rare blend of technical expertise, analytical prowess, and a passion for delivering impactful insights. Throughout our collaboration, she consistently demonstrated an impressive ability to extract meaningful patterns from complex datasets, providing invaluable insights that informed our project decisions. One of Sneha's standout qualities is her proficiency in learning, selecting and applying the right statistical techniques and machine learning algorithms to solve intricate business challenges. Her willingness to keep an open mind and explore alternate solutions helped in solving complex problems in an agile manner. In addition to her technical contributions, Sneha is an excellent team player who actively contributes to brainstorming sessions and engages in constructive discussions. Her collaborative approach and willingness to share knowledge greatly enriched the team's overall performance and created a positive working environment. I highly recommend Sneha to any organization seeking a data scientist/analytics professional who can truly make an impact.”",
        "Abhijeet Boridkar “I am delighted to recommend Sneha for tech roles, particularly data science. I've had the privilege of collaborating with Sneha and can confidently vouch for her exceptional skills and teamwork. Sneha possesses a robust skillset, showcasing expertise in Python, SQL, and Azure. She consistently demonstrates a profound understanding of these technologies and effectively applies them to solve intricate challenges. What sets Sneha apart is her teamwork proficiency. She excels in collaborative environments, fostering shared knowledge and positive group dynamics. Her excellent communication skills ensure seamless information exchange among team members.”"
    ],
    "volunteer_experience": null,
    "followers": 1650.0,
    "connections": 500.0,
    "current_company_company_id": "docket-inc",
    "current_company_name": "Docket Inc",
    "publications": null,
    "patents": null,
    "projects": "[{\"title\":\"Real time tag recommendation system on Stack Overflow data\",\"start_date\":\"Oct 2023\",\"end_date\":\"Nov 2023\",\"description\":\"Developed this as a part of course project where we predicted the tags for Questions and answers dataset of Stack Overflow data which is of 5GB size. Set up the entire Azure environment to host the recommendation system. Created a separate SQL database to store the dataset and for training purposes in Azure environment. Designed the recommendation system in Pyspark using SparkNLP library and created an API out of it to host it in the Azure environment. Made use of the Stackoverflow API to read the data real time and predict the tag for real time queries. Achieved an overall accuracy of 88%. On the entire recommendation system, we also tried to study system based parameters such as runtime changing the threads and more. Recognised as one of the best projects in a class of 100+ people.\"},{\"title\":\"Text augmentation using LLMs\",\"start_date\":\"Oct 2023\",\"end_date\":\"Nov 2023\",\"description\":\"This project was taken up as a part of a course project 682 where we got to understand about Large Language models and key concepts of Natural Language Processing. It is quite common that classification and sentiment based models perform poorly when there is a huge imbalance in the dataset. There exist traditional methods of augmenting using library functions but they may not always necessarily lead the model to learn new features. It was also clear when we compared the augmented texts using traditional library methods, ChatGPT and other LLMs. It was observed that library methods do not produce much diverse augmented text and ChatGPT has done the best of all. Augmentation metrics such as cosine similarity were used to compare the augmentation results. It was observed that the models that used ChatGPT for classification and sentiment analysis tasks performed by at least 10 percent in accuracy.\"},{\"title\":\"Load Runner\",\"start_date\":\"Apr 2023\",\"end_date\":\"Jun 2023\",\"description\":\"Built the optimum shipment using Operations Research optimization algorithms which reduced the trucks used by 20%. Given the list of orders, we built the optimum shipment owing to maximum weight and maximum volume constraints of a given truck. Determined the stacking order owing to stacking weight, stacking index and space dynamics. Visualized the stacking and the list of items in each truck in PowerBI. Achieved overall 10 percent increase in Volume Fill Rate in the trucks compared to default STO order in the warehouse. Nominated for Kaizen star award and attracted more clients using this project.\"},{\"title\":\"Command Center\",\"start_date\":\"May 2022\",\"end_date\":\"Feb 2023\",\"description\":\"Took roles of SQL developer and SME in a cross-functional team of 35+ members to develop and deliver key features. Amended SQL queries to extract data from 6 databases using SSMS and helped in development of features in DevOps. Solely led the automation module which comprised of frontend, backend and testing team. Acted as SME for this automation module which automates the process of giving config inputs for different sites.\"},{\"title\":\"Regeneron Hackathon\",\"start_date\":\"Nov 2021\",\"end_date\":\"Jan 2022\",\"description\":\"Developed an analytics framework that helps to predict the next best patient type for first line usage in wAMD. Given data on patient purchase and medical history of more than 1 million data points, performed patient profiling alongside the analytics framework to predict the next best patient type. Preprocessed the data, synthesized new features and used this to train the model. Pyspark was used to train the model and achieved an accuracy of 87% when used LightGBM model. Implemented shaply analysis on the model to understand the key features affecting the model behavior.\"},{\"title\":\"Crop Classification on Sentinel-2 data\",\"start_date\":\"Jan 2021\",\"end_date\":\"Apr 2021\",\"description\":\"The increasing spatial demand and temporal resolution of satellite data has opened doors to the possibility of creating fine algorithms to predict patterns. In this project, Random Forest and TWDTW methods were implemented at both pixel and field level to observe crop patterns. Started off with understanding the images using different band data to get details such as presence of water, cloud density, vegetation cover and its health. Derived Normalised Difference Vegetative Index at pixel level which is used in further downstream tasks. Segmented the data using Multi Spectral Resolution algorithm and compared the model performances at both pixel and object level data. Observed that model has better accuracy when done at object level than at pixel level by at least 10 percent. TWDTW algorithm performed better than any machine learning algorithm by at least 5 percent.\"}]",
    "organizations": null,
    "location": "San Jose",
    "linkedin_id": "sneha-sree-v",
    "activity": [
        {
            "interaction": "Liked by Sneha Sree V.",
            "link": "",
            "title": "Hey folks! Hope you are doing well! In this post I am gonna share my recent research work to build memory layer for LLMs based on Jeff Hawkins…",
            "img": "",
            "id": "7277393257272094720"
        },
        {
            "interaction": "Liked by Sneha Sree V.",
            "link": "",
            "title": "Ilya confirmed that the scaling laws on model based on throwing compute at the problem is ending (at least as we know it) Data available for pre…",
            "img": "",
            "id": "7273997803159261184"
        },
        {
            "interaction": "Liked by Sneha Sree V.",
            "link": "",
            "title": "Who knew that all those hours spent scrolling through Myntra would one day pay off—literally? 😂 Winning 1st Runner-Up at the Myntra Product…",
            "img": "",
            "id": "7273236995789791232"
        },
        {
            "interaction": "Liked by Sneha Sree V.",
            "link": "",
            "title": "⏳ A Bit Late, but a Story Worth Sharing! ⏳ Back in August, I had the chance to participate in the Accenture B-School Challenge, alongside my amazing…",
            "img": "",
            "id": "7273219828050485248"
        },
        {
            "interaction": "Liked by Sneha Sree V.",
            "link": "",
            "title": "Hosted our semesterly Georgia Tech School of Electrical & Computer Engineering Pre-Finals Wellness Drop-In for students before finals! Always our…",
            "img": "",
            "id": "7270226011714109440"
        },
        {
            "interaction": "Liked by Sneha Sree V.",
            "link": "",
            "title": "I am thrilled to share that I have joined Google as a Software Engineer! I am incredibly grateful to Viviane Alves de Andrade for ensuring a seamless…",
            "img": "",
            "id": "7272472893404422144"
        },
        {
            "interaction": "Liked by Sneha Sree V.",
            "link": "",
            "title": "When I worked for Google, I gave a new joinee a simple task: clean up some messy code. He did. 3 months later, his changes led to an increase of…",
            "img": "",
            "id": "7270066827118964737"
        },
        {
            "interaction": "Liked by Sneha Sree V.",
            "link": "",
            "title": "Thanks to all the collaborators and mentors for making this happening 🙌 and special thanks to my friend Anmol Mekala for onboarding me onto this…",
            "img": "",
            "id": "7269743986985115648"
        },
        {
            "interaction": "Liked by Sneha Sree V.",
            "link": "",
            "title": "From C grade to Competitive Coder: A Journey of Daily Habits 🚀 'Sharper minds rise with the sun' - this age-old wisdom became my coding…",
            "img": "",
            "id": "7267367446322266113"
        },
        {
            "interaction": "Liked by Sneha Sree V.",
            "link": "",
            "title": "🚨NeurIPS 2024 (spotlight) Paper Alert 🚨 ➡️Paper Title: Don't Look Twice: Faster Video Transformers with Run-Length Tokenization 🌟Few pointers…",
            "img": "",
            "id": "7263541409931026433"
        },
        {
            "interaction": "Liked by Sneha Sree V.",
            "link": "",
            "title": "The @UMassBand is going to Macy's! Here's how they're gearing up. #UMassAtMacys Read about it 👉  Watch it 👉…",
            "img": "",
            "id": "7263189125401309185"
        },
        {
            "interaction": "Liked by Sneha Sree V.",
            "link": "",
            "title": "It isn’t everyday that you get to speak to the former British Ambassador to the US less than a day after the election, but then again, the Curve…",
            "img": "",
            "id": "7260345280238075915"
        },
        {
            "interaction": "Liked by Sneha Sree V.",
            "link": "",
            "title": "This Startup is doing what Swiggy and Zomato tried but FAILED to crack! 🚀 Founded in August, Swish is creating headlines by offering Bengaluru’s…",
            "img": "",
            "id": "7260142593177493504"
        },
        {
            "interaction": "Liked by Sneha Sree V.",
            "link": "",
            "title": "New GPT4o jailbreak dropped and it works like a charm :) So if you were to ask how to make LSD ? It won't answer but see this. If you ask GPT4o to…",
            "img": "",
            "id": "7252158851859296256"
        }
    ],
    "linkedin_num_id": 674210399.0,
    "honors_and_awards": [
        {
            "title": "Lear Spotlight Award",
            "publication": "Lear Corporation",
            "date": "2020-08-01T00:00:00.000Z",
            "description": "Honored with Lear Spotlight Award which was awarded to summer interns who had been performing great during the summer of 2020. As a part of the internship, I was mainly responsible for designing the batter cooling subsystem for an electric vehicle."
        }
    ],
    "input": {
        "url": ""
    }
}