{
    "id": "umarmasud",
    "name": "Umar Masud",
    "city": "Toronto, Ontario, Canada",
    "country_code": "CA",
    "position": "ML Research @ Samsung  || MScAC - AI Student @ University of Toronto",
    "posts": null,
    "groups": null,
    "current_company": {},
    "experience": null,
    "people_also_viewed": [
        {
            "profile_link": "",
            "name": "Kshitij Deshpande",
            "about": "MS CS grad @ UC San Diego | Ex-Associate Product Developer @ BMC Software | Full Stack Developer | ML enthusiast | Competitive Coder",
            "location": "Pune"
        },
        {
            "profile_link": "",
            "name": "Jheel Soni",
            "about": null,
            "location": "Bengaluru"
        },
        {
            "profile_link": "",
            "name": "Abhilash Khuntia",
            "about": null,
            "location": "Delhi, India"
        },
        {
            "profile_link": "",
            "name": "Harshil Doshi",
            "about": "Software Engineer at Wells Fargo | VJTI'22",
            "location": "Mumbai"
        },
        {
            "profile_link": "",
            "name": "Utkaarsh Bhaskarwar",
            "about": null,
            "location": "Chicago, IL"
        },
        {
            "profile_link": "",
            "name": "Ayush Gupta",
            "about": "Senior Analyst at Deutsche Bank | Former Intern at Persistent Systems",
            "location": "Shivpuri"
        },
        {
            "profile_link": "",
            "name": "AMIT GUPTA",
            "about": "Software Engineer @Intellisoft Technologies | C# | ASP.NET | MVC | ASP.NET Core | SQL Server | React js",
            "location": "Mawana"
        },
        {
            "profile_link": "",
            "name": "Sumit Rohilla",
            "about": "Software Engineer, Web Developer || Ex - Paytm Money || Problem Solving || Competitive Programming Enthusiast",
            "location": "Noida"
        },
        {
            "profile_link": "",
            "name": "Chandrima Purohit",
            "about": null,
            "location": "Kolkata"
        },
        {
            "profile_link": "",
            "name": "Likith Gowda Manjunath",
            "about": "Technology Intern at MTA, NYC || MS in CS at Stevens Institute of Technology || Full Stack Developer || Actively looking for full-time positions.",
            "location": "Jersey City, NJ"
        },
        {
            "profile_link": "",
            "name": "Rakshith Ramesh",
            "about": null,
            "location": "Mumbai"
        },
        {
            "profile_link": "",
            "name": "Rishi Raj Saxena",
            "about": null,
            "location": "Lucknow"
        },
        {
            "profile_link": "",
            "name": "Shrithi Batthini",
            "about": "Devops Engineer at Jio platforms Ltd",
            "location": "Thane"
        },
        {
            "profile_link": "",
            "name": "Akanksha Yadav",
            "about": "Security Delivery Senior Analyst at Accenture",
            "location": "Mumbai"
        },
        {
            "profile_link": "",
            "name": "Ronak Makwana",
            "about": "Dr. Reddy's laboratories(PPO) | IIM Mumbai MBA(Core)'25 | PDPU Gandhinagar CE'22",
            "location": "Ahmedabad"
        },
        {
            "profile_link": "",
            "name": "Naveen Chandraiah",
            "about": "Master’s in Computer Science | Data Engineer | Siemens Healthineers | Ex- Accenture",
            "location": "Würzburg"
        },
        {
            "profile_link": "",
            "name": "Kirthana S",
            "about": "Trainee Decision Scientist",
            "location": "Chennai"
        },
        {
            "profile_link": "",
            "name": "Rohit Pratap Singh",
            "about": "Software Engineer @Samsung Noida | Ex-R&D Engineer Intern @Samsung | SIH 2020 Winner | CSE HBTU'22",
            "location": "Kanpur Nagar"
        },
        {
            "profile_link": "",
            "name": "Vidhi Sejpal",
            "about": null,
            "location": "Boston, MA"
        },
        {
            "profile_link": "",
            "name": "Anushka Fattepurkar",
            "about": "Analyst at Deloitte USI (Offices of the US)",
            "location": "Hyderabad"
        }
    ],
    "educations_details": "University of Toronto",
    "education": [
        {
            "title": "University of Toronto",
            "degree": "Master of Science in Applied Computing (MScAC)",
            "field": "Artificial Intelligence",
            "url": "",
            "start_year": "2023",
            "end_year": "2025",
            "description": "Relevant Coursework: Computational Imaging, Neural Networks and Deep Learning, Software engineering for machine learning, Visual and mobile computing systems.",
            "description_html": "Relevant Coursework: Computational Imaging, Neural Networks and Deep Learning, Software engineering for machine learning, Visual and mobile computing systems. <!---->",
            "institute_logo_url": ""
        },
        {
            "title": "Jamia Millia Islamia",
            "degree": "Bachelor's degree",
            "field": "Mechanical Engineering",
            "url": "",
            "start_year": "2019",
            "end_year": "2023",
            "description": "Relevant Coursework: Fundamentals of Computing, Data Structures and Computer Programming, Computer Networking, Database Management, Engineering Mathematics (I, II, III), Computer Architecture, Digital Signal Processing.",
            "description_html": "Relevant Coursework: Fundamentals of Computing, Data Structures and Computer Programming, Computer Networking, Database Management, Engineering Mathematics (I, II, III), Computer Architecture, Digital Signal Processing. <!---->",
            "institute_logo_url": ""
        },
        {
            "title": "THE FRANK ANTHONY PUBLIC SCHOOL",
            "degree": "High School",
            "field": "98%",
            "description": null,
            "description_html": null,
            "institute_logo_url": ""
        }
    ],
    "recommendations_count": null,
    "courses": null,
    "languages": null,
    "certifications": null,
    "recommendations": null,
    "volunteer_experience": null,
    "followers": 6033.0,
    "connections": 500.0,
    "current_company_company_id": null,
    "current_company_name": null,
    "publications": "[{\"title\":\"Analysing Statistical methods for Automatic Detection of Image Forgery\",\"subtitle\":\"arXiv\",\"date\":\"November 24, 2021\",\"description\":\"Image manipulation and forgery detection have been a topic of research for more than a decade now. New-age tools and large-scale social platforms have given space for manipulated media to thrive. These media can be potentially dangerous and thus innumerable methods have been designed and tested to prove their robustness in detecting forgery. However, the results reported by state-of-the-art systems indicate that supervised approaches achieve almost perfect performance but only with particular datasets. In this work, we analyze the issue of out-of-distribution generalisability of the current state-of-the-art image forgery detection techniques through several experiments. Our study focuses on models that utilise handcrafted features for image forgery detection. We show that the developed methods fail to perform well on cross-dataset evaluations and in-the-wild manipulated media. As a consequence, a question is raised about the current evaluation and overestimated performance of the systems under consideration. Note: This work was done during a summer research internship at ITMR Lab, IIIT-Allahabad under the supervision of Prof. Anupam Agarwal.\"},{\"title\":\"Comparison of semi-supervised learning methods for High Content Screening quality control.\",\"subtitle\":\"ECCV Workshop 2022\",\"description\":\"Progress in automated microscopy and quantitative image analysis has promoted high-content screening (HCS) as an efficient drug discovery and research tool. While HCS offers to quantify complex cellular phenotypes from images at high throughput, this process can be obstructed by image aberrations such as out-of-focus image blur, fluorophore saturation, debris, a high level of noise, unexpected auto-fluorescence or empty images. While this issue has received moderate attention in the literature, overlooking these artefacts can seriously hamper downstream image processing tasks and hinder detection of subtle phenotypes. It is therefore of primary concern, and a prerequisite, to use quality control in HCS. In this work, we evaluate deep learning options that do not require extensive image annotations to provide a straightforward and easy to use semi-supervised learning solution to this issue. Concretely, we compared the efficacy of recent self-supervised and transfer learning approaches to provide a base encoder to a high throughput artefact image detector. The results of this study suggest that transfer learning methods should be preferred for this task as they not only performed best here but present the advantage of not requiring sensitive hyperparameter settings nor extensive additional training.\"},{\"title\":\"Compressed Image Super-Resolution using Pre-trained Model Assistance\",\"subtitle\":\"COMSYS 2022\",\"description\":\"Single Image Super-Resolution (SISR) has seen flourishing research in the past years witnessing many different solutions ranging from heuristics based to deep learning based models. However, little attention has been paid to compressed images mostly found in the commonplace. The challenge involved with compressed image super-resolution is that there are compression artefacts which makes it even more difficult to learn the high-resolution image from the low-resolution one. To this end, we evaluate a simple, convolution based model which uses a large scale pre-trained feature extractor network for learning during the training phase and then works independently during inference without the pre-trained model, making it a lightweight, deployable solution. The performance of our proposed system is assessed with various existing literature and experimental results show that our technique achieves competitive results in comparison.\"},{\"title\":\"G-PReDICT: Generalizable Person Re-ID using Domain Invariant Contrastive Techniques\",\"subtitle\":\"ICVGIP 2022\",\"description\":\"Learning identity-aware, domain-invariant representations is crucial in solving domain generalizable person ReID (DG-ReID). Existing methods commonly use augmentation techniques either in feature space by mixing instance and batch normalization layers or in pixel space by adversarially generating pseudo domains However, neither of these techniques guarantee identity preservation. Apart from increasing training data diversity, the augmented positive pairs also encode rich semantic relations which have not been fully explored. To address the above issues, we propose a novel framework for Generalizable Person Re-identification using Domain Invariant Contrastive Techniques (G-PReDICT). Specifically, we use simple yet effective perturbation strategies to hallucinate positive samples across domains by realistically modelling domain variations while preserving the target identities. We harness rich sample-sample relations between the hallucinated positive-negative pairs to learn domain invariant representations using supervised contrastive learning. We also use a domain independent auxiliary task, i.e. attribute prediction to learn robust representations and introduce attribute annotations for two large scale public benchmarks i.e. CUHK-03 and MSMT17. Extensive experiments on standard benchmarks demonstrate the effectiveness of the proposed method.\"},{\"title\":\"LW-DeepFakeNet: a lightweight time distributed CNN-LSTM network for real-time DeepFake video detection\",\"description\":\"With the large-scale and pervading social media platforms and the recent advances in generative deep learning techniques, it is nowadays quite common to forge highly-realistic and credible misleading videos known as DeepFakes. These videos mean to alter the original intention behind the video to put forth their hidden ploys. In this work, a simple yet effective lightweight time distributed (LW-DeepFakeNet) model that uses both spatial and temporal information to determine whether the video has been altered is proposed. The model utilizes a transfer learning approach with pre-trained convolutional networks for spatial feature extraction, topped up with LSTMs for temporal information extraction, requiring little training data and time. This research also considers a special use case of DeepFake where a particular video sequence has a scene change and proposes a way to counter the class-imbalance present in the dataset. The resulting model is much lighter with up to 152x times reduction in parameter count while achieving a significant accuracy of 99.24% at a remarkable rate of 80 fps.\"},{\"title\":\"SCS-Net: An efficient and practical approach towards Face Mask Detection\",\"subtitle\":\"ICMLDE 2022\",\"description\":\"Much work has been done in the computer vision domain for the problem of facial mask detection to curb the spread of the Coronavirus disease (COVID-19). Preventive measures developed using deep learning-based models have got enormous attention. With the state-of-the-art results touching perfect accuracies on various models and datasets, two very practical problems are still not addressed - the deployability of the model in the real world and the crucial cases of incorrectly worn masks. To this end, our method proposes a lightweight deep learning model with just 0.12M parameters having up to 496 times reduction as compared to some of the existing models. Our novel architecture of the deep learning model is designed for practical implications in the real world. We also augment an existing dataset with a large set of incorrectly masked face images leading to a more balanced three-class classification problem. A large collection of 25296 synthetically designed incorrect face mask images are provided. This is the first of its kind of data to be proposed with equal diversity and quantity. The proposed model achieves a competitive accuracy of 95.41% on two class classification and 95.54% on the extended three class classification with minimum number of parameters in comparison. The performance of the proposed system is assessed with various state-of-the-art literature and experimental results indicate that our solution is more realistic and rational than many existing works which use overly massive models unsuitable for practical deployability.\"}]",
    "patents": null,
    "projects": "[{\"title\":\"Collection of Deep Learning Projects\",\"start_date\":\"Mar 2021\",\"end_date\":\"Present\",\"description\":\"For learning purposes. Uses image classification techniques to solve problems on publicly available datasets.\"},{\"title\":\"Collection of Machine Learning Projects\",\"start_date\":\"Feb 2021\",\"end_date\":\"Present\",\"description\":\"Purely for practice purpose. Uses classification and regression algorithms to solve problems on publicly available datasets.\"},{\"title\":\"Collection of OpenCV Projects\",\"start_date\":\"Feb 2021\",\"end_date\":\"Present\",\"description\":\"A collection of Computer Vision based projects purely for learning purposes and enhancing the knowledge. Implemented through OpenCV library in python.\"},{\"title\":\"Payment Gateway Integration\",\"start_date\":\"Dec 2020\",\"end_date\":\"Dec 2020\",\"description\":\"This is the Task-3 of Web Development and Design Internship of The Sparks Foundation. The project contains a simple website that has a payment gateway integrated and can be used to donate money(only for demo-purposes). It is hosted on Github.\"},{\"title\":\"Website template for InnerveSOC\",\"start_date\":\"Oct 2020\",\"end_date\":\"Nov 2020\",\"description\":\"As a part of InnerveSOC competition, designed a complete website template for Innerve Tech-Fest 2020, IGDTUW.\"},{\"title\":\"Pro-Crypto\",\"start_date\":\"Dec 2016\",\"end_date\":\"Jan 2017\",\"description\":\"A project on simple encryption-decryption technique, presented for class 10 project.\"}]",
    "organizations": null,
    "location": "Toronto",
    "linkedin_id": "umarmasud",
    "activity": null,
    "linkedin_num_id": 756012258.0,
    "honors_and_awards": [
        {
            "title": "Google Research Week India, 2023",
            "publication": "Google",
            "date": "2023-01-01T00:00:00.000Z",
            "description": "Selected for in-person participation in the Google Research Week India, 2023."
        },
        {
            "title": "Online Asian Machine Learning School (OAMLS)",
            "publication": "ACML 2022",
            "date": "2022-11-01T00:00:00.000Z",
            "description": "Accepted with a full scholarship as a part of ACML 2022"
        },
        {
            "title": "DAAD-WISE Scholarship 2022",
            "publication": "Daad",
            "date": "2022-04-01T00:00:00.000Z",
            "description": "Scholarship for summer research internship in Germany."
        },
        {
            "title": "5th Summer School of AI",
            "publication": "IIIT Hyderabad",
            "date": "2021-08-01T00:00:00.000Z",
            "description": "One amongst 500 participants from around the world."
        },
        {
            "title": "Winner-Innerve Summer of Code Challenge 2020",
            "publication": "Indira Gandhi Delhi Technical University for Women",
            "date": "2020-11-01T00:00:00.000Z",
            "description": null
        },
        {
            "title": "INSPIRE Science Scholarship for Top 1%",
            "publication": "Govt. of India",
            "date": "2019-06-01T00:00:00.000Z",
            "description": "Awarded Scholarship for Higher Studies by virtue of being in India's Top 1% of class 12th board (ISC)."
        },
        {
            "title": "Mr. Harbinder Singth Dugal Rolling Trophy",
            "publication": "The Frank Anthony Public School",
            "date": "2019-01-01T00:00:00.000Z",
            "description": "Awarded for Proficiency in Science ISC-XII"
        },
        {
            "title": "Mr. G W Mayer's Scholarships",
            "publication": "Frank Anthony Public School",
            "date": "2017-08-01T00:00:00.000Z",
            "description": "Awarded merit scholarships for excellence in Mathematics and Science."
        },
        {
            "title": "Shanker Sumeda Rolling Trophy",
            "publication": "Frank Anthony Public School",
            "date": "2017-08-01T00:00:00.000Z",
            "description": "Awarded for Excellence in Academics."
        }
    ],
    "input": {
        "url": ""
    }
}